{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3. GroupCount, Group\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import T\n",
    "from loader import __"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## groupCount()\n",
    "__Get types of vertices__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'continent': 7, 'country': 237, 'version': 1, 'airport': 3374}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a = g.V().groupCount().by(T.label).next()\n",
    "a"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Equivalent to"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "b = g.V().label().groupCount().next()\n",
    "assert a == b"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## group()\n",
    "Also equivalent to"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "c = g.V().group().by(T.label).by(__.count()).next()\n",
    "assert a == c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Count of airports by country__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'PR': 6,\n",
       " 'PT': 14,\n",
       " 'PW': 1,\n",
       " 'PY': 2,\n",
       " 'QA': 1,\n",
       " 'AE': 10,\n",
       " 'AF': 4,\n",
       " 'AG': 1,\n",
       " 'AI': 1,\n",
       " 'AL': 1,\n",
       " 'AM': 2,\n",
       " 'AO': 14,\n",
       " 'AR': 36,\n",
       " 'AS': 1,\n",
       " 'AT': 6,\n",
       " 'RE': 2,\n",
       " 'AU': 124,\n",
       " 'AW': 1,\n",
       " 'AZ': 5,\n",
       " 'RO': 14,\n",
       " 'BA': 4,\n",
       " 'BB': 1,\n",
       " 'RS': 2,\n",
       " 'BD': 7,\n",
       " 'RU': 120,\n",
       " 'BE': 5,\n",
       " 'BF': 2,\n",
       " 'BG': 4,\n",
       " 'RW': 2,\n",
       " 'BH': 1,\n",
       " 'BI': 1,\n",
       " 'BJ': 1,\n",
       " 'BL': 1,\n",
       " 'BM': 1,\n",
       " 'BN': 1,\n",
       " 'BO': 15,\n",
       " 'SA': 26,\n",
       " 'BQ': 3,\n",
       " 'SB': 17,\n",
       " 'BR': 115,\n",
       " 'SC': 2,\n",
       " 'BS': 18,\n",
       " 'SD': 5,\n",
       " 'SE': 39,\n",
       " 'BT': 1,\n",
       " 'SG': 1,\n",
       " 'SH': 2,\n",
       " 'BW': 4,\n",
       " 'SI': 1,\n",
       " 'BY': 2,\n",
       " 'BZ': 13,\n",
       " 'SK': 2,\n",
       " 'SL': 1,\n",
       " 'SN': 3,\n",
       " 'SO': 5,\n",
       " 'CA': 203,\n",
       " 'SR': 1,\n",
       " 'CC': 1,\n",
       " 'SS': 1,\n",
       " 'CD': 11,\n",
       " 'ST': 1,\n",
       " 'CF': 1,\n",
       " 'SV': 1,\n",
       " 'CG': 3,\n",
       " 'CH': 5,\n",
       " 'SX': 1,\n",
       " 'SY': 2,\n",
       " 'CI': 1,\n",
       " 'SZ': 1,\n",
       " 'CK': 6,\n",
       " 'CL': 17,\n",
       " 'CM': 5,\n",
       " 'CN': 209,\n",
       " 'CO': 50,\n",
       " 'TC': 4,\n",
       " 'CR': 13,\n",
       " 'TD': 1,\n",
       " 'CU': 12,\n",
       " 'CV': 7,\n",
       " 'TG': 1,\n",
       " 'CW': 1,\n",
       " 'TH': 32,\n",
       " 'CX': 1,\n",
       " 'TJ': 4,\n",
       " 'CY': 3,\n",
       " 'CZ': 5,\n",
       " 'TL': 1,\n",
       " 'TM': 1,\n",
       " 'TN': 8,\n",
       " 'TO': 1,\n",
       " 'TR': 48,\n",
       " 'TT': 2,\n",
       " 'DE': 33,\n",
       " 'TV': 1,\n",
       " 'TW': 9,\n",
       " 'TZ': 8,\n",
       " 'DJ': 1,\n",
       " 'DK': 8,\n",
       " 'DM': 1,\n",
       " 'DO': 7,\n",
       " 'UA': 15,\n",
       " 'UG': 4,\n",
       " 'UK': 58,\n",
       " 'DZ': 29,\n",
       " 'US': 579,\n",
       " 'EC': 15,\n",
       " 'EE': 3,\n",
       " 'EG': 10,\n",
       " 'EH': 2,\n",
       " 'UY': 2,\n",
       " 'UZ': 11,\n",
       " 'ER': 1,\n",
       " 'VC': 1,\n",
       " 'ES': 42,\n",
       " 'VE': 24,\n",
       " 'ET': 14,\n",
       " 'VG': 2,\n",
       " 'VI': 2,\n",
       " 'VN': 21,\n",
       " 'VU': 26,\n",
       " 'FI': 20,\n",
       " 'FJ': 10,\n",
       " 'FK': 2,\n",
       " 'FM': 4,\n",
       " 'FO': 1,\n",
       " 'FR': 58,\n",
       " 'WF': 2,\n",
       " 'GA': 2,\n",
       " 'WS': 1,\n",
       " 'GD': 1,\n",
       " 'GE': 3,\n",
       " 'GF': 1,\n",
       " 'GG': 2,\n",
       " 'GH': 5,\n",
       " 'GI': 1,\n",
       " 'GL': 14,\n",
       " 'GM': 1,\n",
       " 'GN': 1,\n",
       " 'GP': 1,\n",
       " 'GQ': 2,\n",
       " 'GR': 39,\n",
       " 'GT': 2,\n",
       " 'GU': 1,\n",
       " 'GW': 1,\n",
       " 'GY': 2,\n",
       " 'HK': 1,\n",
       " 'HN': 6,\n",
       " 'HR': 8,\n",
       " 'HT': 2,\n",
       " 'YE': 9,\n",
       " 'HU': 2,\n",
       " 'ID': 67,\n",
       " 'YT': 1,\n",
       " 'IE': 7,\n",
       " 'IL': 5,\n",
       " 'IM': 1,\n",
       " 'IN': 73,\n",
       " 'ZA': 20,\n",
       " 'IQ': 6,\n",
       " 'IR': 44,\n",
       " 'IS': 5,\n",
       " 'IT': 36,\n",
       " 'ZM': 8,\n",
       " 'JE': 1,\n",
       " 'ZW': 3,\n",
       " 'JM': 2,\n",
       " 'JO': 2,\n",
       " 'JP': 63,\n",
       " 'KE': 14,\n",
       " 'KG': 2,\n",
       " 'KH': 3,\n",
       " 'KI': 2,\n",
       " 'KM': 1,\n",
       " 'KN': 2,\n",
       " 'KP': 1,\n",
       " 'KR': 15,\n",
       " 'KS': 1,\n",
       " 'KW': 1,\n",
       " 'KY': 3,\n",
       " 'KZ': 20,\n",
       " 'LA': 8,\n",
       " 'LB': 1,\n",
       " 'LC': 2,\n",
       " 'LK': 6,\n",
       " 'LR': 2,\n",
       " 'LS': 1,\n",
       " 'LT': 3,\n",
       " 'LU': 1,\n",
       " 'LV': 1,\n",
       " 'LY': 10,\n",
       " 'MA': 14,\n",
       " 'MD': 1,\n",
       " 'ME': 2,\n",
       " 'MF': 1,\n",
       " 'MG': 13,\n",
       " 'MH': 2,\n",
       " 'MK': 1,\n",
       " 'ML': 1,\n",
       " 'MM': 14,\n",
       " 'MN': 10,\n",
       " 'MO': 1,\n",
       " 'MP': 2,\n",
       " 'MQ': 1,\n",
       " 'MR': 3,\n",
       " 'MS': 1,\n",
       " 'MT': 1,\n",
       " 'MU': 2,\n",
       " 'MV': 8,\n",
       " 'MW': 2,\n",
       " 'MX': 59,\n",
       " 'MY': 34,\n",
       " 'MZ': 10,\n",
       " 'NA': 4,\n",
       " 'NC': 1,\n",
       " 'NE': 1,\n",
       " 'NF': 1,\n",
       " 'NG': 18,\n",
       " 'NI': 1,\n",
       " 'NL': 5,\n",
       " 'NO': 49,\n",
       " 'NP': 10,\n",
       " 'NR': 1,\n",
       " 'NZ': 25,\n",
       " 'OM': 4,\n",
       " 'PA': 5,\n",
       " 'PE': 20,\n",
       " 'PF': 30,\n",
       " 'PG': 26,\n",
       " 'PH': 38,\n",
       " 'PK': 21,\n",
       " 'PL': 13,\n",
       " 'PM': 1}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').groupCount().by('country').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In select countries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'FR': 58, 'GR': 39, 'BE': 5}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').groupCount().by('country').select('FR','GR','BE').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Count of outgoing vertices for each continent code__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'EU': 583, 'AS': 932, 'NA': 978, 'OC': 284, 'AF': 294, 'AN': 0, 'SA': 303}"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('continent').group().by('code').by(__.out().count()).next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Group all descriptions by their label__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'continent': ['Asia',\n",
       "  'Africa',\n",
       "  'Europe',\n",
       "  'Oceania',\n",
       "  'North America',\n",
       "  'Antarctica',\n",
       "  'South America'],\n",
       " 'country': ['Romania',\n",
       "  'Madagascar',\n",
       "  'Paraguay',\n",
       "  'Iraq',\n",
       "  'Norfolk Island',\n",
       "  'Virgin Islands (US)',\n",
       "  'Congo',\n",
       "  'Zambia',\n",
       "  'Burundi',\n",
       "  'Comoros',\n",
       "  'Portugal',\n",
       "  'Cabo Verde',\n",
       "  'Republic of Korea',\n",
       "  'Nigeria',\n",
       "  'Armenia',\n",
       "  \"Democratic People's Republic of Korea\",\n",
       "  'Brazil',\n",
       "  'Saint Kitts and Nevis',\n",
       "  'Nicaragua',\n",
       "  'Estonia',\n",
       "  'Saudi Arabia',\n",
       "  'Yemen',\n",
       "  'Pakistan',\n",
       "  'Spain',\n",
       "  'Liechtenstein',\n",
       "  'Honduras',\n",
       "  'Sri Lanka',\n",
       "  'Kuwait',\n",
       "  'Chad',\n",
       "  'Switzerland',\n",
       "  'Angola',\n",
       "  'Colombia',\n",
       "  'Albania',\n",
       "  'Bahamas',\n",
       "  'Democratic Republic of the Congo',\n",
       "  'Peru',\n",
       "  'Costa Rica',\n",
       "  'Guatemala',\n",
       "  'Swaziland',\n",
       "  'Lithuania',\n",
       "  'Lao PDR',\n",
       "  'Australia',\n",
       "  'Haiti',\n",
       "  'Cook Islands',\n",
       "  'Sweden',\n",
       "  'Puerto Rico',\n",
       "  'Belize',\n",
       "  'Thailand',\n",
       "  'Saint-Martin (France)',\n",
       "  'Argentina',\n",
       "  'South Sudan',\n",
       "  'Fiji',\n",
       "  'Turks and Caicos Islands',\n",
       "  'Jersey',\n",
       "  'Iceland',\n",
       "  'Viet Nam',\n",
       "  'Macedonia',\n",
       "  'Vanuatu',\n",
       "  'Kiribati',\n",
       "  'Wallis and Futuna Islands',\n",
       "  'Kenya',\n",
       "  'Sint Martin',\n",
       "  'Papua New Guinea',\n",
       "  'Luxembourg',\n",
       "  'Hungary',\n",
       "  'Azerbajan',\n",
       "  'Lebanon',\n",
       "  'British Virgin Islands',\n",
       "  'Malawi',\n",
       "  'Liberia',\n",
       "  'Uzbekistan',\n",
       "  'Mozambique',\n",
       "  'Cyprus',\n",
       "  'Croatia',\n",
       "  'Sierra Leone',\n",
       "  'Solomon Islands',\n",
       "  'Syrian Arab Republic',\n",
       "  'Turkmenistan',\n",
       "  'Northern Mariana Islands',\n",
       "  'Tunisia',\n",
       "  'Qatar',\n",
       "  'Sao Tome and Principe',\n",
       "  'Greece',\n",
       "  'Belarus',\n",
       "  'Bulgaria',\n",
       "  'Georgia',\n",
       "  'Christmas Island',\n",
       "  'Palau',\n",
       "  'Singapore',\n",
       "  'Montserrat',\n",
       "  'Uganda',\n",
       "  'El Salvador',\n",
       "  'Montenegro',\n",
       "  'Togo',\n",
       "  'Brunei',\n",
       "  'Dominica',\n",
       "  'Latvia',\n",
       "  'Guernsey',\n",
       "  'Zimbabwe',\n",
       "  'Russian Federation',\n",
       "  'Slovakia',\n",
       "  'Guinea',\n",
       "  'Norway',\n",
       "  'United Kingdom',\n",
       "  'Mauritania',\n",
       "  'Barbados',\n",
       "  'Italy',\n",
       "  'Jordan',\n",
       "  'Taiwan',\n",
       "  'Bangladesh',\n",
       "  'Saint Vincent and Grenadines',\n",
       "  'Morocco',\n",
       "  'Western Sahara',\n",
       "  'Saint-Barthelemy',\n",
       "  'Ethiopia',\n",
       "  'Burkina Faso',\n",
       "  'Bolivia',\n",
       "  'Moldova',\n",
       "  'Kosovo',\n",
       "  'Czech Republic',\n",
       "  'Marshall Islands',\n",
       "  'Kyrgyzstan',\n",
       "  'Mali',\n",
       "  'Benin',\n",
       "  'Ghana',\n",
       "  'Somalia',\n",
       "  'Algeria',\n",
       "  'Malta',\n",
       "  'Isle of Man',\n",
       "  'Aruba',\n",
       "  'French Polynesia',\n",
       "  'Mayotte',\n",
       "  'Hong Kong',\n",
       "  'Cuba',\n",
       "  'Venezuela',\n",
       "  'China',\n",
       "  'Panama',\n",
       "  'Guam',\n",
       "  'Falkland Islands',\n",
       "  'Saint Lucia',\n",
       "  'Macau',\n",
       "  'Serbia',\n",
       "  'Tonga',\n",
       "  'Myanmar',\n",
       "  'Trinidad and Tobago',\n",
       "  'French Guiana',\n",
       "  'South Africa',\n",
       "  'Ukraine',\n",
       "  'India',\n",
       "  'Cocos (Keeling) Islands',\n",
       "  'Guyana',\n",
       "  'Reunion',\n",
       "  'Jamaica',\n",
       "  'Bermuda',\n",
       "  'Senegal',\n",
       "  'Cameroon',\n",
       "  'Maldives',\n",
       "  'Belgium',\n",
       "  'Ecuador',\n",
       "  'Finland',\n",
       "  'Germany',\n",
       "  'Gibraltar',\n",
       "  'Central African Republic',\n",
       "  'Japan',\n",
       "  'Lesotho',\n",
       "  'Anguilla',\n",
       "  'Canada',\n",
       "  'New Zealand',\n",
       "  'Indonesia',\n",
       "  'Mauritius',\n",
       "  'Timor-Leste',\n",
       "  'Saint Helena',\n",
       "  'Andorra',\n",
       "  'Egypt',\n",
       "  'Federated States of Micronesia',\n",
       "  'Mexico',\n",
       "  'Iran',\n",
       "  'Pitcairn',\n",
       "  'Afghanistan',\n",
       "  'Mongolia',\n",
       "  'Kazakhstan',\n",
       "  'American Samoa',\n",
       "  'Bahrain',\n",
       "  \"Côte d'Ivoire\",\n",
       "  'Uruguay',\n",
       "  'Tanzania',\n",
       "  'Curacao',\n",
       "  'Saint Pierre and Miquelon',\n",
       "  'Slovenia',\n",
       "  'United Arab Emirates',\n",
       "  'Sudan',\n",
       "  'Oman',\n",
       "  'Libya',\n",
       "  'United States',\n",
       "  'Gabon',\n",
       "  'Rwanda',\n",
       "  'Netherlands',\n",
       "  'Faroe Islands',\n",
       "  'Cayman Islands',\n",
       "  'Bosnia and Herzegovina',\n",
       "  'Monaco',\n",
       "  'Equatorial Guinea',\n",
       "  'Botswana',\n",
       "  'Israel',\n",
       "  'San Marino',\n",
       "  'Nauru',\n",
       "  'Cambodia',\n",
       "  'Bhutan',\n",
       "  'Dominican Republic',\n",
       "  'Seychelles',\n",
       "  'Denmark',\n",
       "  'Tuvalu',\n",
       "  'Namibia',\n",
       "  'Guinea-Bissau',\n",
       "  'Niger',\n",
       "  'Djibouti',\n",
       "  'Martinique',\n",
       "  'Nepal',\n",
       "  'Philippines',\n",
       "  'Gambia',\n",
       "  'Bonaire - Sint Eustatius and Saba',\n",
       "  'Antigua and Barbuda',\n",
       "  'Poland',\n",
       "  'Eritrea',\n",
       "  'Austria',\n",
       "  'France',\n",
       "  'Malaysia',\n",
       "  'Turkey',\n",
       "  'Grenada',\n",
       "  'Greenland',\n",
       "  'New Caledonia',\n",
       "  'Guadeloupe',\n",
       "  'Samoa',\n",
       "  'Chile',\n",
       "  'Suriname',\n",
       "  'Tajikistan',\n",
       "  'Ireland'],\n",
       " 'version': ['Version: 0.77 Generated: 2017-10-06 16:24:40 UTC\\nGraph created by Kelvin R. Lawrence\\nPlease let me know of any errors you find in the graph.'],\n",
       " 'airport': ['Bobo Dioulasso Airport',\n",
       "  'Linate Airport',\n",
       "  'Karshi Khanabad Airport',\n",
       "  'Round Lake (Weagamow Lake) Airport',\n",
       "  'Yichang Airport',\n",
       "  'Eirunepé Airport',\n",
       "  'San Diego Lindbergh',\n",
       "  'Nakhchivan Airport',\n",
       "  'Martin Miguel De Guemes International Airport',\n",
       "  'Bryansk Airport',\n",
       "  'Athens, Eleftherios Venizelos International Airport',\n",
       "  'Repulse Bay Airport',\n",
       "  'Eloy Alfaro International Airport',\n",
       "  'Kindu Airport',\n",
       "  'Atqasuk Edward Burnell Sr Memorial Airport',\n",
       "  'Sydney Kingsford Smith',\n",
       "  'Sulaymaniyah International Airport',\n",
       "  'San Jose Airport',\n",
       "  'Libertador Gral D Jose De San Martin Airport',\n",
       "  'Lok Nayak Jayaprakash Airport',\n",
       "  'Munich International Airport',\n",
       "  'Milingimbi Airport',\n",
       "  'Mtwara Airport',\n",
       "  'Pattimura Airport, Ambon',\n",
       "  'Hokitika Airfield',\n",
       "  'Golovin Airport',\n",
       "  'Sokol Airport',\n",
       "  'Okayama Airport',\n",
       "  \"Bao'anying Airport\",\n",
       "  'Cranbrook Airport',\n",
       "  'Silver Creek Airport',\n",
       "  'Gabès Matmata International Airport',\n",
       "  'Igarka Airport',\n",
       "  'Barnstable Municipal Boardman Polando Field',\n",
       "  'Ängelholm-Helsingborg Airport',\n",
       "  'Bellingham International Airport',\n",
       "  'Vanimo Airport',\n",
       "  'Kaitaia Airport',\n",
       "  'Palma De Mallorca Airport',\n",
       "  'East Midlands Airport',\n",
       "  \"Fua'amotu International Airport\",\n",
       "  'Zagreb Airport',\n",
       "  'Kake Airport',\n",
       "  'Guernsey Airport',\n",
       "  'Barisal Airport',\n",
       "  'Belgrade Nikola Tesla Airport',\n",
       "  'Jaime Gonzalez Airport',\n",
       "  'Castlegar/West Kootenay Regional Airport',\n",
       "  'Abu Dhabi International Airport',\n",
       "  'Funafuti International Airport',\n",
       "  'Takotna Airport',\n",
       "  'Funchal, Madeira Airport',\n",
       "  'Pickle Lake Airport',\n",
       "  'Albury Airport',\n",
       "  'Vero Beach Municipal Airport',\n",
       "  'Marce, Angers - Loire Airport',\n",
       "  'Cleveland, Hopkins International Airport',\n",
       "  'Fayetteville Regional Grannis Field',\n",
       "  'Ust-Kamennogorsk Airport',\n",
       "  'Sarajevo International Airport',\n",
       "  'Mananara Nord Airport',\n",
       "  'Vilhelmina Airport',\n",
       "  'Southwest Florida International Airport',\n",
       "  'Penang International Airport',\n",
       "  'Ástor Piazzola International Airport',\n",
       "  'F. D. Roosevelt Airport',\n",
       "  \"Nice-Cote d'Azur Airport\",\n",
       "  'Qurghonteppa International Airport',\n",
       "  'Jixi Xingkaihu Airport',\n",
       "  'Mutiara Airport',\n",
       "  'Curacao, Hato International Airport',\n",
       "  'Komodo (Mutiara II) Airport',\n",
       "  'Dnipropetrovsk International Airport',\n",
       "  'Mc Allen Miller International Airport',\n",
       "  'Capitan Oriel Lea Plaza Airport',\n",
       "  'Sukhothai Airport',\n",
       "  'Caye Caulker Airport',\n",
       "  'Tuktoyaktuk Airport',\n",
       "  'Brownsville South Padre Island International Airport',\n",
       "  'Nanjing Lukou Airport',\n",
       "  'Wiley Post Will Rogers Memorial Airport',\n",
       "  'Beihai Airport',\n",
       "  'Congonhas Airport',\n",
       "  'Marsa Alam International Airport',\n",
       "  'Seychelles International Airport',\n",
       "  'Chico Municipal Airport',\n",
       "  'Havre St Pierre Airport',\n",
       "  'Ipota Airport',\n",
       "  'Invercargill Airport',\n",
       "  'Niederrhein Airport',\n",
       "  'Chandigarh Airport',\n",
       "  'Kananga Airport',\n",
       "  'Goloson International Airport',\n",
       "  'Mauke Airport',\n",
       "  'Kalymnos Airport',\n",
       "  'Vinh Airport',\n",
       "  'Christchurch International Airport',\n",
       "  'Pierre Regional Airport',\n",
       "  'Gustavo Artunduaga Paredes Airport',\n",
       "  'Palenque International Airport',\n",
       "  'Gladstone Airport',\n",
       "  'Beslan Airport',\n",
       "  'Coral Harbour Airport',\n",
       "  'Cap Haitien International Airport',\n",
       "  'Santa Terezinha Airport',\n",
       "  'Juan Mendoza Airport',\n",
       "  'London Stansted Airport',\n",
       "  'Dangriga Airport',\n",
       "  'Liberal Mid-America Regional Airport',\n",
       "  'Kenai Municipal Airport',\n",
       "  'Norwich International Airport',\n",
       "  'Bedourie Airport',\n",
       "  'Hodeidah International Airport',\n",
       "  'Alicante International Airport',\n",
       "  'Moruya Airport',\n",
       "  'Banja Luka International Airport',\n",
       "  'Marechal Rondon Airport',\n",
       "  'Bujumbura International Airport',\n",
       "  'San Salvador Airport',\n",
       "  'Zhuhai Airport',\n",
       "  'Mallam Aminu International Airport',\n",
       "  'Thief River Falls Regional Airport',\n",
       "  'Sandane Airport, Anda',\n",
       "  'Bol Airport',\n",
       "  'General Juan N Alvarez International Airport',\n",
       "  'Kangerlussuaq Airport',\n",
       "  'Fuyang Xiguan Airport',\n",
       "  'Jorge E. Gonzalez Torres Airport',\n",
       "  'Narvik Framnes Airport',\n",
       "  'Clyde River Airport',\n",
       "  'Mikonos Airport',\n",
       "  'Eday Airport',\n",
       "  'Horta Airport',\n",
       "  'Uzhhorod International Airport',\n",
       "  'Albuquerque International Sunport Airport',\n",
       "  'Mataveri Airport',\n",
       "  'San Carlos De Bariloche Airport',\n",
       "  'East Texas Regional Airport',\n",
       "  'Akureyri Airport',\n",
       "  'La Chorrera Airport',\n",
       "  'Visalia Municipal Airport',\n",
       "  'Daegu Airport',\n",
       "  'Senai International Airport',\n",
       "  'Beaver Airport',\n",
       "  'Algiers, Houari Boumediene Airport',\n",
       "  'Postville Airport',\n",
       "  'City of Derry Airport',\n",
       "  'Canaima Airport',\n",
       "  'Biratnagar Airport',\n",
       "  'Nusatupe Airport',\n",
       "  'Kerry Airport',\n",
       "  'Hamadan Airport',\n",
       "  'Shantou Waisha Airport',\n",
       "  'Aneityum Airport',\n",
       "  'North Ronaldsay Airport',\n",
       "  'Sheldon Point Airport',\n",
       "  'Imam Khomeini International Airport',\n",
       "  'Ignatyevo Airport',\n",
       "  'Bologna Guglielmo Marconi Airport',\n",
       "  'Tunxi International Airport',\n",
       "  'Ulaangom Airport',\n",
       "  'Îles-de-la-Madeleine Airport',\n",
       "  'Mae Hong Son Airport',\n",
       "  'Sovetskiy Airport',\n",
       "  'Treasure Cay Airport',\n",
       "  'Hamilton Island Airport',\n",
       "  'Hoonah Airport',\n",
       "  'Presidente Castro Pinto International Airport',\n",
       "  'Providenciales Airport',\n",
       "  \"N'Djamena International Airport\",\n",
       "  'Pescara International Airport',\n",
       "  'Donskoye Airport',\n",
       "  'Emmonak Airport',\n",
       "  'Palm Springs International Airport',\n",
       "  'Axum Airport',\n",
       "  'Angel Albino Corzo International Airport',\n",
       "  'La Romaine Airport',\n",
       "  'Moscow, Domodedovo International Airport',\n",
       "  'Antsirabato Airport',\n",
       "  'Lehigh Valley International Airport',\n",
       "  'Elcho Island Airport',\n",
       "  'Gwadar International Airport',\n",
       "  'Trang Airport',\n",
       "  'Chaoyang Airport',\n",
       "  'Kalibo International Airport',\n",
       "  'Vernal Regional Airport',\n",
       "  'Helena Regional Airport',\n",
       "  'Ngari Gunsa Airport',\n",
       "  'Deputado Luiz Eduardo Magalhães International Airport',\n",
       "  'Parkes Airport',\n",
       "  'Taiyuan Wusu Airport',\n",
       "  'Tulita Airport',\n",
       "  'Jumandy Airport',\n",
       "  'Chefornak Airport',\n",
       "  'Hanamaki Airport',\n",
       "  'Vilhena Airport',\n",
       "  'Nauru International Airport',\n",
       "  'Yeosu Airport',\n",
       "  'Sultan Abdul Aziz Shah International Airport',\n",
       "  'Pointe Noire Airport',\n",
       "  'Orange Airport',\n",
       "  'Awang Airport',\n",
       "  'Nanki Shirahama Airport',\n",
       "  'Gannan Xiahe Airport',\n",
       "  'El Trompillo Airport',\n",
       "  'Skiros Airport',\n",
       "  'Mount Hagen Kagamuga Airport',\n",
       "  'Olympic Dam Airport',\n",
       "  'Walaha Airport',\n",
       "  'La Crosse Municipal Airport',\n",
       "  'Kaukura Airport',\n",
       "  'Charlotte County Airport',\n",
       "  'Kaltag Airport',\n",
       "  'Pisa International Airport',\n",
       "  'Voronezh International Airport',\n",
       "  'Busselton Regional Airport',\n",
       "  'Wapenamanda Airport',\n",
       "  'Nelson Lagoon Airport',\n",
       "  'Oro Negro Airport',\n",
       "  'Tan Tan Airport',\n",
       "  'Thunder Bay Airport',\n",
       "  'Larnaca International Airport',\n",
       "  'Diu Airport',\n",
       "  'Tingo Maria Airport',\n",
       "  'Kiritimati (Christmas Island) - Cassidy International Airport',\n",
       "  'Garden City Regional Airport',\n",
       "  'Donegal Airport',\n",
       "  'Wattay International Airport',\n",
       "  'Attawapiskat Airport',\n",
       "  'Ouzinkie Airport',\n",
       "  'Imperial County Airport',\n",
       "  'John Paul II International Airport Kraków-Balice Airport',\n",
       "  'Da Nang International Airport',\n",
       "  'Tuntutuliak Airport',\n",
       "  'Kokshetau Airport',\n",
       "  'Bratsk Airport',\n",
       "  'Raipur Airport',\n",
       "  'Tirana International Airport Mother Teresa',\n",
       "  'Rabat-Salé Airport',\n",
       "  'Chernobayevka Airport',\n",
       "  'Nogliki Airport',\n",
       "  'Liuting Airport',\n",
       "  'Izumo Airport',\n",
       "  'Osh Airport',\n",
       "  'Northwest Arkansas Regional Airport',\n",
       "  'Capitan FAP Carlos Martinez De Pinillos International Airport',\n",
       "  'Sanday Airport',\n",
       "  'Ouarzazate Airport',\n",
       "  'Charleston Air Force Base-International Airport',\n",
       "  'Long Lellang Airport',\n",
       "  'Comandante FAP German Arias Graziani Airport',\n",
       "  'Lar Airport',\n",
       "  'Ji-Paraná Airport',\n",
       "  'Garoua International Airport',\n",
       "  'Cluj-Napoca International Airport',\n",
       "  'Debrecen International Airport',\n",
       "  'RAAF Base Curtin',\n",
       "  'Horn Island Airport',\n",
       "  'Southeast Texas Regional Airport',\n",
       "  'Teniente Av. Jorge Henrich Arauz Airport',\n",
       "  'Castellon De La Plana Airport',\n",
       "  'Kawthoung Airport',\n",
       "  'Selawik Airport',\n",
       "  'Surat Airport',\n",
       "  'Kingfisher Lake Airport',\n",
       "  'Dalanzadgad Airport',\n",
       "  'Peretola Airport',\n",
       "  'Arenal Airport',\n",
       "  'Windorah Airport',\n",
       "  'Socotra International Airport',\n",
       "  'Saarbrücken Airport',\n",
       "  'Naples International Airport',\n",
       "  'Guilin Liangjiang International Airport',\n",
       "  'Bam Airport',\n",
       "  'Enua Airport',\n",
       "  'Nunapitchuk Airport',\n",
       "  'Orenburg Central Airport',\n",
       "  'Łódź Władysław Reymont Airport',\n",
       "  'Varna Airport',\n",
       "  'Montrose Regional Airport',\n",
       "  'Limbang Airport',\n",
       "  'Luang Namtha Airport',\n",
       "  'Hattiesburg Laurel Regional Airport',\n",
       "  'Roanoke–Blacksburg Regional Airport',\n",
       "  'Supadio Airport',\n",
       "  'Bari Karol Wojtyła Airport',\n",
       "  'Birmingham International Airport',\n",
       "  'Westerland Sylt Airport',\n",
       "  'Longreach Airport',\n",
       "  'Kenora Airport',\n",
       "  'Pevek Airport',\n",
       "  'Muscat International Airport',\n",
       "  'Seoul, Incheon International Airport',\n",
       "  'Sardar Vallabhbhai Patel International Airport',\n",
       "  'Sde Dov Airport',\n",
       "  'Skardu Airport',\n",
       "  'Bastia-Poretta Airport',\n",
       "  'Polokwane International Airport',\n",
       "  'Arba Minch Airport',\n",
       "  'Gobernador Castello Airport',\n",
       "  'Kivalina Airport',\n",
       "  'Lamap Airport',\n",
       "  'Cumaná (Antonio José de Sucre) Airport',\n",
       "  'Geneva-Cointrin International Airport',\n",
       "  'Exeter International Airport',\n",
       "  'Westray Airport',\n",
       "  'Gelendzhik Airport',\n",
       "  'Banjul International Airport',\n",
       "  'Lingling Airport',\n",
       "  'Kodiak Airport',\n",
       "  'Zhaotong Airport',\n",
       "  'Cat Lake Airport',\n",
       "  'Ibiza Airport',\n",
       "  'Fort Wayne International Airport',\n",
       "  'Adirondack Regional Airport',\n",
       "  'Ranai Airport',\n",
       "  'Jammu Airport',\n",
       "  'Taganrog Yuzhny Airport',\n",
       "  'Gove Airport',\n",
       "  'Savannakhet Airport',\n",
       "  'São Pedro Airport',\n",
       "  'Narrandera Airport',\n",
       "  'Hagfors Airport',\n",
       "  'Kassel-Calden Airport',\n",
       "  'Strasbourg Airport',\n",
       "  'Egegik Airport',\n",
       "  'Mayor Buenaventura Vivas International Airport',\n",
       "  'Alferez Fap David Figueroa Fernandini Airport',\n",
       "  'Shageluk Airport',\n",
       "  'Hassan I Airport',\n",
       "  'Tshikapa Airport',\n",
       "  'Dzaoudzi Pamandzi International Airport',\n",
       "  'Long Island Mac Arthur Airport',\n",
       "  'Mytilene International Airport',\n",
       "  'Lanzarote Airport',\n",
       "  'Lonorore Airport',\n",
       "  'Quincy Regional Baldwin Field',\n",
       "  'Bob Baker Memorial Airport',\n",
       "  'Baton Rouge Metropolitan, Ryan Field',\n",
       "  'Minangkabau Airport',\n",
       "  'Eduardo Falla Solano Airport',\n",
       "  'Kiunga Airport',\n",
       "  'Chinggis Khaan International Airport',\n",
       "  'José Leonardo Chirinos Airport',\n",
       "  'Simferopol International Airport',\n",
       "  'Brussels South Charleroi Airport',\n",
       "  'Buckland Airport',\n",
       "  'Røros Airport',\n",
       "  'Khoram Abad Airport',\n",
       "  'Lanseria Airport',\n",
       "  'Sauce Viejo Airport',\n",
       "  'Innsbruck Airport',\n",
       "  'Podkamennaya Tunguska Airport',\n",
       "  'Easterwood Field',\n",
       "  'Changzhi Airport',\n",
       "  'Vigo Airport',\n",
       "  'Wamena Airport',\n",
       "  'Chapecó Airport',\n",
       "  'Narathiwat Airport',\n",
       "  'Stevens Village Airport',\n",
       "  'Badajoz Airport',\n",
       "  'São Jorge Airport',\n",
       "  'Mc Cook Ben Nelson Regional Airport',\n",
       "  'Leirin Airport',\n",
       "  'Wemindji Airport',\n",
       "  'Durango La Plata County Airport',\n",
       "  'Bahia - Jorge Amado Airport',\n",
       "  'Antwerp International Airport (Deurne)',\n",
       "  'Tikehau Airport',\n",
       "  'Ljubljana Jože Pučnik Airport',\n",
       "  'San Jose, Juan Santamaria International Airport',\n",
       "  'Bancasi Airport',\n",
       "  'Iloilo International Airport',\n",
       "  'Elko Regional Airport',\n",
       "  'Madang Airport',\n",
       "  'Xining Caojiabu Airport',\n",
       "  'Chernivtsi International Airport',\n",
       "  'Dole-Tavaux Airport',\n",
       "  'Bemidji Regional Airport',\n",
       "  'Baise Youjiang Airport',\n",
       "  'Cayenne-Rochambeau Airport',\n",
       "  'Brive Souillac Airport',\n",
       "  'Wenshan Puzhehei Airport',\n",
       "  'Kufra Airport',\n",
       "  'Praslin Airport',\n",
       "  'Buluh Tumbang (H A S Hanandjoeddin) Airport',\n",
       "  'Colombo, Bandaranaike International Airport',\n",
       "  'Surat Thani Airport',\n",
       "  'Whatì Airport',\n",
       "  'Nabire Airport',\n",
       "  'Antalya International Airport',\n",
       "  'German Olano Airport',\n",
       "  'Kotoka International Airport',\n",
       "  'Deadhorse Airport',\n",
       "  'Prefeito Doutor João Silva Filho Airport',\n",
       "  'Bingöl Çeltiksuyu Airport',\n",
       "  'Golog Maqin Airport',\n",
       "  'Djibouti-Ambouli Airport',\n",
       "  'Havre City County Airport',\n",
       "  'Sioux Gateway Col. Bud Day Field',\n",
       "  'Ponciano Arriaga International Airport',\n",
       "  'Kadhdhoo Airport',\n",
       "  'Mbandaka Airport',\n",
       "  'Erie International Tom Ridge Field',\n",
       "  'Vancouver',\n",
       "  'Altamira Airport',\n",
       "  'Salzburg Airport',\n",
       "  'Coronel FAP Francisco Secada Vignetta International Airport',\n",
       "  'Jeju International Airport',\n",
       "  'Zhengzhou Xinzheng International Airport',\n",
       "  'Bonriki International Airport',\n",
       "  'Nakhon Si Thammarat Airport',\n",
       "  'General Urquiza Airport',\n",
       "  'Tavie Airport',\n",
       "  'Kzyl-Orda Southwest Airport',\n",
       "  'Tanjung Manis Airport',\n",
       "  'Luxembourg-Findel International Airport',\n",
       "  'Santos Dumont Airport',\n",
       "  'Jiuhuashan Airport',\n",
       "  'Bugulma Airport',\n",
       "  'Gaspé (Michel-Pouliot) Airport',\n",
       "  'Dallas/Fort Worth International Airport',\n",
       "  'North Spirit Lake Airport',\n",
       "  'Saransk Airport',\n",
       "  'Lviv International Airport',\n",
       "  'Tacheng Airport',\n",
       "  'Kapuskasing Airport',\n",
       "  'Brisbane West Wellcamp Airport',\n",
       "  \"Arthur's Town Airport\",\n",
       "  'Tagbilaran Airport',\n",
       "  'Hao Airport',\n",
       "  'Mehrabad International Airport',\n",
       "  'Xilinhot Airport',\n",
       "  'Fukuoka Airport',\n",
       "  'Pokhara Airport',\n",
       "  'Marudi Airport',\n",
       "  'Phu Bai Airport',\n",
       "  'Kolkata, Netaji Subhash Chandra Bose International Airport',\n",
       "  'Osmany International Airport',\n",
       "  'Mário de Almeida Franco Airport',\n",
       "  'Ronald Reagan Washington National Airport',\n",
       "  'Golden Triangle Regional Airport',\n",
       "  'Plovdiv International Airport',\n",
       "  'Glacier Park International Airport',\n",
       "  'Cold Bay Airport',\n",
       "  'Whitehorse / Erik Nielsen International Airport',\n",
       "  'Londolovit Airport',\n",
       "  'Mammoth Yosemite Airport',\n",
       "  'Tainan Airport',\n",
       "  'Mazar I Sharif Airport',\n",
       "  'Port Sudan New International Airport',\n",
       "  'Maumere(Wai Oti) Airport',\n",
       "  'Sinop Airport',\n",
       "  'Midland International Airport',\n",
       "  'Penza Airport',\n",
       "  'Takamatsu Airport',\n",
       "  'Northwest Alabama Regional Airport',\n",
       "  'In Salah Airport',\n",
       "  'Antonio B. Won Pat International Airport',\n",
       "  'St Pierre Airport',\n",
       "  'Tancredo Neves International Airport',\n",
       "  'Trenton Mercer Airport',\n",
       "  'Ruby Airport',\n",
       "  'Homer Airport',\n",
       "  'Buon Ma Thuot Airport',\n",
       "  'Kostanay West Airport',\n",
       "  'Chetumal International Airport',\n",
       "  'Watertown Regional Airport',\n",
       "  'Manuel Márquez de León International Airport',\n",
       "  'Hancock County-Bar Harbor Airport',\n",
       "  'Dakhla Airport',\n",
       "  'Keewaywin Airport',\n",
       "  'Raja Bhoj International Airport',\n",
       "  'Mid Delta Regional Airport',\n",
       "  'Tyler Pounds Regional Airport',\n",
       "  'Craiova Airport',\n",
       "  'Reykjavik, Keflavik International Airport',\n",
       "  'Hemavan Airport',\n",
       "  'Elim Airport',\n",
       "  'Gainesville Regional Airport',\n",
       "  'Columbia Metropolitan Airport',\n",
       "  'Capital City Airport',\n",
       "  'Newquay Cornwall Airport',\n",
       "  'Lampang Airport',\n",
       "  'Long Beach Airport',\n",
       "  'Manhattan Regional Airport',\n",
       "  'Thessaloniki Macedonia International Airport',\n",
       "  'Wuhai Airport',\n",
       "  'Basco Airport',\n",
       "  'Naha Airport',\n",
       "  'Turukhansk Airport',\n",
       "  'Allakaket Airport',\n",
       "  'Osaka, Kansai International Airport',\n",
       "  'Ministro Victor Konder International Airport',\n",
       "  'Nashville International Airport',\n",
       "  'Lien Khuong Airport',\n",
       "  'Prague, Ruzyne International Airport',\n",
       "  'Sigiriya Air Force Base',\n",
       "  'Silvio Pettirossi International Airport',\n",
       "  'Sabzevar National Airport',\n",
       "  'Burlington International Airport',\n",
       "  'Changsha Huanghua International Airport',\n",
       "  'Taoxian Airport',\n",
       "  'Tazadit Airport',\n",
       "  'Sambava Airport',\n",
       "  'Changde Airport',\n",
       "  'Salalah Airport',\n",
       "  'Sevilla Airport',\n",
       "  'Kazi Nazrul Islam Airport',\n",
       "  'Valdez Pioneer Field',\n",
       "  'Salamanca Airport',\n",
       "  'London City Airport',\n",
       "  'Arvidsjaur Airport',\n",
       "  'Rouyn Noranda Airport',\n",
       "  'Edinburgh Airport',\n",
       "  'Eastmain River Airport',\n",
       "  'Zaragoza Air Base',\n",
       "  'Zhijiang Airport',\n",
       "  'Ghadames East Airport',\n",
       "  'Ndola Airport',\n",
       "  'Tulsa International Airport',\n",
       "  'Mangaia Island Airport',\n",
       "  'Erfurt Airport',\n",
       "  'Kasabonika Airport',\n",
       "  'Mangshi Airport',\n",
       "  'Ludhiana Airport',\n",
       "  'Menara Airport',\n",
       "  'Missoula International Airport',\n",
       "  'Dimapur Airport',\n",
       "  'Livingstone Airport',\n",
       "  'Bacău Airport',\n",
       "  'Sirnak Airport',\n",
       "  \"Bangui M'Poko International Airport\",\n",
       "  'Ignacio Agramonte International Airport',\n",
       "  'Joensuu Airport',\n",
       "  'Malmö Sturup Airport',\n",
       "  'Cagliari Elmas Airport',\n",
       "  'Inca Manco Capac International Airport',\n",
       "  \"Sana'a International Airport\",\n",
       "  'Miyako Airport',\n",
       "  'Kalgoorlie Boulder Airport',\n",
       "  'Tunoshna Airport',\n",
       "  'Jorge Wilsterman International Airport',\n",
       "  'Vilankulo Airport',\n",
       "  'Atlas Brasil Cantanhede Airport',\n",
       "  'Pilot Point Airport',\n",
       "  'Moss Airport, Rygge',\n",
       "  'Trondheim Airport, Værnes',\n",
       "  'Santa Rosa Airport',\n",
       "  'Tenerife Norte Airport',\n",
       "  'Xoxocotlán International Airport',\n",
       "  'Bob Hope Airport',\n",
       "  'Dr. Antonio Nicolás Briceño Airport',\n",
       "  'Périgueux-Bassillac Airport',\n",
       "  'Port Elizabeth Airport',\n",
       "  'Xieng Khouang Airport',\n",
       "  'Chişinău International Airport',\n",
       "  'Johan Adolf Pengel International Airport',\n",
       "  'Sapporo, New Chitose Airport',\n",
       "  'Birjand Airport',\n",
       "  'Lycksele Airport',\n",
       "  'Skagway Airport',\n",
       "  'Sibiu International Airport',\n",
       "  'Samos Airport',\n",
       "  'Gazipaşa Airport',\n",
       "  'Jose Marti International Airport',\n",
       "  'Sanming Shaxian Airport',\n",
       "  'Ranong Airport',\n",
       "  'Putao Airport',\n",
       "  'Baltimore/Washington International Airport',\n",
       "  'Tsushima Airport',\n",
       "  'Ain el Beida Airport',\n",
       "  'Jaipur International Airport',\n",
       "  'Belgaum Airport',\n",
       "  'Nyala Airport',\n",
       "  'Sogndal Airport',\n",
       "  'Webequie Airport',\n",
       "  'Beirut Rafic Hariri International Airport',\n",
       "  'Shanghai - Pudong International Airport',\n",
       "  'Yakubu Gowon Airport',\n",
       "  'Block Island State Airport',\n",
       "  'Rennell/Tingoa Airport',\n",
       "  'Kuala Lumpur International Airport',\n",
       "  'Julius Nyerere International Airport',\n",
       "  'Juan Gualberto Gomez International Airport',\n",
       "  'Fort Yukon Airport',\n",
       "  'Chelyabinsk Balandino Airport',\n",
       "  'Blue Grass Airport',\n",
       "  'Gisborne Airport',\n",
       "  'Teniente Julio Gallardo Airport',\n",
       "  'Phu Quoc Airport',\n",
       "  'Cam Ranh Airport',\n",
       "  'Lake Charles Regional Airport',\n",
       "  'Lubumbashi International Airport',\n",
       "  'Pori Airport',\n",
       "  'Manley Hot Springs Airport',\n",
       "  'Jackson Hole Airport',\n",
       "  'Poplar Hill Airport',\n",
       "  'Chris Hadfield Airport',\n",
       "  'Karlovy Vary International Airport',\n",
       "  'Catumbela Airport',\n",
       "  'Owen Roberts International Airport',\n",
       "  'Sharm El Sheikh International Airport',\n",
       "  'Bahías de Huatulco International Airport',\n",
       "  'Arar Domestic Airport',\n",
       "  'George Best Belfast City Airport',\n",
       "  'Yiershi Airport',\n",
       "  'Hooper Bay Airport',\n",
       "  'Hall Beach Airport',\n",
       "  'Trollhättan-Vänersborg Airport',\n",
       "  'Jackson-Medgar Wiley Evers International Airport',\n",
       "  'Yulin Airport',\n",
       "  'Bom Jesus da Lapa Airport',\n",
       "  'Alberto Carnevalli Airport',\n",
       "  'Tozeur Nefta International Airport',\n",
       "  'Memmingen Allgau Airport',\n",
       "  'Sunyani Airport',\n",
       "  'Kelowna International Airport',\n",
       "  'Kerman Airport',\n",
       "  'Araxá Airport',\n",
       "  'Kemi-Tornio Airport',\n",
       "  \"Xi'an Xianyang International Airport\",\n",
       "  'Bisha Airport',\n",
       "  'Raleigh-Durham',\n",
       "  'Sfax Thyna International Airport',\n",
       "  'Kangiqsujuaq (Wakeham Bay) Airport',\n",
       "  'El Bayadh Airport',\n",
       "  'Chennai International Airport',\n",
       "  'Capitán Av. Selin Zeitun Lopez Airport',\n",
       "  'Rar Gwamar Airport',\n",
       "  'Pai Airport',\n",
       "  'Ciampino–G. B. Pastine International Airport',\n",
       "  'Galcaio Airport',\n",
       "  'Scott AFB/Midamerica Airport',\n",
       "  'Mudanjiang Hailang International Airport',\n",
       "  'Los Cabos International Airport',\n",
       "  'Déline Airport',\n",
       "  'Papa Stour Airport',\n",
       "  'Gardabya Airport',\n",
       "  'Gambell Airport',\n",
       "  'Kurumoch International Airport',\n",
       "  'Cochin International Airport',\n",
       "  'Wewak International Airport',\n",
       "  'Zhangjiakou Ningyuan Airport',\n",
       "  'La Nubia Airport',\n",
       "  'Portland International Jetport Airport',\n",
       "  'Key West International Airport',\n",
       "  'Graz Airport',\n",
       "  'Luderitz Airport',\n",
       "  'Petropavlosk South Airport',\n",
       "  'Waynesville-St. Robert Regional Forney field',\n",
       "  'Shigatse Peace Airport',\n",
       "  'Frankfurt-Hahn Airport',\n",
       "  'Lázaro Cárdenas Airport',\n",
       "  'Nevşehir Kapadokya International Airport',\n",
       "  'Piedras Negras International Airport',\n",
       "  'Niagara Falls International Airport',\n",
       "  'Longjia Airport',\n",
       "  'Ivato Airport',\n",
       "  'Francisco de Sa Carneiro Airport',\n",
       "  'JAGS McCartney International Airport',\n",
       "  'Mohamed Boudiaf International Airport',\n",
       "  'Kanas Airport',\n",
       "  'Bogashevo Airport',\n",
       "  'Karluk Airport',\n",
       "  'Warrnambool Airport',\n",
       "  'Hoedspruit Air Force Base Airport',\n",
       "  'Larsen Bay Airport',\n",
       "  'Yinchuan Airport',\n",
       "  'Es Senia Airport',\n",
       "  'Breves Airport',\n",
       "  'Southampton Airport',\n",
       "  'Hihifo Airport',\n",
       "  'Lusaka International Airport',\n",
       "  'Freeport, Grand Bahama International Airport',\n",
       "  'Aalborg Airport',\n",
       "  'Fort Smith Regional Airport',\n",
       "  'Bridgetown, Sir Grantley Adams International Airport',\n",
       "  'Limnos Airport',\n",
       "  'Minatitlán/Coatzacoalcos National Airport',\n",
       "  'Wainwright Airport',\n",
       "  'Abraham González International Airport',\n",
       "  'Sara Airport',\n",
       "  'Playa De Oro International Airport',\n",
       "  'Ishigaki Airport',\n",
       "  'Mianyang Airport',\n",
       "  'Qingyang Airport',\n",
       "  'John A. Osborne Airport',\n",
       "  'V.C. Bird International Airport',\n",
       "  'Quad City International Airport',\n",
       "  'Memanbetsu Airport',\n",
       "  'Pangnirtung Airport',\n",
       "  'Yaoqiang Airport',\n",
       "  'General Rafael Buelna International Airport',\n",
       "  'Ganzhou Airport',\n",
       "  'Brønnøysund Airport',\n",
       "  'Chevak Airport',\n",
       "  'Toyama Airport',\n",
       "  'Hat Yai International Airport',\n",
       "  'Trepell Airport',\n",
       "  'Khudzhand Airport',\n",
       "  'Chios Island National Airport',\n",
       "  'Lincoln Airport',\n",
       "  'Pohang Airport',\n",
       "  'Babelthuap Airport',\n",
       "  'St. Helena Airport',\n",
       "  'Kemerovo Airport',\n",
       "  'Napier Airport',\n",
       "  \"St. Mary's Airport\",\n",
       "  'Momote Airport',\n",
       "  'Lebanon Municipal Airport',\n",
       "  'Ten. Cel. Aviador César Bombonato Airport',\n",
       "  'Stockholm Skavsta Airport',\n",
       "  'Tuguegarao Airport',\n",
       "  'Tabuk Airport',\n",
       "  'Athens Ben Epps Airport',\n",
       "  'Ho Chi Minh City, Tan Son Nhat International Airport',\n",
       "  'Point Hope Airport',\n",
       "  'Zunyi Xinzhou Airport',\n",
       "  'Marina Di Campo Airport',\n",
       "  'Desierto de Atacama Airport',\n",
       "  'Kyaukpyu Airport',\n",
       "  'Qikiqtarjuaq Airport',\n",
       "  \"Lutselk'e Airport\",\n",
       "  'McGhee Tyson Airport',\n",
       "  'Maio Airport',\n",
       "  'Melangguane Airport',\n",
       "  'La Abraq Airport',\n",
       "  'Cheyenne Regional Jerry Olson Field',\n",
       "  'Lloydminster Airport',\n",
       "  'Milos Airport',\n",
       "  'Balmaceda Airport',\n",
       "  'Tokachi-Obihiro Airport',\n",
       "  'Sultan Khairun Babullah Airport',\n",
       "  'South Bend Regional Airport',\n",
       "  'Semipalatinsk Airport',\n",
       "  'Lovell Field',\n",
       "  'Ashgabat Airport',\n",
       "  'Burgos Airport',\n",
       "  'Craig Cove Airport',\n",
       "  'San Luis Valley Regional Bergman Field',\n",
       "  'Bhairahawa Airport',\n",
       "  'Sege Airport',\n",
       "  'Ilorin International Airport',\n",
       "  'Kansas City International Airport',\n",
       "  'Bolshoye Savino Airport',\n",
       "  'Huatugou Airport',\n",
       "  'Orange County/Santa Ana, John Wayne',\n",
       "  'Leonardo da Vinci-Fiumicino International Airport',\n",
       "  'Shaikh Zaid Airport',\n",
       "  'Phoenix-Mesa-Gateway Airport',\n",
       "  'Mora Airport',\n",
       "  'Western Neb. Rgnl/William B. Heilig Airport',\n",
       "  'Yakima Air Terminal McAllister Field',\n",
       "  'Cairo International Airport',\n",
       "  'Mangalore International Airport',\n",
       "  'Bukhara Airport',\n",
       "  'Kearney Regional Airport',\n",
       "  'Dane County Regional Truax Field',\n",
       "  'Maniitsoq Airport',\n",
       "  'Yamagata Airport',\n",
       "  'Marseille Provence Airport',\n",
       "  'Süleyman Demirel International Airport',\n",
       "  'Trieste–Friuli Venezia Giulia Airport',\n",
       "  'Sveg Airport',\n",
       "  'Talagi Airport',\n",
       "  'Esbjerg Airport',\n",
       "  'La Palma Airport',\n",
       "  'Greenville Spartanburg International Airport',\n",
       "  'Kristiansand Airport',\n",
       "  'Kamembe Airport',\n",
       "  'Doomadgee Airport',\n",
       "  'London Heathrow',\n",
       "  'Mariscal Sucre International Airport',\n",
       "  'Chingozi Airport',\n",
       "  'Hongyuan Aba  Airport',\n",
       "  'Mukah Airport',\n",
       "  'Kuusamo Airport',\n",
       "  'Eelde Airport',\n",
       "  'Bamaga Injinoo Airport',\n",
       "  'Coronel E Carvajal Airport',\n",
       "  'Inagua Airport',\n",
       "  'Fort Worth Alliance Airport',\n",
       "  'Kulusuk Airport',\n",
       "  'Fukushima Airport',\n",
       "  'Datong Airport',\n",
       "  'Comiso Airport',\n",
       "  'Omsk Central Airport',\n",
       "  'Inuvik Mike Zubko Airport',\n",
       "  'Brandon Municipal Airport',\n",
       "  'General Abelardo L. Rodríguez International Airport',\n",
       "  'Middle Georgia Regional Airport',\n",
       "  'Norman Wells Airport',\n",
       "  'Araxos Airport',\n",
       "  'Juana Azurduy De Padilla Airport',\n",
       "  'Sultan Syarif Kasim Ii (Simpang Tiga) Airport',\n",
       "  'Rostock-Laage Airport',\n",
       "  'Enrique Olaya Herrera Airport',\n",
       "  'Sochi International Airport',\n",
       "  'Morristown Municipal Airport',\n",
       "  'Ontario International Airport',\n",
       "  'Myrtle Beach International Airport',\n",
       "  'Tête-à-la-Baleine Airport',\n",
       "  'Ndjili International Airport',\n",
       "  'Cherif Al Idrissi Airport',\n",
       "  'Zvartnots International Airport',\n",
       "  'Tirupati Airport',\n",
       "  'Kaadedhdhoo Airport',\n",
       "  'Show Low Regional Airport',\n",
       "  'Palmerston North Airport',\n",
       "  'Gafsa Ksar International Airport',\n",
       "  'Vadsø Airport',\n",
       "  'Rzeszów-Jasionka Airport',\n",
       "  'Ikaria Airport',\n",
       "  'Asheville Regional Airport',\n",
       "  'Al Baha Airport',\n",
       "  'Haikou Meilan International Airport',\n",
       "  'El Salvador International Airport',\n",
       "  'Cacique Aramare Airport',\n",
       "  'Heringsdorf Airport',\n",
       "  'Trabzon International Airport',\n",
       "  'Boston Logan',\n",
       "  'Genoa Cristoforo Colombo Airport',\n",
       "  'Zweibrücken Airport',\n",
       "  'Bhavnagar Airport',\n",
       "  'Teniente Benjamin Matienzo Airport',\n",
       "  'Lamerd Airport',\n",
       "  'El Embrujo Airport',\n",
       "  'Plettenberg Bay Airport',\n",
       "  'Trombetas Airport',\n",
       "  'Cotopaxi International Airport',\n",
       "  'Joshua Mqabuko Nkomo International Airport',\n",
       "  'Haines Airport',\n",
       "  'Sheikh ul Alam Airport',\n",
       "  'Montréal / Saint-Hubert Airport',\n",
       "  'Knox County Regional Airport',\n",
       "  'San Pedro Airport',\n",
       "  'Sioux Lookout Airport',\n",
       "  'Molokai Airport',\n",
       "  'Ørland Airport',\n",
       "  'Fort Dodge Regional Airport',\n",
       "  'Matecaña International Airport',\n",
       "  'Preguiça Airport',\n",
       "  'Quetzalcóatl International Airport',\n",
       "  'Labo Airport',\n",
       "  'San Javier Airport',\n",
       "  'Josefa Camejo International Airport',\n",
       "  'Cheboksary Airport',\n",
       "  'Pangborn Memorial Airport',\n",
       "  'Guillermo León Valencia Airport',\n",
       "  'Spriggs Payne Airport',\n",
       "  'Capitán de Av. Emilio Beltrán Airport',\n",
       "  'Duluth International Airport',\n",
       "  'Aupaluk Airport',\n",
       "  'Panjgur Airport',\n",
       "  'Labasa Airport',\n",
       "  'Peawanuck Airport',\n",
       "  'St Augustin Airport',\n",
       "  'Alta Floresta Airport',\n",
       "  'Sardar-e-Jangal Airport',\n",
       "  'Toliara Airport',\n",
       "  'La Macarena Airport',\n",
       "  'Jiujiang Lushan Airport',\n",
       "  'Aden International Airport',\n",
       "  'Gaziantep International Airport',\n",
       "  'Memorial Field',\n",
       "  'Tri-State/Milton J. Ferguson Field',\n",
       "  'Tel Aviv, Ben Gurion International Airport',\n",
       "  'Nuiqsut Airport',\n",
       "  'Victoria International Airport',\n",
       "  'Mc Kellar Sipes Regional Airport',\n",
       "  'Griffith Airport',\n",
       "  'Kalamazoo Battle Creek International Airport',\n",
       "  'Jesus Teran International Airport',\n",
       "  'Albany Airport',\n",
       "  'Robin Hood Doncaster Sheffield Airport',\n",
       "  'Kandahar Airport',\n",
       "  'Ixtapa Zihuatanejo International Airport',\n",
       "  'Islas Malvinas Airport',\n",
       "  'Ulukhaktok Holman Airport',\n",
       "  'Denny Island Airport',\n",
       "  'Hector International Airport',\n",
       "  'Persian Gulf International Airport',\n",
       "  'Zona da Mata Regional Airport',\n",
       "  'Karratha Airport',\n",
       "  'Akulivik Airport',\n",
       "  'Whakatane Airport',\n",
       "  'Janakpur Airport',\n",
       "  'Patos de Minas Airport',\n",
       "  'Holy Cross Airport',\n",
       "  'Platinum Airport',\n",
       "  'Inhambane Airport',\n",
       "  'Budapest Ferenc Liszt International Airport',\n",
       "  'Mingyueshan Airport',\n",
       "  'General Wayne A. Downing Peoria International Airport',\n",
       "  'Ua Pou Airport',\n",
       "  'Bordeaux-Mérignac Airport',\n",
       "  'Presidente Prudente Airport',\n",
       "  'Togiak Airport',\n",
       "  'Centennial Airport',\n",
       "  'Sultan Aji Muhamad Sulaiman Airport',\n",
       "  'Kao Airport',\n",
       "  'New York John F. Kennedy International Airport',\n",
       "  'Northwest Florida Beaches International Airport',\n",
       "  'Tucson International Airport',\n",
       "  'Kittila Airport',\n",
       "  'Gassim/Prince Nayef bin Abdulaziz Regional Airport',\n",
       "  'Spichenkovo Airport',\n",
       "  'Saertu Airport',\n",
       "  'Cà Mau Airport',\n",
       "  'James M Cox Dayton International Airport',\n",
       "  'Sleetmute Airport',\n",
       "  'Shishmaref Airport',\n",
       "  'Kingman Airport',\n",
       "  'Gurney Airport',\n",
       "  'Abdul Rachman Saleh Airport',\n",
       "  'Savannah Hilton Head International Airport',\n",
       "  'Lal Bahadur Shastri Airport',\n",
       "  'Tampa Padang Airport',\n",
       "  'Hays Regional Airport',\n",
       "  'Sri Guru Ram Dass Jee International Airport',\n",
       "  'Raleigh County Memorial Airport',\n",
       "  'Babo Airport',\n",
       "  'Concord Regional Airport',\n",
       "  'Central Nebraska Regional Airport',\n",
       "  'Al Ahsa Airport',\n",
       "  'Ech Cheliff Airport',\n",
       "  'Governador Valadares Airport',\n",
       "  'Aomori Airport',\n",
       "  'Lima, Jorge Chavez International Airport',\n",
       "  'Robert L. Bradshaw International Airport',\n",
       "  'Elazığ Airport',\n",
       "  'Girona Airport',\n",
       "  'Adi Sumarmo Wiryokusumo Airport',\n",
       "  'Mexico City, Licenciado Benito Juarez International Airport',\n",
       "  'Jacksonville International Airport',\n",
       "  'Enrique Malek International Airport',\n",
       "  'Santo Ângelo Airport',\n",
       "  'Lae Nadzab Airport',\n",
       "  'Al Maktoum International Airport',\n",
       "  'Yibin Caiba Airport',\n",
       "  'Marshall Islands International Airport',\n",
       "  'Capitan Nicolas Rojas Airport',\n",
       "  'Geneina Airport',\n",
       "  'Gheshm Airport',\n",
       "  'Arctic Bay Airport',\n",
       "  'Nnamdi Azikiwe International Airport',\n",
       "  'Brno-Tuřany Airport',\n",
       "  'Nantucket Memorial Airport',\n",
       "  'Henry E Rohlsen Airport',\n",
       "  'Cincinnati Municipal Airport Lunken Field',\n",
       "  'Bayankhongor Airport',\n",
       "  'Dong Hoi Airport',\n",
       "  'Bauru - Arealva Airport',\n",
       "  'Hasanuddin International Airport',\n",
       "  'Diego Aracena Airport',\n",
       "  'Gode Airport',\n",
       "  'Puerto Rico, Luis Munoz International Airport',\n",
       "  'Yelizovo Airport',\n",
       "  'Adıyaman Airport',\n",
       "  'Chuathbaluk Airport',\n",
       "  'Durban, King Shaka International Airport',\n",
       "  'Gerardo Tobar López Airport',\n",
       "  'Campbeltown Airport',\n",
       "  'Katowice International Airport',\n",
       "  'St Paul Island Airport',\n",
       "  'Satu Mare Airport',\n",
       "  'Falcone–Borsellino Airport',\n",
       "  'Watertown International Airport',\n",
       "  'Jonesboro Municipal Airport',\n",
       "  'Stebbins Airport',\n",
       "  'Port Lincoln Airport',\n",
       "  'St. Anthony Airport',\n",
       "  'Brindisi – Salento Airport',\n",
       "  'Las Brujas Airport',\n",
       "  'Chokurdakh Airport',\n",
       "  'Capitán Aníbal Arab Airport',\n",
       "  'Lanai Airport',\n",
       "  'Al Najaf International Airport',\n",
       "  'Zaisan (Zaysan) Airport',\n",
       "  'Dawei Airport',\n",
       "  'Broome International Airport',\n",
       "  'Upernavik Airport',\n",
       "  'Kerikeri Airport',\n",
       "  'Munda Airport',\n",
       "  \"Deadman's Cay Airport\",\n",
       "  'Hamburg Airport',\n",
       "  'Mota Lava Airport',\n",
       "  'Don Miguel Hidalgo Y Costilla International Airport',\n",
       "  'Tallahassee Regional Airport',\n",
       "  'Melbourne Essendon Airport',\n",
       "  'Thargomindah Airport',\n",
       "  'Dera Ismael Khan Airport',\n",
       "  'Taldykorgan Airport',\n",
       "  'Gwangju Airport',\n",
       "  'Vunisea Airport',\n",
       "  'Matthew Spain Airport',\n",
       "  'Tambor Airport',\n",
       "  'King Island Airport',\n",
       "  'Marshall Don Hunter Sr Airport',\n",
       "  ...]}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().group().by(T.label).by('desc').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Runways grouped by code__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'LIN': [2], 'KSQ': [1], 'YIH': [1], 'ZRJ': [1], 'BOY': [1]}"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').limit(5).group().by('code').by('runways').next()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
