{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3. GroupCount, Group\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import T\n",
    "from loader import __"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## groupCount()\n",
    "__Get types of vertices__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'continent': 7, 'country': 237, 'version': 1, 'airport': 3374}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().groupCount().by(T.label).next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Equivalent to"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().label().groupCount().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## group()\n",
    "Also equivalent to"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "x3 = g.V().group().by(T.label).by(__.count()).next()\n",
    "assert x2 == x3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Count of airports by country__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'PR': 6,\n",
       " 'PT': 14,\n",
       " 'PW': 1,\n",
       " 'PY': 2,\n",
       " 'QA': 1,\n",
       " 'AE': 10,\n",
       " 'AF': 4,\n",
       " 'AG': 1,\n",
       " 'AI': 1,\n",
       " 'AL': 1,\n",
       " 'AM': 2,\n",
       " 'AO': 14,\n",
       " 'AR': 36,\n",
       " 'AS': 1,\n",
       " 'AT': 6,\n",
       " 'RE': 2,\n",
       " 'AU': 124,\n",
       " 'AW': 1,\n",
       " 'AZ': 5,\n",
       " 'RO': 14,\n",
       " 'BA': 4,\n",
       " 'BB': 1,\n",
       " 'RS': 2,\n",
       " 'BD': 7,\n",
       " 'RU': 120,\n",
       " 'BE': 5,\n",
       " 'BF': 2,\n",
       " 'BG': 4,\n",
       " 'RW': 2,\n",
       " 'BH': 1,\n",
       " 'BI': 1,\n",
       " 'BJ': 1,\n",
       " 'BL': 1,\n",
       " 'BM': 1,\n",
       " 'BN': 1,\n",
       " 'BO': 15,\n",
       " 'SA': 26,\n",
       " 'SB': 17,\n",
       " 'BQ': 3,\n",
       " 'BR': 115,\n",
       " 'SC': 2,\n",
       " 'BS': 18,\n",
       " 'SD': 5,\n",
       " 'SE': 39,\n",
       " 'BT': 1,\n",
       " 'SG': 1,\n",
       " 'SH': 2,\n",
       " 'BW': 4,\n",
       " 'SI': 1,\n",
       " 'BY': 2,\n",
       " 'BZ': 13,\n",
       " 'SK': 2,\n",
       " 'SL': 1,\n",
       " 'SN': 3,\n",
       " 'SO': 5,\n",
       " 'CA': 203,\n",
       " 'SR': 1,\n",
       " 'SS': 1,\n",
       " 'CC': 1,\n",
       " 'CD': 11,\n",
       " 'ST': 1,\n",
       " 'CF': 1,\n",
       " 'SV': 1,\n",
       " 'CG': 3,\n",
       " 'CH': 5,\n",
       " 'SX': 1,\n",
       " 'CI': 1,\n",
       " 'SY': 2,\n",
       " 'SZ': 1,\n",
       " 'CK': 6,\n",
       " 'CL': 17,\n",
       " 'CM': 5,\n",
       " 'CN': 209,\n",
       " 'CO': 50,\n",
       " 'TC': 4,\n",
       " 'CR': 13,\n",
       " 'TD': 1,\n",
       " 'CU': 12,\n",
       " 'TG': 1,\n",
       " 'CV': 7,\n",
       " 'TH': 32,\n",
       " 'CW': 1,\n",
       " 'CX': 1,\n",
       " 'CY': 3,\n",
       " 'TJ': 4,\n",
       " 'CZ': 5,\n",
       " 'TL': 1,\n",
       " 'TM': 1,\n",
       " 'TN': 8,\n",
       " 'TO': 1,\n",
       " 'TR': 48,\n",
       " 'TT': 2,\n",
       " 'DE': 33,\n",
       " 'TV': 1,\n",
       " 'TW': 9,\n",
       " 'TZ': 8,\n",
       " 'DJ': 1,\n",
       " 'DK': 8,\n",
       " 'DM': 1,\n",
       " 'DO': 7,\n",
       " 'UA': 15,\n",
       " 'UG': 4,\n",
       " 'UK': 58,\n",
       " 'DZ': 29,\n",
       " 'US': 579,\n",
       " 'EC': 15,\n",
       " 'EE': 3,\n",
       " 'EG': 10,\n",
       " 'EH': 2,\n",
       " 'UY': 2,\n",
       " 'UZ': 11,\n",
       " 'VC': 1,\n",
       " 'ER': 1,\n",
       " 'ES': 42,\n",
       " 'VE': 24,\n",
       " 'ET': 14,\n",
       " 'VG': 2,\n",
       " 'VI': 2,\n",
       " 'VN': 21,\n",
       " 'VU': 26,\n",
       " 'FI': 20,\n",
       " 'FJ': 10,\n",
       " 'FK': 2,\n",
       " 'FM': 4,\n",
       " 'FO': 1,\n",
       " 'FR': 58,\n",
       " 'WF': 2,\n",
       " 'GA': 2,\n",
       " 'WS': 1,\n",
       " 'GD': 1,\n",
       " 'GE': 3,\n",
       " 'GF': 1,\n",
       " 'GG': 2,\n",
       " 'GH': 5,\n",
       " 'GI': 1,\n",
       " 'GL': 14,\n",
       " 'GM': 1,\n",
       " 'GN': 1,\n",
       " 'GP': 1,\n",
       " 'GQ': 2,\n",
       " 'GR': 39,\n",
       " 'GT': 2,\n",
       " 'GU': 1,\n",
       " 'GW': 1,\n",
       " 'GY': 2,\n",
       " 'HK': 1,\n",
       " 'HN': 6,\n",
       " 'HR': 8,\n",
       " 'YE': 9,\n",
       " 'HT': 2,\n",
       " 'HU': 2,\n",
       " 'ID': 67,\n",
       " 'YT': 1,\n",
       " 'IE': 7,\n",
       " 'IL': 5,\n",
       " 'IM': 1,\n",
       " 'IN': 73,\n",
       " 'ZA': 20,\n",
       " 'IQ': 6,\n",
       " 'IR': 44,\n",
       " 'IS': 5,\n",
       " 'IT': 36,\n",
       " 'ZM': 8,\n",
       " 'JE': 1,\n",
       " 'ZW': 3,\n",
       " 'JM': 2,\n",
       " 'JO': 2,\n",
       " 'JP': 63,\n",
       " 'KE': 14,\n",
       " 'KG': 2,\n",
       " 'KH': 3,\n",
       " 'KI': 2,\n",
       " 'KM': 1,\n",
       " 'KN': 2,\n",
       " 'KP': 1,\n",
       " 'KR': 15,\n",
       " 'KS': 1,\n",
       " 'KW': 1,\n",
       " 'KY': 3,\n",
       " 'KZ': 20,\n",
       " 'LA': 8,\n",
       " 'LB': 1,\n",
       " 'LC': 2,\n",
       " 'LK': 6,\n",
       " 'LR': 2,\n",
       " 'LS': 1,\n",
       " 'LT': 3,\n",
       " 'LU': 1,\n",
       " 'LV': 1,\n",
       " 'LY': 10,\n",
       " 'MA': 14,\n",
       " 'MD': 1,\n",
       " 'ME': 2,\n",
       " 'MF': 1,\n",
       " 'MG': 13,\n",
       " 'MH': 2,\n",
       " 'MK': 1,\n",
       " 'ML': 1,\n",
       " 'MM': 14,\n",
       " 'MN': 10,\n",
       " 'MO': 1,\n",
       " 'MP': 2,\n",
       " 'MQ': 1,\n",
       " 'MR': 3,\n",
       " 'MS': 1,\n",
       " 'MT': 1,\n",
       " 'MU': 2,\n",
       " 'MV': 8,\n",
       " 'MW': 2,\n",
       " 'MX': 59,\n",
       " 'MY': 34,\n",
       " 'MZ': 10,\n",
       " 'NA': 4,\n",
       " 'NC': 1,\n",
       " 'NE': 1,\n",
       " 'NF': 1,\n",
       " 'NG': 18,\n",
       " 'NI': 1,\n",
       " 'NL': 5,\n",
       " 'NO': 49,\n",
       " 'NP': 10,\n",
       " 'NR': 1,\n",
       " 'NZ': 25,\n",
       " 'OM': 4,\n",
       " 'PA': 5,\n",
       " 'PE': 20,\n",
       " 'PF': 30,\n",
       " 'PG': 26,\n",
       " 'PH': 38,\n",
       " 'PK': 21,\n",
       " 'PL': 13,\n",
       " 'PM': 1}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').groupCount().by('country').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In select countries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'FR': 58, 'GR': 39, 'BE': 5}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').groupCount().by('country').select('FR','GR','BE').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Count of outgoing vertices for each continent code__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'EU': 583, 'AS': 932, 'NA': 978, 'OC': 284, 'AF': 294, 'AN': 0, 'SA': 303}"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('continent').group().by('code').by(__.out().count()).next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Group all descriptions by their label__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'continent': ['North America',\n",
       "  'Asia',\n",
       "  'Europe',\n",
       "  'Antarctica',\n",
       "  'Africa',\n",
       "  'Oceania',\n",
       "  'South America'],\n",
       " 'country': ['Bhutan',\n",
       "  'Mauritania',\n",
       "  'Republic of Korea',\n",
       "  'Bosnia and Herzegovina',\n",
       "  'Saudi Arabia',\n",
       "  'Gabon',\n",
       "  'Australia',\n",
       "  'Armenia',\n",
       "  'Wallis and Futuna Islands',\n",
       "  'Cuba',\n",
       "  'British Virgin Islands',\n",
       "  'Yemen',\n",
       "  'Norway',\n",
       "  'Peru',\n",
       "  'Guam',\n",
       "  'Virgin Islands (US)',\n",
       "  'Rwanda',\n",
       "  'Switzerland',\n",
       "  'Thailand',\n",
       "  'New Zealand',\n",
       "  'Mexico',\n",
       "  'Mali',\n",
       "  'Honduras',\n",
       "  'Estonia',\n",
       "  'Colombia',\n",
       "  'Afghanistan',\n",
       "  'Argentina',\n",
       "  'Cocos (Keeling) Islands',\n",
       "  'Jersey',\n",
       "  'Monaco',\n",
       "  'Guernsey',\n",
       "  'Guadeloupe',\n",
       "  'Swaziland',\n",
       "  'Guinea',\n",
       "  'Marshall Islands',\n",
       "  'South Africa',\n",
       "  'Bonaire - Sint Eustatius and Saba',\n",
       "  'Mongolia',\n",
       "  'Spain',\n",
       "  'Greenland',\n",
       "  'Kuwait',\n",
       "  'Antigua and Barbuda',\n",
       "  'Senegal',\n",
       "  'United Kingdom',\n",
       "  'Tanzania',\n",
       "  'Mozambique',\n",
       "  'Congo',\n",
       "  'Tuvalu',\n",
       "  'American Samoa',\n",
       "  'Egypt',\n",
       "  'Aruba',\n",
       "  'Liberia',\n",
       "  'Macau',\n",
       "  'Anguilla',\n",
       "  'Nigeria',\n",
       "  'Qatar',\n",
       "  'Syrian Arab Republic',\n",
       "  'Norfolk Island',\n",
       "  'Madagascar',\n",
       "  'Grenada',\n",
       "  'Luxembourg',\n",
       "  'Tonga',\n",
       "  'Benin',\n",
       "  'Barbados',\n",
       "  'Belgium',\n",
       "  'Guinea-Bissau',\n",
       "  'Dominican Republic',\n",
       "  'Libya',\n",
       "  'Turkey',\n",
       "  'Pitcairn',\n",
       "  'Finland',\n",
       "  'Comoros',\n",
       "  'Timor-Leste',\n",
       "  'Curacao',\n",
       "  'New Caledonia',\n",
       "  'Myanmar',\n",
       "  'Austria',\n",
       "  'Brazil',\n",
       "  'Costa Rica',\n",
       "  'Germany',\n",
       "  'Jordan',\n",
       "  'Slovenia',\n",
       "  'Cook Islands',\n",
       "  'France',\n",
       "  'Haiti',\n",
       "  'Hong Kong',\n",
       "  'Ghana',\n",
       "  'Uzbekistan',\n",
       "  'Ukraine',\n",
       "  'Saint Vincent and Grenadines',\n",
       "  'Croatia',\n",
       "  'Georgia',\n",
       "  'El Salvador',\n",
       "  'India',\n",
       "  'Liechtenstein',\n",
       "  'Singapore',\n",
       "  'Cayman Islands',\n",
       "  'Nepal',\n",
       "  'Niger',\n",
       "  'Falkland Islands',\n",
       "  'Tunisia',\n",
       "  'Malawi',\n",
       "  'United States',\n",
       "  'Serbia',\n",
       "  'Philippines',\n",
       "  'Azerbajan',\n",
       "  'Zambia',\n",
       "  'Faroe Islands',\n",
       "  'Northern Mariana Islands',\n",
       "  'Latvia',\n",
       "  'South Sudan',\n",
       "  'Martinique',\n",
       "  'Solomon Islands',\n",
       "  'United Arab Emirates',\n",
       "  'China',\n",
       "  \"Côte d'Ivoire\",\n",
       "  'Samoa',\n",
       "  \"Democratic People's Republic of Korea\",\n",
       "  'Angola',\n",
       "  'Greece',\n",
       "  'San Marino',\n",
       "  'Fiji',\n",
       "  'Maldives',\n",
       "  'Cabo Verde',\n",
       "  'Botswana',\n",
       "  'Sao Tome and Principe',\n",
       "  'Suriname',\n",
       "  'Zimbabwe',\n",
       "  'Western Sahara',\n",
       "  'Belize',\n",
       "  'Sweden',\n",
       "  'Puerto Rico',\n",
       "  'Papua New Guinea',\n",
       "  'Japan',\n",
       "  'Nicaragua',\n",
       "  'Isle of Man',\n",
       "  'Equatorial Guinea',\n",
       "  'Sint Martin',\n",
       "  'Iraq',\n",
       "  'Saint-Barthelemy',\n",
       "  'Moldova',\n",
       "  'French Polynesia',\n",
       "  'Italy',\n",
       "  'Canada',\n",
       "  'Portugal',\n",
       "  'Morocco',\n",
       "  'Bangladesh',\n",
       "  'Netherlands',\n",
       "  'Macedonia',\n",
       "  'Hungary',\n",
       "  'Paraguay',\n",
       "  'Malta',\n",
       "  'Mauritius',\n",
       "  'Lebanon',\n",
       "  'Seychelles',\n",
       "  'Democratic Republic of the Congo',\n",
       "  'Turks and Caicos Islands',\n",
       "  'Kosovo',\n",
       "  'Burkina Faso',\n",
       "  'Somalia',\n",
       "  'Pakistan',\n",
       "  'Kiribati',\n",
       "  'Cyprus',\n",
       "  'Chad',\n",
       "  'French Guiana',\n",
       "  'Cameroon',\n",
       "  'Indonesia',\n",
       "  'Montenegro',\n",
       "  'Slovakia',\n",
       "  'Montserrat',\n",
       "  'Andorra',\n",
       "  'Russian Federation',\n",
       "  'Israel',\n",
       "  'Malaysia',\n",
       "  'Bolivia',\n",
       "  'Turkmenistan',\n",
       "  'Bahamas',\n",
       "  'Trinidad and Tobago',\n",
       "  'Bahrain',\n",
       "  'Gibraltar',\n",
       "  'Sri Lanka',\n",
       "  'Poland',\n",
       "  'Lesotho',\n",
       "  'Iran',\n",
       "  'Ireland',\n",
       "  'Palau',\n",
       "  'Albania',\n",
       "  'Eritrea',\n",
       "  'Central African Republic',\n",
       "  'Romania',\n",
       "  'Uganda',\n",
       "  'Guatemala',\n",
       "  'Namibia',\n",
       "  'Venezuela',\n",
       "  'Dominica',\n",
       "  'Belarus',\n",
       "  'Togo',\n",
       "  'Saint Kitts and Nevis',\n",
       "  'Saint Helena',\n",
       "  'Reunion',\n",
       "  'Sierra Leone',\n",
       "  'Ethiopia',\n",
       "  'Saint-Martin (France)',\n",
       "  'Christmas Island',\n",
       "  'Oman',\n",
       "  'Denmark',\n",
       "  'Lithuania',\n",
       "  'Lao PDR',\n",
       "  'Guyana',\n",
       "  'Viet Nam',\n",
       "  'Djibouti',\n",
       "  'Burundi',\n",
       "  'Chile',\n",
       "  'Kenya',\n",
       "  'Panama',\n",
       "  'Czech Republic',\n",
       "  'Sudan',\n",
       "  'Mayotte',\n",
       "  'Gambia',\n",
       "  'Nauru',\n",
       "  'Taiwan',\n",
       "  'Bulgaria',\n",
       "  'Uruguay',\n",
       "  'Vanuatu',\n",
       "  'Saint Pierre and Miquelon',\n",
       "  'Ecuador',\n",
       "  'Kazakhstan',\n",
       "  'Bermuda',\n",
       "  'Cambodia',\n",
       "  'Iceland',\n",
       "  'Jamaica',\n",
       "  'Brunei',\n",
       "  'Kyrgyzstan',\n",
       "  'Tajikistan',\n",
       "  'Saint Lucia',\n",
       "  'Algeria',\n",
       "  'Federated States of Micronesia'],\n",
       " 'version': ['Version: 0.77 Generated: 2017-10-06 16:24:40 UTC\\nGraph created by Kelvin R. Lawrence\\nPlease let me know of any errors you find in the graph.'],\n",
       " 'airport': ['Kerikeri Airport',\n",
       "  'Verona Villafranca Airport',\n",
       "  'Pico Airport',\n",
       "  'East Texas Regional Airport',\n",
       "  'Gothenburg City Airport',\n",
       "  'Raleigh-Durham',\n",
       "  'Tbilisi International Airport',\n",
       "  'Rarotonga International Airport',\n",
       "  'Aurangabad Airport',\n",
       "  'Lipetsk Airport',\n",
       "  'Vnukovo International Airport',\n",
       "  'Robert (Bob) Curtis Memorial Airport',\n",
       "  'Gyumri Shirak Airport',\n",
       "  'Aksu Airport',\n",
       "  'Lima, Jorge Chavez International Airport',\n",
       "  'Dawei Airport',\n",
       "  'Luxor International Airport',\n",
       "  'Ranong Airport',\n",
       "  'General Ignacio P. Garcia International Airport',\n",
       "  'Rock Sound Airport',\n",
       "  'Alexander the Great International Airport',\n",
       "  'El Plumerillo Airport',\n",
       "  'Raiatea Airport',\n",
       "  'Owensboro Daviess County Airport',\n",
       "  'Ulan-Ude Airport (Mukhino)',\n",
       "  'Syracuse Hancock International Airport',\n",
       "  'Lokichoggio Airport',\n",
       "  'Jessore Airport',\n",
       "  'Show Low Regional Airport',\n",
       "  'Fort Nelson Airport',\n",
       "  'Providenciales Airport',\n",
       "  'Dunedin Airport',\n",
       "  'Bojnord Airport',\n",
       "  'Macaé Airport',\n",
       "  'Warsaw Chopin Airport',\n",
       "  'Nusatupe Airport',\n",
       "  'Silvio Pettirossi International Airport',\n",
       "  'Al Massira Airport',\n",
       "  'Sary-Arka Airport',\n",
       "  'Anshun Huangguoshu Airport',\n",
       "  'Jersey Airport',\n",
       "  'Moscow, Sheremetyevo International Airport',\n",
       "  'Zunyi Xinzhou Airport',\n",
       "  'Ngari Gunsa Airport',\n",
       "  'San Luis County Regional Airport',\n",
       "  'Mitiaro Island Airport',\n",
       "  'Virgin Gorda Airport',\n",
       "  'Moscow, Domodedovo International Airport',\n",
       "  'Cozumel International Airport',\n",
       "  'Moenjodaro Airport',\n",
       "  'Four Corners Regional Airport',\n",
       "  'Hawarden Airport',\n",
       "  'Dangriga Airport',\n",
       "  'Karlstad Airport',\n",
       "  'Southwest Georgia Regional Airport',\n",
       "  'Aswan International Airport',\n",
       "  'Caye Caulker Airport',\n",
       "  'Munich International Airport',\n",
       "  'Valdez Pioneer Field',\n",
       "  'Falcone–Borsellino Airport',\n",
       "  'Margate Airport',\n",
       "  'Frankfurt am Main',\n",
       "  'Campbell River Airport',\n",
       "  'Ronneby Airport',\n",
       "  'Lille-Lesquin Airport',\n",
       "  'Tamworth Airport',\n",
       "  'Makemo Airport',\n",
       "  'Imphal Airport',\n",
       "  'Lintsang Airfield',\n",
       "  'Menara Airport',\n",
       "  'Dien Bien Phu Airport',\n",
       "  'Erie International Tom Ridge Field',\n",
       "  'Gannan Xiahe Airport',\n",
       "  'Senadora Eunice Micheles Airport',\n",
       "  'Chita-Kadala Airport',\n",
       "  'Del Bajio International Airport',\n",
       "  'New Orleans L. Armstrong',\n",
       "  'Dr. Antonio Nicolás Briceño Airport',\n",
       "  'Philadelphia International Airport',\n",
       "  'Gillette Campbell County Airport',\n",
       "  'Brno-Tuřany Airport',\n",
       "  'Springfield Branson National Airport',\n",
       "  'Sochi International Airport',\n",
       "  'RAF Ascension Island',\n",
       "  'Dachuan Airport',\n",
       "  'Ataq Airport',\n",
       "  'Ji-Paraná Airport',\n",
       "  'Barkley Regional Airport',\n",
       "  'Almirante Marco Andres Zar Airport',\n",
       "  'Gallatin Field',\n",
       "  'Cape Dorset Airport',\n",
       "  'Mountain Village Airport',\n",
       "  'Liping Airport',\n",
       "  'Loreto International Airport',\n",
       "  'Vanimo Airport',\n",
       "  'Kaitaia Airport',\n",
       "  'Gainesville Regional Airport',\n",
       "  'Coral Harbour Airport',\n",
       "  'Lomé-Tokoin Airport',\n",
       "  'Addis Ababa Bole International Airport',\n",
       "  'Momote Airport',\n",
       "  'Cascavel Airport',\n",
       "  'Mackay Airport',\n",
       "  'Abakan Airport',\n",
       "  'Ngjiva Pereira Airport',\n",
       "  'Piedras Negras International Airport',\n",
       "  'Cheikh Larbi Tébessi Airport',\n",
       "  'Fort Smith Airport',\n",
       "  'Hubli Airport',\n",
       "  'Kazi Nazrul Islam Airport',\n",
       "  'Svolvær Helle Airport',\n",
       "  'Tunxi International Airport',\n",
       "  'Zhanjiang Airport',\n",
       "  'North Ronaldsay Airport',\n",
       "  'Tubuai Airport',\n",
       "  'Turku Airport',\n",
       "  'Batticaloa Airport',\n",
       "  'Reggio Calabria Airport',\n",
       "  'Toulon-Hyères Airport',\n",
       "  'Philibert Tsiranana (Amborovy) Airport',\n",
       "  'Banja Luka International Airport',\n",
       "  'Pilot Point Airport',\n",
       "  'Punta Gorda Airport',\n",
       "  'U-Tapao International Airport',\n",
       "  'Rzeszów-Jasionka Airport',\n",
       "  'Sudbury Airport',\n",
       "  'Ouzinkie Airport',\n",
       "  'Chernivtsi International Airport',\n",
       "  'Reno Taoe International Airport',\n",
       "  'Siwo Airport',\n",
       "  'Datong Airport',\n",
       "  'Baltimore/Washington International Airport',\n",
       "  'Minatitlán/Coatzacoalcos National Airport',\n",
       "  'Tengchong Tuofeng Airport',\n",
       "  'Gerrard Smith International Airport',\n",
       "  'Mataveri Airport',\n",
       "  'Cacoal Airport',\n",
       "  'Aktion National Airport',\n",
       "  'George Airport',\n",
       "  'Lappeenranta Airport',\n",
       "  'Brigadeiro Lysias Rodrigues Airport',\n",
       "  'São Gabriel da Cachoeira Airport',\n",
       "  'Kavieng Airport',\n",
       "  'General Juan N Alvarez International Airport',\n",
       "  'Kangra Airport',\n",
       "  'Scott AFB/Midamerica Airport',\n",
       "  'Resistencia International Airport',\n",
       "  'Melbourne International Airport',\n",
       "  'Lungi International Airport',\n",
       "  'Busselton Regional Airport',\n",
       "  'Il Caravaggio International Airport',\n",
       "  'Khoram Abad Airport',\n",
       "  'Abdul Rachman Saleh Airport',\n",
       "  'La Grande Rivière Airport',\n",
       "  'Araguaína Airport',\n",
       "  'Amado Nervo National Airport',\n",
       "  'Ralph M Calhoun Memorial Airport',\n",
       "  'Tenerife South Airport',\n",
       "  'Eglin Air Force Base',\n",
       "  'Hasanuddin International Airport',\n",
       "  'Sendai Airport',\n",
       "  'Mora Airport',\n",
       "  'Bol Airport',\n",
       "  'Palmerston North Airport',\n",
       "  'Arrachart Airport',\n",
       "  'Gällivare Airport',\n",
       "  'Kangirsuk Airport',\n",
       "  'Centennial Airport',\n",
       "  'Adana Airport',\n",
       "  'Nakhon Si Thammarat Airport',\n",
       "  \"Fua'amotu International Airport\",\n",
       "  'Edward Bodden Airfield',\n",
       "  'Phoenix-Mesa-Gateway Airport',\n",
       "  'Geneina Airport',\n",
       "  'Juan Gualberto Gomez International Airport',\n",
       "  'Port Macquarie Airport',\n",
       "  'Lincoln Airport',\n",
       "  'Yellowstone Regional Airport',\n",
       "  'Lancaster Airport',\n",
       "  'Savannakhet Airport',\n",
       "  'Hengyang Airport',\n",
       "  'Sara Airport',\n",
       "  'Saipan International Airport',\n",
       "  'Hilo International Airport',\n",
       "  'Cayenne-Rochambeau Airport',\n",
       "  'Brunei International Airport',\n",
       "  'Jining Qufu Airport',\n",
       "  'Raivavae Airport',\n",
       "  'Bubung Airport',\n",
       "  'Narsarsuaq Airport',\n",
       "  'Sitka Rocky Gutierrez Airport',\n",
       "  'Tokua Airport',\n",
       "  'Sultan Mahmud Badaruddin Ii Airport',\n",
       "  'Mehamn Airport',\n",
       "  'Maturín Airport',\n",
       "  'Yeager Airport',\n",
       "  'Hamburg Airport',\n",
       "  'Huntsville International Carl T Jones Field',\n",
       "  'Gothenburg-Landvetter Airport',\n",
       "  'Santa Rosa Airport',\n",
       "  'Liupanshui Yuezhao Airport',\n",
       "  'Jyvaskyla Airport',\n",
       "  'Mukah Airport',\n",
       "  'Prof. Eribelto Manoel Reino State Airport',\n",
       "  'Rurutu Airport',\n",
       "  'Malaga Airport',\n",
       "  'São Jorge Airport',\n",
       "  'Mariscal Lamar Airport',\n",
       "  'Gaziantep International Airport',\n",
       "  'Sundsvall-Härnösand Airport',\n",
       "  'Soekarno-Hatta International Airport',\n",
       "  'Leh Kushok Bakula Rimpochee Airport',\n",
       "  'Bintulu Airport',\n",
       "  'Belgorod International Airport',\n",
       "  'Wiley Post Will Rogers Memorial Airport',\n",
       "  'Alula Aba Nega Airport',\n",
       "  'Stord Airport',\n",
       "  'Kalamazoo Battle Creek International Airport',\n",
       "  'Billund Airport',\n",
       "  'Bastia-Poretta Airport',\n",
       "  'Ganja Airport',\n",
       "  'Kuqa Airport',\n",
       "  'Béziers-Vias Airport',\n",
       "  'Mardin Airport',\n",
       "  'Ravensthorpe Airport',\n",
       "  'London Airport',\n",
       "  'Kristianstad Airport',\n",
       "  'Gafsa Ksar International Airport',\n",
       "  'Rota International Airport',\n",
       "  'Abeid Amani Karume International Airport',\n",
       "  'Rovaniemi Airport',\n",
       "  'Al Ahsa Airport',\n",
       "  'Toledo Express Airport',\n",
       "  'Marcos A. Gelabert International Airport',\n",
       "  'Tuluksak Airport',\n",
       "  'Roberts International Airport',\n",
       "  'São Pedro Airport',\n",
       "  'Pemba Airport',\n",
       "  'Kuai, Lihue Airport',\n",
       "  'Milan, Malpensa International Airport',\n",
       "  'Salt Lake City',\n",
       "  'Yellowknife Airport',\n",
       "  'Lankaran International Airport',\n",
       "  'Southeast Iowa Regional Airport',\n",
       "  'Sultan Khairun Babullah Airport',\n",
       "  'Penang International Airport',\n",
       "  'Kitakyūshū Airport',\n",
       "  'Joensuu Airport',\n",
       "  'Almirante Padilla Airport',\n",
       "  'Paraparaumu Airport',\n",
       "  'Persian Gulf International Airport',\n",
       "  'Ernesto Cortissoz International Airport',\n",
       "  'Kithira Airport',\n",
       "  'Gjoa Haven Airport',\n",
       "  'Tauranga Airport',\n",
       "  'Nuku Hiva Airport',\n",
       "  'La Tabatière Airport',\n",
       "  'Val de Cans/Júlio Cezar Ribeiro International Airport',\n",
       "  'Tunoshna Airport',\n",
       "  'Vero Beach Municipal Airport',\n",
       "  'Odate Noshiro Airport',\n",
       "  'Salekhard Airport',\n",
       "  'Dong Hoi Airport',\n",
       "  'Fujairah International Airport',\n",
       "  'Santo Ângelo Airport',\n",
       "  'Bharatpur Airport',\n",
       "  'Ballera Airport',\n",
       "  'Venice, Treviso-Sant Angelo Airport',\n",
       "  'Quetta International Airport',\n",
       "  'Guilin Liangjiang International Airport',\n",
       "  'Iloilo International Airport',\n",
       "  \"Bangui M'Poko International Airport\",\n",
       "  'Murmansk Airport',\n",
       "  'Lanzarote Airport',\n",
       "  'Juba International Airport',\n",
       "  'Mostar International Airport',\n",
       "  'Hangzhou Xiaoshan International Airport',\n",
       "  'Harstad/Narvik Airport, Evenes',\n",
       "  'Brønnøysund Airport',\n",
       "  'Mid Ohio Valley Regional Airport',\n",
       "  'Senou Airport',\n",
       "  'Denver International Airport',\n",
       "  'Bahir Dar Airport',\n",
       "  'Kinmen Airport',\n",
       "  'Moro Airport',\n",
       "  'Prince Rupert Airport',\n",
       "  'Chingozi Airport',\n",
       "  'Pago Pago International Airport',\n",
       "  'Quzhou Airport',\n",
       "  'Toronto Pearson International Airport',\n",
       "  'Trabzon International Airport',\n",
       "  'Tin City Long Range Radar Station Airport',\n",
       "  'Yangon International Airport',\n",
       "  'Luderitz Airport',\n",
       "  'El Caraño Airport',\n",
       "  'Ogle Airport',\n",
       "  'Cluj-Napoca International Airport',\n",
       "  'Sogndal Airport',\n",
       "  'Kotlik Airport',\n",
       "  'Moses Kilangin Airport',\n",
       "  'Lanzhou Zhongchuan Airport',\n",
       "  'Kiritimati (Christmas Island) - Cassidy International Airport',\n",
       "  'Wolter Monginsidi Airport',\n",
       "  'Macau International Airport',\n",
       "  'Ipota Airport',\n",
       "  'Congonhas Airport',\n",
       "  'Del Caribe Santiago Mariño International Airport',\n",
       "  'Osh Airport',\n",
       "  \"Bao'anying Airport\",\n",
       "  'Hamilton International Airport',\n",
       "  'Oshima Airport',\n",
       "  'Dothan Regional Airport',\n",
       "  'Ayers Rock Connellan Airport',\n",
       "  'Presidente João Suassuna Airport',\n",
       "  'Regional de Maringá - Sílvio Nane Junior Airport',\n",
       "  'Al-Jawf Domestic Airport',\n",
       "  'Richmond Airport',\n",
       "  'Cheddi Jagan International Airport',\n",
       "  'Batman Airport',\n",
       "  'Licenciado Manuel Crescencio Rejon Int Airport',\n",
       "  'Pichoy Airport',\n",
       "  \"L'Espérance Airport\",\n",
       "  'Mogador Airport',\n",
       "  'Gode Airport',\n",
       "  'Xiangfan Airport',\n",
       "  'Bremen Airport',\n",
       "  'Jorge E. Gonzalez Torres Airport',\n",
       "  'Kirovsk-Apatity Airport',\n",
       "  'Entebbe International Airport',\n",
       "  'Prague, Ruzyne International Airport',\n",
       "  'Zenata – Messali El Hadj Airport',\n",
       "  'Presidente Prudente Airport',\n",
       "  'Mandalay International Airport',\n",
       "  'South Bend Regional Airport',\n",
       "  'Belgaum Airport',\n",
       "  'Gimpo International Airport',\n",
       "  'Chu Lai International Airport',\n",
       "  'Bolzano Airport',\n",
       "  'Douala International Airport',\n",
       "  'Kuching International Airport',\n",
       "  'Stagen Airport',\n",
       "  'Zakynthos, Dionysios Solomos Airport',\n",
       "  'Hoonah Airport',\n",
       "  'Barcelos Airport',\n",
       "  'Chisasibi Airport',\n",
       "  'Nuremberg Airport',\n",
       "  'Point Salines International Airport',\n",
       "  'Newquay Cornwall Airport',\n",
       "  'Monte Dourado Airport',\n",
       "  'Weifang Airport',\n",
       "  'Florø Airport',\n",
       "  'Udon Thani Airport',\n",
       "  'Abilene Regional Airport',\n",
       "  'Kaltag Airport',\n",
       "  'Figari Sud-Corse Airport',\n",
       "  'Paphos International Airport',\n",
       "  'Plácido de Castro Airport',\n",
       "  'Page Municipal Airport',\n",
       "  'Owen Roberts International Airport',\n",
       "  'Ikaria Airport',\n",
       "  'Akureyri Airport',\n",
       "  'Akron Canton Regional Airport',\n",
       "  'Miyako Airport',\n",
       "  'Lycksele Airport',\n",
       "  'Erfurt Airport',\n",
       "  'Arnold Palmer Regional Airport',\n",
       "  'Aneityum Airport',\n",
       "  'Texarkana Regional Webb Field',\n",
       "  'Burketown Airport',\n",
       "  'Xieng Khouang Airport',\n",
       "  'Bournemouth Airport',\n",
       "  'Windsor Airport',\n",
       "  'Itaituba Airport',\n",
       "  'Rhodes, Diagoras Airport',\n",
       "  'Toamasina Airport',\n",
       "  'Northeast Florida Regional Airport',\n",
       "  'Bauru - Arealva Airport',\n",
       "  'Brisbane West Wellcamp Airport',\n",
       "  'Achmad Yani Airport',\n",
       "  'Nepalgunj Airport',\n",
       "  'Fascene Airport',\n",
       "  'Porbandar Airport',\n",
       "  'Edinburgh Airport',\n",
       "  'Faisalabad International Airport',\n",
       "  'Copernicus Wroclaw Airport',\n",
       "  'San Sebastian Airport',\n",
       "  'Jerez Airport',\n",
       "  'Amsterdam Airport Schiphol',\n",
       "  'Garden City Regional Airport',\n",
       "  'Coronel Artilleria Victor Larrea Airport',\n",
       "  'Nizhny Novgorod International Airport',\n",
       "  'Yakutat Airport',\n",
       "  'Iskandar Airport',\n",
       "  'Juan Pablo Pérez Alfonso Airport',\n",
       "  'Delta County Airport',\n",
       "  'Shannon Airport',\n",
       "  'Beira Airport',\n",
       "  'Gonder Airport',\n",
       "  'Grand Canyon National Park Airport',\n",
       "  'Lismore Airport',\n",
       "  'Loei Airport',\n",
       "  'Majeed Bin Abdulaziz Airport',\n",
       "  'Tegucigalpa, Toncontin International Airport',\n",
       "  'Maui, Kahului Airport',\n",
       "  'Stornoway Airport',\n",
       "  'La Nubia Airport',\n",
       "  'Durango La Plata County Airport',\n",
       "  'Flinders Island Airport',\n",
       "  'Calvi-Sainte-Catherine Airport',\n",
       "  'Astypalaia Airport',\n",
       "  'Clovis Municipal Airport',\n",
       "  'Capitan Nicolas Rojas Airport',\n",
       "  'Betoambari Airport',\n",
       "  'Dera Ghazi Khan Airport',\n",
       "  'Colombo, Bandaranaike International Airport',\n",
       "  'Astana International Airport',\n",
       "  'Malatya Erhaç Airport',\n",
       "  'Wagga Wagga City Airport',\n",
       "  'Terrace Airport',\n",
       "  'Limbang Airport',\n",
       "  'Capital City Airport',\n",
       "  'Chuathbaluk Airport',\n",
       "  'Choibalsan Airport',\n",
       "  'Roshchino International Airport',\n",
       "  'Girua Airport',\n",
       "  'Shreveport Regional Airport',\n",
       "  'Kansas City International Airport',\n",
       "  'Mayaguana Airport',\n",
       "  'Varna Airport',\n",
       "  'Port Bouet Airport',\n",
       "  'Dongshan Airport',\n",
       "  'Pinto Martins International Airport',\n",
       "  'Seattle-Tacoma',\n",
       "  'Boryspil International Airport',\n",
       "  'Jizan Regional Airport',\n",
       "  'General Roberto Fierro Villalobos International Airport',\n",
       "  'Rotuma Airport',\n",
       "  'Ben Schoeman Airport',\n",
       "  'Darwin International Airport',\n",
       "  'Norsup Airport',\n",
       "  'Piedmont Triad International Airport',\n",
       "  'Clyde River Airport',\n",
       "  'New York John F. Kennedy International Airport',\n",
       "  'Hermanos Serdán International Airport',\n",
       "  'Alpena County Regional Airport',\n",
       "  'Brigadier Antonio Parodi Airport',\n",
       "  'Moruya Airport',\n",
       "  'Puerto Escondido International Airport',\n",
       "  'Saarbrücken Airport',\n",
       "  'Deadhorse Airport',\n",
       "  'Zemunik Airport',\n",
       "  'Playa De Oro International Airport',\n",
       "  'Yampa Valley Airport',\n",
       "  'Fort Severn Airport',\n",
       "  'Albury Airport',\n",
       "  'Moomba Airport',\n",
       "  'Waynesville-St. Robert Regional Forney field',\n",
       "  'Castres-Mazamet Airport',\n",
       "  'Bearskin Lake Airport',\n",
       "  'Bandara International Lombok Airport',\n",
       "  'Aruba, Queen Beatrix International Airport',\n",
       "  'Nikolai Airport',\n",
       "  'El Paso International Airport',\n",
       "  'Lilongwe International Airport',\n",
       "  'Naha Airport',\n",
       "  'St Pierre Airport',\n",
       "  'Wuhai Airport',\n",
       "  'Usinsk Airport',\n",
       "  'Yakutsk Airport',\n",
       "  'Dole-Tavaux Airport',\n",
       "  'Pattimura Airport, Ambon',\n",
       "  'Yulin Airport',\n",
       "  'Gustavo Vargas Airport',\n",
       "  'Mannheim-City Airport',\n",
       "  'Ulanhot Airport',\n",
       "  'Tokachi-Obihiro Airport',\n",
       "  'Montrose Regional Airport',\n",
       "  'Menorca Airport',\n",
       "  'Houghton County Memorial Airport',\n",
       "  'Surgut Airport',\n",
       "  'Thessaloniki Macedonia International Airport',\n",
       "  'Husein Sastranegara International Airport',\n",
       "  'Milos Airport',\n",
       "  'Charleville Airport',\n",
       "  'Peshawar International Airport',\n",
       "  'Golog Maqin Airport',\n",
       "  'Glasgow Prestwick Airport',\n",
       "  'Rock Springs Sweetwater County Airport',\n",
       "  'Point Lay LRRS Airport',\n",
       "  'Saurimo Airport',\n",
       "  'Cincinnati Municipal Airport Lunken Field',\n",
       "  'Healy River Airport',\n",
       "  'Mangalore International Airport',\n",
       "  'Horn Island Airport',\n",
       "  'Southwest Florida International Airport',\n",
       "  'Portland International Jetport Airport',\n",
       "  'Lorient South Brittany (Bretagne Sud) Airport',\n",
       "  'Kastoria National Airport',\n",
       "  'Asaba International Airport',\n",
       "  'Karlsruhe Baden-Baden Airport',\n",
       "  'Taree Airport',\n",
       "  'Calbayog Airport',\n",
       "  'Gelendzhik Airport',\n",
       "  'Sir Seretse Khama International Airport',\n",
       "  'Telluride Regional Airport',\n",
       "  'Luoyang Airport',\n",
       "  'Oulu Airport',\n",
       "  'Dortmund Airport',\n",
       "  'Ürümqi Diwopu International Airport',\n",
       "  'Mörön Airport',\n",
       "  'Evansville Regional Airport',\n",
       "  'Chambéry-Savoie Airport',\n",
       "  'Mianyang Airport',\n",
       "  'Lengpui Airport',\n",
       "  'Clermont-Ferrand Auvergne Airport',\n",
       "  'Mytilene International Airport',\n",
       "  'Lynchburg Regional Preston Glenn Field',\n",
       "  'Kédougou Airport',\n",
       "  'Noyabrsk Airport',\n",
       "  'Delma Island',\n",
       "  'Cumaná (Antonio José de Sucre) Airport',\n",
       "  'Kagoshima Airport',\n",
       "  'Natashquan Airport',\n",
       "  'Syros Airport',\n",
       "  'Jonesboro Municipal Airport',\n",
       "  'Kashgar Airport',\n",
       "  'Sam Ratulangi Airport',\n",
       "  'Makung Airport',\n",
       "  'Palanga International Airport',\n",
       "  'Fredericton Airport',\n",
       "  'Cabo Frio Airport',\n",
       "  'Puerto Vallarta, Licenciado Gustavo Diaz Ordaz International Airport',\n",
       "  'Kingston Norman Rogers Airport',\n",
       "  'Wynyard Airport',\n",
       "  'Seymour Airport',\n",
       "  'Ain Arnat Airport',\n",
       "  'Kiunga Airport',\n",
       "  'Bogashevo Airport',\n",
       "  'Las Américas International Airport',\n",
       "  'Brainerd Lakes Regional Airport',\n",
       "  'Dundee Airport',\n",
       "  'Changzhoudao Airport',\n",
       "  'Taiyuan Wusu Airport',\n",
       "  'Bali - Ngurah Rai International Airport',\n",
       "  'Suvarnabhumi Bangkok International Airport',\n",
       "  'Francisco B. Reyes Airport',\n",
       "  'Kingston, Norman Manley International Airport',\n",
       "  'Greenville Spartanburg International Airport',\n",
       "  'New Plymouth Airport',\n",
       "  'Tri Cities Regional Tn Va Airport',\n",
       "  'Ho Chi Minh City, Tan Son Nhat International Airport',\n",
       "  'Jamestown Regional Airport',\n",
       "  'Sharurah Airport',\n",
       "  'Sihanoukville International Airport',\n",
       "  'Lahad Datu Airport',\n",
       "  'Vijayawada Airport',\n",
       "  'Merimbula Airport',\n",
       "  'Glasgow International Airport',\n",
       "  'Flagstaff Pulliam Airport',\n",
       "  'El Salvador International Airport',\n",
       "  'Arcata Airport',\n",
       "  'Yibin Caiba Airport',\n",
       "  'Hall Beach Airport',\n",
       "  'Biarritz-Anglet-Bayonne Airport',\n",
       "  'Chania International Airport',\n",
       "  'Jorge Newbery Airpark',\n",
       "  'Kuito Airport',\n",
       "  'Port Hardy Airport',\n",
       "  'Laughlin Bullhead International Airport',\n",
       "  'La Florida Airport',\n",
       "  'V.C. Bird International Airport',\n",
       "  'Cocos (Keeling) Islands Airport',\n",
       "  'Silver Creek Airport',\n",
       "  'Bakalalan Airport',\n",
       "  'LTS Pulau Redang Airport',\n",
       "  'Churchill Falls Airport',\n",
       "  'Cortez Municipal Airport',\n",
       "  'Mulu Airport',\n",
       "  'Schefferville Airport',\n",
       "  'Mid Delta Regional Airport',\n",
       "  'Nea Anchialos Airport',\n",
       "  'Penticton Airport',\n",
       "  'Okha Airport',\n",
       "  'Alicante International Airport',\n",
       "  'Turin Airport',\n",
       "  'Sheridan County Airport',\n",
       "  'Merced Regional Macready Field',\n",
       "  'Babo Airport',\n",
       "  'Suceava Stefan cel Mare Airport',\n",
       "  'Charlotte County Airport',\n",
       "  'Erzurum International Airport',\n",
       "  'Kodiak Airport',\n",
       "  'Sandy Lake Airport',\n",
       "  'Gu-Lian Airport',\n",
       "  'Transilvania Târgu Mureş International Airport',\n",
       "  'Herat Airport',\n",
       "  'Tikehau Airport',\n",
       "  'Memphis International Airport',\n",
       "  'Newark, Liberty',\n",
       "  'Beaver Airport',\n",
       "  'Dong Tac Airport',\n",
       "  'Birch Creek Airport',\n",
       "  'Quinhagak Airport',\n",
       "  'Miri Airport',\n",
       "  'El Tajín National Airport',\n",
       "  'Osijek Airport',\n",
       "  'Araçatuba Airport',\n",
       "  'Rapid City Regional Airport',\n",
       "  'Omsk Central Airport',\n",
       "  'Montréal / Saint-Hubert Airport',\n",
       "  'Iliamna Airport',\n",
       "  'Bayannur Tianjitai Airport',\n",
       "  'Leros Airport',\n",
       "  'Kamloops Airport',\n",
       "  'Nauru International Airport',\n",
       "  'St George Airport',\n",
       "  'Massena International Richards Field',\n",
       "  'Vernal Regional Airport',\n",
       "  'Kursk East Airport',\n",
       "  'Nîmes-Arles-Camargue Airport',\n",
       "  'Norfolk Island International Airport',\n",
       "  'Dryden Regional Airport',\n",
       "  'Montpellier-Méditerranée Airport',\n",
       "  'Kamembe Airport',\n",
       "  'Kalibo International Airport',\n",
       "  'Xuzhou Guanyin Airport',\n",
       "  'Gazipaşa Airport',\n",
       "  'Kapuskasing Airport',\n",
       "  'Alta Airport',\n",
       "  'Buenos Aires, Ministro Pistarini International Airport',\n",
       "  'Norwich International Airport',\n",
       "  'Eilat Airport',\n",
       "  'Vitebsk East Airport',\n",
       "  'Uzhhorod International Airport',\n",
       "  'Sapporo, New Chitose Airport',\n",
       "  'General Manuel Carlos Piar International Airport',\n",
       "  'Providence, Theodore Francis Green State Airport',\n",
       "  'Atlantic City International Airport',\n",
       "  'Aalborg Airport',\n",
       "  'Tawau Airport',\n",
       "  'Klamath Falls Airport',\n",
       "  'Namangan Airport',\n",
       "  'Lourdes de Blanc Sablon Airport',\n",
       "  'Central Nebraska Regional Airport',\n",
       "  'Kulob Airport',\n",
       "  'Kangiqsujuaq (Wakeham Bay) Airport',\n",
       "  'Mtwara Airport',\n",
       "  'Rabil Airport',\n",
       "  'Nis Constantine the Great Airport',\n",
       "  'Cavern City Air Terminal',\n",
       "  'Querétaro Intercontinental Airport',\n",
       "  'Rach Gia Airport',\n",
       "  'Vanguardia Airport',\n",
       "  'Manley Hot Springs Airport',\n",
       "  'Sanya Phoenix International Airport',\n",
       "  'Friedrichshafen Airport',\n",
       "  'Don Miguel Hidalgo Y Costilla International Airport',\n",
       "  'Aerotortuguero Airport',\n",
       "  'Norman Y. Mineta San Jose International Airport',\n",
       "  'Jamnagar Airport',\n",
       "  'Hilton Head Airport',\n",
       "  'Aurillac Airport',\n",
       "  'Fort Chipewyan Airport',\n",
       "  'Pdte. Carlos Ibañez del Campo Airport',\n",
       "  'Biskra Airport',\n",
       "  'Mallam Aminu International Airport',\n",
       "  'Colonel Hill Airport',\n",
       "  'Khovd Airport',\n",
       "  'Kiev Zhuliany International Airport',\n",
       "  'Antonio Roldan Betancourt Airport',\n",
       "  'Fukushima Airport',\n",
       "  'Walaha Airport',\n",
       "  'Watertown Regional Airport',\n",
       "  'Lajes Field',\n",
       "  'Barquisimeto International Airport',\n",
       "  'Miho Yonago Airport',\n",
       "  'Holy Cross Airport',\n",
       "  'Angoulême-Brie-Champniers Airport',\n",
       "  \"Dillon's Bay Airport\",\n",
       "  'Melangguane Airport',\n",
       "  'Mecheria Airport',\n",
       "  'City of Derry Airport',\n",
       "  'Vilhena Airport',\n",
       "  'Pampulha - Carlos Drummond de Andrade Airport',\n",
       "  'Visby Airport',\n",
       "  'Kandahar Airport',\n",
       "  'Bundaberg Airport',\n",
       "  'Havre City County Airport',\n",
       "  'Begishevo Airport',\n",
       "  'Goloson International Airport',\n",
       "  'Sayun International Airport',\n",
       "  'Capitan Oriel Lea Plaza Airport',\n",
       "  'Nosara Airport',\n",
       "  'St George Municipal Airport',\n",
       "  'Lakeba Island Airport',\n",
       "  'Kalskag Airport',\n",
       "  'St. Anthony Airport',\n",
       "  'Manchester Airport',\n",
       "  'Lafayette Regional Airport',\n",
       "  'St Augustin Airport',\n",
       "  'Batumi International Airport',\n",
       "  'Port Vila Bauerfield Airport',\n",
       "  'Ndola Airport',\n",
       "  'Hugo Cantergiani Regional Airport',\n",
       "  'Oranjemund Airport',\n",
       "  'Asahikawa Airport',\n",
       "  'Hat Yai International Airport',\n",
       "  'Ciudad del Carmen International Airport',\n",
       "  'Shennongjia Hongping Airport',\n",
       "  'Abbotsford Airport',\n",
       "  'Bert Mooney Airport',\n",
       "  'Mercedita Airport',\n",
       "  'Tokyo Haneda International Airport',\n",
       "  'Tekirdağ Çorlu Airport',\n",
       "  'Umeå Airport',\n",
       "  'Kivalina Airport',\n",
       "  'High Level Airport',\n",
       "  'Bathurst Airport',\n",
       "  'Meadows Field',\n",
       "  'Mo i Rana Airport, Røssvoll',\n",
       "  'Khrabrovo Airport',\n",
       "  'Tête-à-la-Baleine Airport',\n",
       "  'Solovki Airport',\n",
       "  'Fergana International Airport',\n",
       "  'Kufra Airport',\n",
       "  'Shanghai - Pudong International Airport',\n",
       "  'Mbeya Airport',\n",
       "  'Preguiça Airport',\n",
       "  'Dandong Airport',\n",
       "  'Rubem Berta Airport',\n",
       "  'Ithaca Tompkins Regional Airport',\n",
       "  'Southampton Airport',\n",
       "  'Roswell International Air Center Airport',\n",
       "  'Karlovy Vary International Airport',\n",
       "  'Annaba Airport',\n",
       "  'Trieste–Friuli Venezia Giulia Airport',\n",
       "  'Muhammad Salahuddin Airport',\n",
       "  'General Mariano Escobedo International Airport',\n",
       "  'Doha, Hamad International Airport',\n",
       "  'Nashville International Airport',\n",
       "  'Rigolet Airport',\n",
       "  'Simao Airport',\n",
       "  'Suavanao Airport',\n",
       "  'Grenoble Alpes-Isère Airport',\n",
       "  'Foshan Shadi Airport',\n",
       "  'Kumejima Airport',\n",
       "  'Sunyani Airport',\n",
       "  'Myeik Airport',\n",
       "  'Araracuara Airport',\n",
       "  'Uyuni Airport',\n",
       "  'Bario Airport',\n",
       "  'Lianyungang Airport',\n",
       "  'Islas Malvinas Airport',\n",
       "  'Fort Smith Regional Airport',\n",
       "  'Sept-Îles Airport',\n",
       "  'Livingstone Airport',\n",
       "  'Olgii Mongolei Airport',\n",
       "  'Ruby Airport',\n",
       "  'Thompson Airport',\n",
       "  'Ogden Hinckley Airport',\n",
       "  'Tambolaka Airport',\n",
       "  'Luang Phabang International Airport',\n",
       "  'Guararapes - Gilberto Freyre International Airport',\n",
       "  'Missoula International Airport',\n",
       "  'Kemerovo Airport',\n",
       "  'McGrath Airport',\n",
       "  'South Caicos Airport',\n",
       "  'Riverton Regional Airport',\n",
       "  'Charles M. Schulz Sonoma County Airport',\n",
       "  'Cerro Moreno Airport',\n",
       "  'Learmonth Airport',\n",
       "  'Altay Air Base',\n",
       "  'Heringsdorf Airport',\n",
       "  'Gabès Matmata International Airport',\n",
       "  'Takapoto Airport',\n",
       "  'Imperial County Airport',\n",
       "  'Quepos Managua Airport',\n",
       "  'Imam Khomeini International Airport',\n",
       "  'Bacolod-Silay City International Airport',\n",
       "  'Sultan Aji Muhamad Sulaiman Airport',\n",
       "  'Naypyidaw Airport',\n",
       "  'Mbandaka Airport',\n",
       "  'Reykjavik Airport',\n",
       "  'Westerland Sylt Airport',\n",
       "  'Pickle Lake Airport',\n",
       "  'Savoonga Airport',\n",
       "  'Venustiano Carranza International Airport',\n",
       "  'Richmond International Airport',\n",
       "  'Juan Mendoza Airport',\n",
       "  'Pisa International Airport',\n",
       "  'Polyarny Airport',\n",
       "  'Sri Guru Ram Dass Jee International Airport',\n",
       "  'K. D. Matanzima Airport',\n",
       "  'Julius Nyerere International Airport',\n",
       "  'Yacuiba Airport',\n",
       "  \"Perugia San Francesco d'Assisi – Umbria International Airport\",\n",
       "  'Bob Baker Memorial Airport',\n",
       "  'Asheville Regional Airport',\n",
       "  'Ciudad Obregón International Airport',\n",
       "  'Normanton Airport',\n",
       "  'Palmar Sur Airport',\n",
       "  'Dr. Babasaheb Ambedkar International Airport',\n",
       "  'Gamal Abdel Nasser Airport',\n",
       "  'Mocopulli Airport',\n",
       "  'Mundo Maya International Airport',\n",
       "  'Lonorore Airport',\n",
       "  'Tivat Airport',\n",
       "  'Shetland Islands, Fair Isle Airport',\n",
       "  'Östersund Airport',\n",
       "  'In Salah Airport',\n",
       "  'Yining Airport',\n",
       "  'Graz Airport',\n",
       "  'Narvik Framnes Airport',\n",
       "  'General Rodolfo Sánchez Taboada International Airport',\n",
       "  'Fort Simpson Airport',\n",
       "  'Shonai Airport',\n",
       "  'Faro Airport',\n",
       "  'Belgrade Nikola Tesla Airport',\n",
       "  'Gwadar International Airport',\n",
       "  'Jimma Airport',\n",
       "  'Ordu Giresun Airport',\n",
       "  'El Loa Airport',\n",
       "  'Zona da Mata Regional Airport',\n",
       "  'Buluh Tumbang (H A S Hanandjoeddin) Airport',\n",
       "  'Lamezia Terme Airport',\n",
       "  'Ulsan Airport',\n",
       "  'Diori Hamani International Airport',\n",
       "  'Tautii Magheraus Airport',\n",
       "  'Nejran Airport',\n",
       "  'Tuntutuliak Airport',\n",
       "  'Baker Lake Airport',\n",
       "  'Kangerlussuaq Airport',\n",
       "  'Tallinn Airport',\n",
       "  'Smithers Airport',\n",
       "  'Chokurdakh Airport',\n",
       "  'San Javier Airport',\n",
       "  'Cataratas Del Iguazú International Airport',\n",
       "  'Nanchong Airport',\n",
       "  'Ua Pou Airport',\n",
       "  'Velikiy Ustyug Airport',\n",
       "  'Palenque International Airport',\n",
       "  'Røst Airport',\n",
       "  'Bou Chekif Airport',\n",
       "  'Palma De Mallorca Airport',\n",
       "  'Vilankulo Airport',\n",
       "  \"Xi'an Xianyang International Airport\",\n",
       "  'Spriggs Payne Airport',\n",
       "  'Shaikh Zaid Airport',\n",
       "  'Ancona Falconara Airport',\n",
       "  'Barra Airport',\n",
       "  'Central Illinois Regional Airport at Bloomington-Normal',\n",
       "  'Decatur Airport',\n",
       "  'Circle City /New/ Airport',\n",
       "  'Chacalluta Airport',\n",
       "  'Bodø Airport',\n",
       "  'Nemiscau Airport',\n",
       "  'Arctic Village Airport',\n",
       "  'Chinchilla Airport',\n",
       "  'Skardu Airport',\n",
       "  'Luang Namtha Airport',\n",
       "  'Cleveland, Hopkins International Airport',\n",
       "  'Marseille Provence Airport',\n",
       "  \"Shenzhen Bao'an International Airport\",\n",
       "  'Kipnuk Airport',\n",
       "  'Dodge City Regional Airport',\n",
       "  'Bolshoye Savino Airport',\n",
       "  'Wilmington International Airport',\n",
       "  'Rick Husband Amarillo International Airport',\n",
       "  'Hanzhong Airport',\n",
       "  'Handan Airport',\n",
       "  'Sunan Shuofang International Airport',\n",
       "  'Madurai Airport',\n",
       "  'Cologne Bonn Airport',\n",
       "  'Lal Bahadur Shastri Airport',\n",
       "  'Vilhelmina Airport',\n",
       "  'Bamaga Injinoo Airport',\n",
       "  'Whale Cove Airport',\n",
       "  'Odessa International Airport',\n",
       "  'Amami Airport',\n",
       "  'Red Deer Regional Airport',\n",
       "  'Barcelona International Airport',\n",
       "  'Jinzhou Airport',\n",
       "  'Priština International Airport',\n",
       "  'Aden Adde International Airport',\n",
       "  'Pocatello Regional Airport',\n",
       "  'Hierro Airport',\n",
       "  'Chippewa County International Airport',\n",
       "  'Sadiq Abubakar III International Airport',\n",
       "  'Jolo Airport',\n",
       "  'John Murtha Johnstown Cambria County Airport',\n",
       "  'Takotna Airport',\n",
       "  'Rafael Hernandez Airport',\n",
       "  'Mexico City, Licenciado Benito Juarez International Airport',\n",
       "  'Birjand Airport',\n",
       "  'Yancheng Airport',\n",
       "  'Kasos Airport',\n",
       "  'Rabat-Salé Airport',\n",
       "  'Indianapolis International Airport',\n",
       "  'Johan Adolf Pengel International Airport',\n",
       "  'Hay River / Merlyn Carter Airport',\n",
       "  'Fort Frances Municipal Airport',\n",
       "  'Nanyang Airport',\n",
       "  'Biju Patnaik Airport',\n",
       "  'Linate Airport',\n",
       "  'Sao Paulo, Guarulhos - Governador Andras Franco Montoro International Airport',\n",
       "  'La Chinita International Airport',\n",
       "  \"N'Djamena International Airport\",\n",
       "  'Wenshan Puzhehei Airport',\n",
       "  'Pormpuraaw Airport',\n",
       "  'Karluk Airport',\n",
       "  'Xoxocotlán International Airport',\n",
       "  'Zhuhai Airport',\n",
       "  'Parkes Airport',\n",
       "  'Guangyuan Airport',\n",
       "  'Coffs Harbour Airport',\n",
       "  'Cibao International Airport',\n",
       "  \"Hassi R'Mel Airport\",\n",
       "  'San Francisco International Airport',\n",
       "  'Southwest Oregon Regional Airport',\n",
       "  'Tokyo Narita',\n",
       "  'Santander Airport',\n",
       "  'Dibrugarh Airport',\n",
       "  'Fort Albany Airport',\n",
       "  'Aarhus Airport',\n",
       "  'Pierre Regional Airport',\n",
       "  'Winton Airport',\n",
       "  'Joplin Regional Airport',\n",
       "  'Brussels Airport',\n",
       "  'Narrandera Airport',\n",
       "  'Ørsta-Volda Airport, Hovden',\n",
       "  'Vagar Airport',\n",
       "  'Qaarsut Airport',\n",
       "  'Antonio B. Won Pat International Airport',\n",
       "  'Las Termas Airport',\n",
       "  'Palonegro Airport',\n",
       "  'Agra Airport',\n",
       "  'Hana Airport',\n",
       "  'Anglesey Airport',\n",
       "  'Hao Airport',\n",
       "  'Brest Bretagne Airport',\n",
       "  'Mopah Airport',\n",
       "  'La Pedrera Airport',\n",
       "  'Platinum Airport',\n",
       "  'Xinyuan Nalati Airport',\n",
       "  'Halmstad Airport',\n",
       "  'Heydar Aliyev International Airport',\n",
       "  'Tucson International Airport',\n",
       "  'Khasab Air Base',\n",
       "  'Naples Municipal Airport',\n",
       "  'Enrique Olaya Herrera Airport',\n",
       "  'Oakland',\n",
       "  'Ixtapa Zihuatanejo International Airport',\n",
       "  \"Yan'an Airport\",\n",
       "  'JAGS McCartney International Airport',\n",
       "  'Astrakhan Airport',\n",
       "  'Atmautluak Airport',\n",
       "  'Griffith Airport',\n",
       "  'Hector International Airport',\n",
       "  'Mc Cook Ben Nelson Regional Airport',\n",
       "  'Tununak Airport',\n",
       "  'Rodez-Marcillac Airport',\n",
       "  'Governador Valadares Airport',\n",
       "  'Baoshan Yunduan Airport',\n",
       "  'Tunis Carthage International Airport',\n",
       "  'Tanjung Manis Airport',\n",
       "  'Zaisan (Zaysan) Airport',\n",
       "  'Muan International Airport',\n",
       "  'Coen Airport',\n",
       "  'Kaunas International Airport',\n",
       "  'Iwakuni Marine Corps Air Station',\n",
       "  'Santorini Airport',\n",
       "  'Girona Airport',\n",
       "  \"Val-d'Or Airport\",\n",
       "  'Wapenamanda Airport',\n",
       "  'Vardø Airport, Svartnes',\n",
       "  'Tefé Airport',\n",
       "  'Waterloo Airport',\n",
       "  'Albany International Airport',\n",
       "  'Waterford Airport',\n",
       "  'Niigata Airport',\n",
       "  'Santos Dumont Airport',\n",
       "  'Qinhuangdao Beidaihe Airport',\n",
       "  'La Chorrera Airport',\n",
       "  'Montgomery Regional (Dannelly Field) Airport',\n",
       "  'Lichinga Airport',\n",
       "  'Joslin Field Magic Valley Regional Airport',\n",
       "  'Şanlıurfa GAP Airport',\n",
       "  'Syktyvkar Airport',\n",
       "  'Charleston Air Force Base-International Airport',\n",
       "  'Plovdiv International Airport',\n",
       "  'Socotra International Airport',\n",
       "  'Memmingen Allgau Airport',\n",
       "  'Christmas Island Airport',\n",
       "  'Malmö Sturup Airport',\n",
       "  'Trang Airport',\n",
       "  'Napakiak Airport',\n",
       "  'Arar Domestic Airport',\n",
       "  'Elmira Corning Regional Airport',\n",
       "  'Thandwe Airport',\n",
       "  'Krasnodar International Airport',\n",
       "  ...]}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().group().by(T.label).by('desc').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Runways grouped by code__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'GSE': [2], 'VRN': [1], 'KKE': [4], 'GGG': [2], 'PIX': [1]}"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').limit(5).group().by('code').by('runways').next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
