{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3. Group\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import T\n",
    "from loader import __"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Get types of vertices__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'continent': 7, 'country': 237, 'version': 1, 'airport': 3374}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().groupCount().by(T.label).next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Equivalent to"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().label().groupCount().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Also equivalent to"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "x3 = g.V().group().by(T.label).by(__.count()).next()\n",
    "assert x2 == x3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Count of airports by country__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'PR': 6,\n",
       " 'PT': 14,\n",
       " 'PW': 1,\n",
       " 'PY': 2,\n",
       " 'QA': 1,\n",
       " 'AE': 10,\n",
       " 'AF': 4,\n",
       " 'AG': 1,\n",
       " 'AI': 1,\n",
       " 'AL': 1,\n",
       " 'AM': 2,\n",
       " 'AO': 14,\n",
       " 'AR': 36,\n",
       " 'AS': 1,\n",
       " 'AT': 6,\n",
       " 'RE': 2,\n",
       " 'AU': 124,\n",
       " 'AW': 1,\n",
       " 'AZ': 5,\n",
       " 'RO': 14,\n",
       " 'BA': 4,\n",
       " 'BB': 1,\n",
       " 'RS': 2,\n",
       " 'BD': 7,\n",
       " 'RU': 120,\n",
       " 'BE': 5,\n",
       " 'BF': 2,\n",
       " 'BG': 4,\n",
       " 'RW': 2,\n",
       " 'BH': 1,\n",
       " 'BI': 1,\n",
       " 'BJ': 1,\n",
       " 'BL': 1,\n",
       " 'BM': 1,\n",
       " 'BN': 1,\n",
       " 'BO': 15,\n",
       " 'SA': 26,\n",
       " 'SB': 17,\n",
       " 'BQ': 3,\n",
       " 'BR': 115,\n",
       " 'SC': 2,\n",
       " 'SD': 5,\n",
       " 'BS': 18,\n",
       " 'SE': 39,\n",
       " 'BT': 1,\n",
       " 'SG': 1,\n",
       " 'BW': 4,\n",
       " 'SH': 2,\n",
       " 'SI': 1,\n",
       " 'BY': 2,\n",
       " 'BZ': 13,\n",
       " 'SK': 2,\n",
       " 'SL': 1,\n",
       " 'SN': 3,\n",
       " 'SO': 5,\n",
       " 'CA': 203,\n",
       " 'SR': 1,\n",
       " 'CC': 1,\n",
       " 'SS': 1,\n",
       " 'CD': 11,\n",
       " 'ST': 1,\n",
       " 'CF': 1,\n",
       " 'SV': 1,\n",
       " 'CG': 3,\n",
       " 'CH': 5,\n",
       " 'SX': 1,\n",
       " 'SY': 2,\n",
       " 'CI': 1,\n",
       " 'SZ': 1,\n",
       " 'CK': 6,\n",
       " 'CL': 17,\n",
       " 'CM': 5,\n",
       " 'CN': 209,\n",
       " 'CO': 50,\n",
       " 'TC': 4,\n",
       " 'CR': 13,\n",
       " 'TD': 1,\n",
       " 'CU': 12,\n",
       " 'CV': 7,\n",
       " 'TG': 1,\n",
       " 'TH': 32,\n",
       " 'CW': 1,\n",
       " 'CX': 1,\n",
       " 'TJ': 4,\n",
       " 'CY': 3,\n",
       " 'CZ': 5,\n",
       " 'TL': 1,\n",
       " 'TM': 1,\n",
       " 'TN': 8,\n",
       " 'TO': 1,\n",
       " 'TR': 48,\n",
       " 'TT': 2,\n",
       " 'DE': 33,\n",
       " 'TV': 1,\n",
       " 'TW': 9,\n",
       " 'TZ': 8,\n",
       " 'DJ': 1,\n",
       " 'DK': 8,\n",
       " 'DM': 1,\n",
       " 'DO': 7,\n",
       " 'UA': 15,\n",
       " 'UG': 4,\n",
       " 'UK': 58,\n",
       " 'DZ': 29,\n",
       " 'US': 579,\n",
       " 'EC': 15,\n",
       " 'EE': 3,\n",
       " 'EG': 10,\n",
       " 'EH': 2,\n",
       " 'UY': 2,\n",
       " 'UZ': 11,\n",
       " 'VC': 1,\n",
       " 'ER': 1,\n",
       " 'ES': 42,\n",
       " 'ET': 14,\n",
       " 'VE': 24,\n",
       " 'VG': 2,\n",
       " 'VI': 2,\n",
       " 'VN': 21,\n",
       " 'VU': 26,\n",
       " 'FI': 20,\n",
       " 'FJ': 10,\n",
       " 'FK': 2,\n",
       " 'FM': 4,\n",
       " 'FO': 1,\n",
       " 'FR': 58,\n",
       " 'WF': 2,\n",
       " 'GA': 2,\n",
       " 'WS': 1,\n",
       " 'GD': 1,\n",
       " 'GE': 3,\n",
       " 'GF': 1,\n",
       " 'GG': 2,\n",
       " 'GH': 5,\n",
       " 'GI': 1,\n",
       " 'GL': 14,\n",
       " 'GM': 1,\n",
       " 'GN': 1,\n",
       " 'GP': 1,\n",
       " 'GQ': 2,\n",
       " 'GR': 39,\n",
       " 'GT': 2,\n",
       " 'GU': 1,\n",
       " 'GW': 1,\n",
       " 'GY': 2,\n",
       " 'HK': 1,\n",
       " 'HN': 6,\n",
       " 'HR': 8,\n",
       " 'YE': 9,\n",
       " 'HT': 2,\n",
       " 'HU': 2,\n",
       " 'ID': 67,\n",
       " 'YT': 1,\n",
       " 'IE': 7,\n",
       " 'IL': 5,\n",
       " 'IM': 1,\n",
       " 'IN': 73,\n",
       " 'ZA': 20,\n",
       " 'IQ': 6,\n",
       " 'IR': 44,\n",
       " 'IS': 5,\n",
       " 'IT': 36,\n",
       " 'ZM': 8,\n",
       " 'JE': 1,\n",
       " 'ZW': 3,\n",
       " 'JM': 2,\n",
       " 'JO': 2,\n",
       " 'JP': 63,\n",
       " 'KE': 14,\n",
       " 'KG': 2,\n",
       " 'KH': 3,\n",
       " 'KI': 2,\n",
       " 'KM': 1,\n",
       " 'KN': 2,\n",
       " 'KP': 1,\n",
       " 'KR': 15,\n",
       " 'KS': 1,\n",
       " 'KW': 1,\n",
       " 'KY': 3,\n",
       " 'KZ': 20,\n",
       " 'LA': 8,\n",
       " 'LB': 1,\n",
       " 'LC': 2,\n",
       " 'LK': 6,\n",
       " 'LR': 2,\n",
       " 'LS': 1,\n",
       " 'LT': 3,\n",
       " 'LU': 1,\n",
       " 'LV': 1,\n",
       " 'LY': 10,\n",
       " 'MA': 14,\n",
       " 'MD': 1,\n",
       " 'ME': 2,\n",
       " 'MF': 1,\n",
       " 'MG': 13,\n",
       " 'MH': 2,\n",
       " 'MK': 1,\n",
       " 'ML': 1,\n",
       " 'MM': 14,\n",
       " 'MN': 10,\n",
       " 'MO': 1,\n",
       " 'MP': 2,\n",
       " 'MQ': 1,\n",
       " 'MR': 3,\n",
       " 'MS': 1,\n",
       " 'MT': 1,\n",
       " 'MU': 2,\n",
       " 'MV': 8,\n",
       " 'MW': 2,\n",
       " 'MX': 59,\n",
       " 'MY': 34,\n",
       " 'MZ': 10,\n",
       " 'NA': 4,\n",
       " 'NC': 1,\n",
       " 'NE': 1,\n",
       " 'NF': 1,\n",
       " 'NG': 18,\n",
       " 'NI': 1,\n",
       " 'NL': 5,\n",
       " 'NO': 49,\n",
       " 'NP': 10,\n",
       " 'NR': 1,\n",
       " 'NZ': 25,\n",
       " 'OM': 4,\n",
       " 'PA': 5,\n",
       " 'PE': 20,\n",
       " 'PF': 30,\n",
       " 'PG': 26,\n",
       " 'PH': 38,\n",
       " 'PK': 21,\n",
       " 'PL': 13,\n",
       " 'PM': 1}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').groupCount().by('country').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In select countries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'FR': 58, 'GR': 39, 'BE': 5}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').groupCount().by('country').select('FR','GR','BE').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Count of outgoing vertices for each continent code__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'EU': 583, 'AS': 932, 'NA': 978, 'OC': 284, 'AF': 294, 'AN': 0, 'SA': 303}"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('continent').group().by('code').by(__.out().count()).next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Group all descriptions by their label__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'continent': ['North America',\n",
       "  'South America',\n",
       "  'Africa',\n",
       "  'Europe',\n",
       "  'Asia',\n",
       "  'Oceania',\n",
       "  'Antarctica'],\n",
       " 'country': ['Peru',\n",
       "  'Saint Kitts and Nevis',\n",
       "  'Turkmenistan',\n",
       "  'Tajikistan',\n",
       "  'Pitcairn',\n",
       "  'Greece',\n",
       "  'Spain',\n",
       "  'Afghanistan',\n",
       "  'Mauritius',\n",
       "  'Sint Martin',\n",
       "  'New Caledonia',\n",
       "  'Dominican Republic',\n",
       "  'Monaco',\n",
       "  'Ireland',\n",
       "  'Liberia',\n",
       "  'Comoros',\n",
       "  \"Côte d'Ivoire\",\n",
       "  'Saint Helena',\n",
       "  'Libya',\n",
       "  'Philippines',\n",
       "  'Russian Federation',\n",
       "  'Uruguay',\n",
       "  'Sudan',\n",
       "  'Uzbekistan',\n",
       "  'Saint-Barthelemy',\n",
       "  'Christmas Island',\n",
       "  'Ghana',\n",
       "  'Kosovo',\n",
       "  'South Africa',\n",
       "  'Saudi Arabia',\n",
       "  'Fiji',\n",
       "  'Croatia',\n",
       "  'Iceland',\n",
       "  'Kuwait',\n",
       "  'Indonesia',\n",
       "  'Bahrain',\n",
       "  'Macau',\n",
       "  'Tunisia',\n",
       "  'Tonga',\n",
       "  'Yemen',\n",
       "  'Nigeria',\n",
       "  'Tuvalu',\n",
       "  'Central African Republic',\n",
       "  'Benin',\n",
       "  'United States',\n",
       "  'Virgin Islands (US)',\n",
       "  'Mongolia',\n",
       "  'Moldova',\n",
       "  'Trinidad and Tobago',\n",
       "  'Iraq',\n",
       "  'Qatar',\n",
       "  'Gabon',\n",
       "  'Nepal',\n",
       "  'Puerto Rico',\n",
       "  'Reunion',\n",
       "  'Algeria',\n",
       "  'Namibia',\n",
       "  'Guyana',\n",
       "  'Lebanon',\n",
       "  'Isle of Man',\n",
       "  'Cocos (Keeling) Islands',\n",
       "  'Austria',\n",
       "  'San Marino',\n",
       "  'Papua New Guinea',\n",
       "  'Marshall Islands',\n",
       "  'Germany',\n",
       "  'Portugal',\n",
       "  'Vanuatu',\n",
       "  'Bosnia and Herzegovina',\n",
       "  \"Democratic People's Republic of Korea\",\n",
       "  'Mexico',\n",
       "  'Suriname',\n",
       "  'Madagascar',\n",
       "  'Luxembourg',\n",
       "  'Zimbabwe',\n",
       "  'Swaziland',\n",
       "  'Lesotho',\n",
       "  'Equatorial Guinea',\n",
       "  'Denmark',\n",
       "  'Democratic Republic of the Congo',\n",
       "  'Senegal',\n",
       "  'Aruba',\n",
       "  'Taiwan',\n",
       "  'Colombia',\n",
       "  'Lithuania',\n",
       "  'Falkland Islands',\n",
       "  'Federated States of Micronesia',\n",
       "  'Barbados',\n",
       "  'Serbia',\n",
       "  'Chad',\n",
       "  'Norfolk Island',\n",
       "  'Guatemala',\n",
       "  'Anguilla',\n",
       "  'Malta',\n",
       "  'American Samoa',\n",
       "  'Italy',\n",
       "  'Liechtenstein',\n",
       "  'Singapore',\n",
       "  'Congo',\n",
       "  'Northern Mariana Islands',\n",
       "  'Eritrea',\n",
       "  'Macedonia',\n",
       "  'Cameroon',\n",
       "  'France',\n",
       "  'Guinea',\n",
       "  'Honduras',\n",
       "  'Cabo Verde',\n",
       "  'Costa Rica',\n",
       "  'Montenegro',\n",
       "  'Samoa',\n",
       "  'Botswana',\n",
       "  'Andorra',\n",
       "  'Somalia',\n",
       "  'Syrian Arab Republic',\n",
       "  'Viet Nam',\n",
       "  'Mayotte',\n",
       "  'Togo',\n",
       "  'Thailand',\n",
       "  'Azerbajan',\n",
       "  'Maldives',\n",
       "  'Angola',\n",
       "  'Czech Republic',\n",
       "  'Guinea-Bissau',\n",
       "  'Egypt',\n",
       "  'Malawi',\n",
       "  'Lao PDR',\n",
       "  'Cyprus',\n",
       "  'Morocco',\n",
       "  'Chile',\n",
       "  'Estonia',\n",
       "  'Ukraine',\n",
       "  'Bonaire - Sint Eustatius and Saba',\n",
       "  'Kiribati',\n",
       "  'Dominica',\n",
       "  'Switzerland',\n",
       "  'Martinique',\n",
       "  'Jersey',\n",
       "  'Sierra Leone',\n",
       "  'Saint-Martin (France)',\n",
       "  'Panama',\n",
       "  'Nicaragua',\n",
       "  'Australia',\n",
       "  'Hong Kong',\n",
       "  'Sao Tome and Principe',\n",
       "  'Montserrat',\n",
       "  'French Polynesia',\n",
       "  'Kenya',\n",
       "  'Armenia',\n",
       "  'Guernsey',\n",
       "  'Timor-Leste',\n",
       "  'Belarus',\n",
       "  'Curacao',\n",
       "  'Gambia',\n",
       "  'Norway',\n",
       "  'Nauru',\n",
       "  'Guadeloupe',\n",
       "  'Cook Islands',\n",
       "  'Mozambique',\n",
       "  'Niger',\n",
       "  'Kyrgyzstan',\n",
       "  'Saint Pierre and Miquelon',\n",
       "  'Cambodia',\n",
       "  'Sri Lanka',\n",
       "  'Latvia',\n",
       "  'Canada',\n",
       "  'Israel',\n",
       "  'Brunei',\n",
       "  'Bhutan',\n",
       "  'Slovakia',\n",
       "  'Mali',\n",
       "  'Greenland',\n",
       "  'Albania',\n",
       "  'Pakistan',\n",
       "  'Belize',\n",
       "  'Solomon Islands',\n",
       "  'Bangladesh',\n",
       "  'Brazil',\n",
       "  'Ecuador',\n",
       "  'Gibraltar',\n",
       "  'British Virgin Islands',\n",
       "  'Kazakhstan',\n",
       "  'Hungary',\n",
       "  'Jamaica',\n",
       "  'Japan',\n",
       "  'Republic of Korea',\n",
       "  'Malaysia',\n",
       "  'Zambia',\n",
       "  'Western Sahara',\n",
       "  'Saint Lucia',\n",
       "  'Cayman Islands',\n",
       "  'Tanzania',\n",
       "  'Antigua and Barbuda',\n",
       "  'Bulgaria',\n",
       "  'Palau',\n",
       "  'New Zealand',\n",
       "  'Saint Vincent and Grenadines',\n",
       "  'Finland',\n",
       "  'Bolivia',\n",
       "  'Sweden',\n",
       "  'Argentina',\n",
       "  'French Guiana',\n",
       "  'Poland',\n",
       "  'Netherlands',\n",
       "  'Wallis and Futuna Islands',\n",
       "  'Myanmar',\n",
       "  'Mauritania',\n",
       "  'Venezuela',\n",
       "  'Turkey',\n",
       "  'Georgia',\n",
       "  'Bermuda',\n",
       "  'Paraguay',\n",
       "  'Ethiopia',\n",
       "  'Burkina Faso',\n",
       "  'China',\n",
       "  'El Salvador',\n",
       "  'Cuba',\n",
       "  'Jordan',\n",
       "  'Rwanda',\n",
       "  'Seychelles',\n",
       "  'Iran',\n",
       "  'Burundi',\n",
       "  'Oman',\n",
       "  'Bahamas',\n",
       "  'Guam',\n",
       "  'United Arab Emirates',\n",
       "  'Haiti',\n",
       "  'South Sudan',\n",
       "  'Turks and Caicos Islands',\n",
       "  'Grenada',\n",
       "  'Faroe Islands',\n",
       "  'Slovenia',\n",
       "  'Belgium',\n",
       "  'Djibouti',\n",
       "  'India',\n",
       "  'Uganda',\n",
       "  'United Kingdom',\n",
       "  'Romania'],\n",
       " 'version': ['Version: 0.77 Generated: 2017-10-06 16:24:40 UTC\\nGraph created by Kelvin R. Lawrence\\nPlease let me know of any errors you find in the graph.'],\n",
       " 'airport': ['Tallahassee Regional Airport',\n",
       "  'Sibiu International Airport',\n",
       "  'Wilwal International Airport',\n",
       "  'Port Sudan New International Airport',\n",
       "  'Juan Mendoza Airport',\n",
       "  'Kyzyl Airport',\n",
       "  'Mazar I Sharif Airport',\n",
       "  'Rimatara Airport',\n",
       "  'Chingozi Airport',\n",
       "  'Mirny Airport',\n",
       "  'Plettenberg Bay Airport',\n",
       "  'Catarman National Airport',\n",
       "  'Kangding Airport',\n",
       "  'Simao Airport',\n",
       "  'Kamishly Airport',\n",
       "  'Mocopulli Airport',\n",
       "  'Nassau, Lynden Pindling International Airport',\n",
       "  'Graz Airport',\n",
       "  'Cranbrook Airport',\n",
       "  'Santo Pekoa International Airport',\n",
       "  'Branson Airport',\n",
       "  'Ciampino–G. B. Pastine International Airport',\n",
       "  'Fort Smith Regional Airport',\n",
       "  'Sarasota Bradenton International Airport',\n",
       "  'Jumandy Airport',\n",
       "  'Chadron Municipal Airport',\n",
       "  'Marau Airport',\n",
       "  'Plattsburgh International Airport',\n",
       "  'Invercargill Airport',\n",
       "  'Timaru Airport',\n",
       "  'Lagos,Murtala Muhammed International Airport',\n",
       "  'Aurukun Airport',\n",
       "  'Araçatuba Airport',\n",
       "  'Kuqa Airport',\n",
       "  'Hosea Kutako International Airport',\n",
       "  'Birmingham-Shuttlesworth International Airport',\n",
       "  'El Eden Airport',\n",
       "  'Grande Prairie Airport',\n",
       "  'Vanua Balavu Airport',\n",
       "  'Dallas Love Field',\n",
       "  'Bodø Airport',\n",
       "  'Kangra Airport',\n",
       "  'Baoshan Yunduan Airport',\n",
       "  'Porto Santo Airport',\n",
       "  'Ljubljana Jože Pučnik Airport',\n",
       "  'La Florida Airport',\n",
       "  'Hawarden Airport',\n",
       "  'Tarbes-Lourdes-Pyrénées Airport',\n",
       "  'Mayor General FAP Armando Revoredo Iglesias Airport',\n",
       "  'Brisbane International Airport',\n",
       "  'Priština International Airport',\n",
       "  'Janakpur Airport',\n",
       "  'Handan Airport',\n",
       "  'Capitan FAP Pedro Canga Rodriguez Airport',\n",
       "  'Gambell Airport',\n",
       "  'Dole-Tavaux Airport',\n",
       "  'Watertown Regional Airport',\n",
       "  'Baker Lake Airport',\n",
       "  'Menongue Airport',\n",
       "  'St Gallen Altenrhein Airport',\n",
       "  'Syktyvkar Airport',\n",
       "  'Entebbe International Airport',\n",
       "  'Bilbao Airport',\n",
       "  'Taganrog Yuzhny Airport',\n",
       "  'Portland International Airport',\n",
       "  'Quaqtaq Airport',\n",
       "  'Beira Airport',\n",
       "  'Dushanbe Airport',\n",
       "  'Durban, King Shaka International Airport',\n",
       "  'Wemindji Airport',\n",
       "  'Pointe Noire Airport',\n",
       "  'Hodeidah International Airport',\n",
       "  'Turukhansk Airport',\n",
       "  'Cadjehoun Airport',\n",
       "  'Agatti Airport',\n",
       "  'General Leobardo C. Ruiz International Airport',\n",
       "  'Sultan Aji Muhamad Sulaiman Airport',\n",
       "  'Atmautluak Airport',\n",
       "  'Francisco Bangoy International Airport',\n",
       "  'City of Derry Airport',\n",
       "  'Moscow, Sheremetyevo International Airport',\n",
       "  'Rock Springs Sweetwater County Airport',\n",
       "  'Aarhus Airport',\n",
       "  'Edward G. Pitka Sr Airport',\n",
       "  'Thangool Airport',\n",
       "  'Stephenville Airport',\n",
       "  'La Laguna Airport',\n",
       "  'San Luis Airport',\n",
       "  'Yingkou Lanqi Airport',\n",
       "  'Kabul International Airport',\n",
       "  'Missoula International Airport',\n",
       "  'Iwami Airport',\n",
       "  \"Hassi R'Mel Airport\",\n",
       "  'Peshawar International Airport',\n",
       "  'Fort Chipewyan Airport',\n",
       "  'Cloncurry Airport',\n",
       "  'High Level Airport',\n",
       "  'Pittsburgh International Airport',\n",
       "  'Tongliao Airport',\n",
       "  'Grenoble Alpes-Isère Airport',\n",
       "  'Gaziantep International Airport',\n",
       "  'Foula Airport',\n",
       "  'Alakanuk Airport',\n",
       "  'Manila, Ninoy Aquino International Airport',\n",
       "  'Lauro Carneiro de Loyola Airport',\n",
       "  'Kruunupyy Airport',\n",
       "  'Adirondack Regional Airport',\n",
       "  'Lar Airport',\n",
       "  'Sønderborg Airport',\n",
       "  'Campbeltown Airport',\n",
       "  'Ixtapa Zihuatanejo International Airport',\n",
       "  'San Tome Airport',\n",
       "  'Osaka International Airport',\n",
       "  'Guyuan Liupanshan Airport',\n",
       "  'La Tontouta International Airport',\n",
       "  'Taiping Airport',\n",
       "  'Wapenamanda Airport',\n",
       "  'Tokyo Haneda International Airport',\n",
       "  'Charlo Airport',\n",
       "  'Baltimore/Washington International Airport',\n",
       "  'Jonesboro Municipal Airport',\n",
       "  'Central Airport',\n",
       "  'Caucaya Airport',\n",
       "  'Tampa Padang Airport',\n",
       "  'Akanu Ibiam International Airport',\n",
       "  'Dryden Regional Airport',\n",
       "  'Angoulême-Brie-Champniers Airport',\n",
       "  'San Pedro Airport',\n",
       "  'Kuai, Lihue Airport',\n",
       "  'Kharkiv International Airport',\n",
       "  'Montréal / Saint-Hubert Airport',\n",
       "  'Tsushima Airport',\n",
       "  'Heihe Airport',\n",
       "  'Kudat Airport',\n",
       "  'Gerrard Smith International Airport',\n",
       "  'Split Airport',\n",
       "  'General Mitchell International Airport',\n",
       "  'Marce, Angers - Loire Airport',\n",
       "  'Lugano Airport',\n",
       "  'Capitan V A Almonacid Airport',\n",
       "  'Kasigluk Airport',\n",
       "  \"Arthur's Town Airport\",\n",
       "  'Jinggangshan Airport',\n",
       "  'Tatalina LRRS Airport',\n",
       "  'Angads Airport',\n",
       "  'Andahuaylas Airport',\n",
       "  'Dane County Regional Truax Field',\n",
       "  'Haikou Meilan International Airport',\n",
       "  'Santa Cruz/Graciosa Bay/Luova Airport',\n",
       "  'Luzhou Airport',\n",
       "  'Tuzla International Airport',\n",
       "  'Aba Tenna Dejazmach Yilma International Airport',\n",
       "  'Marsa Alam International Airport',\n",
       "  'Nepalgunj Airport',\n",
       "  'Wadi al-Dawasir Airport',\n",
       "  'Pierrefonds Airport',\n",
       "  'Växjö Kronoberg Airport',\n",
       "  'Marechal Cunha Machado International Airport',\n",
       "  'Ulukhaktok Holman Airport',\n",
       "  'Enrique Malek International Airport',\n",
       "  'Svolvær Helle Airport',\n",
       "  'Shageluk Airport',\n",
       "  'Port Elizabeth Airport',\n",
       "  'Harare International Airport',\n",
       "  'Kangirsuk Airport',\n",
       "  'Hiroshima Airport',\n",
       "  'Shonai Airport',\n",
       "  'Bacău Airport',\n",
       "  'Naga Airport',\n",
       "  'Leros Airport',\n",
       "  'Jeju International Airport',\n",
       "  'Sibu Airport',\n",
       "  'Kuala Lumpur International Airport',\n",
       "  'Touat Cheikh Sidi Mohamed Belkebir Airport',\n",
       "  'Gustavo Vargas Airport',\n",
       "  'Garoua International Airport',\n",
       "  'Hopedale Airport',\n",
       "  'Pohnpei International Airport',\n",
       "  'Joslin Field Magic Valley Regional Airport',\n",
       "  'Erenhot Saiwusu International Airport',\n",
       "  'Rochester International Airport',\n",
       "  'Ramenskoye Airport',\n",
       "  'Orange County/Santa Ana, John Wayne',\n",
       "  'Marshall Islands International Airport',\n",
       "  'Mangaia Island Airport',\n",
       "  'Ulan-Ude Airport (Mukhino)',\n",
       "  'Majeed Bin Abdulaziz Airport',\n",
       "  'Easterwood Field',\n",
       "  'Limnos Airport',\n",
       "  'Salluit Airport',\n",
       "  'Shaktoolik Airport',\n",
       "  'Wenshan Puzhehei Airport',\n",
       "  'Albury Airport',\n",
       "  'Providenciales Airport',\n",
       "  'Kristiansand Airport',\n",
       "  'Bridgetown, Sir Grantley Adams International Airport',\n",
       "  'Szczecin-Goleniów Solidarność Airport',\n",
       "  'Falcone–Borsellino Airport',\n",
       "  'Fujairah International Airport',\n",
       "  'Sanming Shaxian Airport',\n",
       "  'Futuna Airport',\n",
       "  'Deputado Luiz Eduardo Magalhães International Airport',\n",
       "  'Piedras Negras International Airport',\n",
       "  'Mulu Airport',\n",
       "  'Manistee Co Blacker Airport',\n",
       "  'Tartu Airport',\n",
       "  'Kenora Airport',\n",
       "  'Koggala Airport',\n",
       "  'Ndjili International Airport',\n",
       "  'Mtwara Airport',\n",
       "  'Hakkari Selahaddin Eyyubi Airport',\n",
       "  'Zamboanga International Airport',\n",
       "  'Port of Spain, Piarco International Airport',\n",
       "  'Shanghai Hongqiao International Airport',\n",
       "  'Longyan Guanzhishan Airport',\n",
       "  'Mingyueshan Airport',\n",
       "  'Lae Nadzab Airport',\n",
       "  'Diego Aracena Airport',\n",
       "  'Hartsfield - Jackson Atlanta International Airport',\n",
       "  'Basrah International Airport',\n",
       "  \"St Mary's Airport\",\n",
       "  'Linate Airport',\n",
       "  'Liuting Airport',\n",
       "  'Kerry Airport',\n",
       "  'Chinggis Khaan International Airport',\n",
       "  'Abha Regional Airport',\n",
       "  'Tegucigalpa, Toncontin International Airport',\n",
       "  'Quimper-Cornouaille Airport',\n",
       "  'East Texas Regional Airport',\n",
       "  'Bismarck Municipal Airport',\n",
       "  'Sultan Mahmud Badaruddin Ii Airport',\n",
       "  'Ain Arnat Airport',\n",
       "  'Kirkwall Airport',\n",
       "  'Dodge City Regional Airport',\n",
       "  'Governador Valadares Airport',\n",
       "  'Fort Nelson Airport',\n",
       "  'Brigadier Mayor D Cesar Raul Ojeda Airport',\n",
       "  'Norilsk-Alykel Airport',\n",
       "  'Kulusuk Airport',\n",
       "  'Golden Triangle Regional Airport',\n",
       "  'Pitt Greenville Airport',\n",
       "  'Mota Lava Airport',\n",
       "  'Kadhdhoo Airport',\n",
       "  'Narrabri Airport',\n",
       "  'Kilimanjaro International Airport',\n",
       "  'Alta Floresta Airport',\n",
       "  'Thessaloniki Macedonia International Airport',\n",
       "  'General Rivadeneira Airport',\n",
       "  'Bahawalpur Airport',\n",
       "  'Mianyang Airport',\n",
       "  'V.C. Bird International Airport',\n",
       "  'Palm Springs International Airport',\n",
       "  'Kuujjuaq Airport',\n",
       "  'London Luton Airport',\n",
       "  'Sendai Airport',\n",
       "  'Helsinki Ventaa',\n",
       "  'Ciudad Obregón International Airport',\n",
       "  'Senador Petrônio Portela Airport',\n",
       "  'Yenbo - Prince Abdul Mohsin Bin Airport',\n",
       "  'Skiathos Island National Airport',\n",
       "  'Imphal Airport',\n",
       "  'Nueva Loja Airport',\n",
       "  'Beirut Rafic Hariri International Airport',\n",
       "  'Capitán de Av. Emilio Beltrán Airport',\n",
       "  'Can Tho International Airport',\n",
       "  'Nouadhibou International Airport',\n",
       "  'Putao Airport',\n",
       "  'Jinnah International Airport',\n",
       "  'University Park Airport',\n",
       "  'Faro Airport',\n",
       "  'Christmas Island Airport',\n",
       "  'Araxos Airport',\n",
       "  'Deering Airport',\n",
       "  'Ishigaki Airport',\n",
       "  'Mountain Village Airport',\n",
       "  'Ta’if Regional Airport',\n",
       "  'Mosul International Airport',\n",
       "  'Point Salines International Airport',\n",
       "  'Los Angeles International Airport',\n",
       "  'Healy River Airport',\n",
       "  'Hoonah Airport',\n",
       "  'Regional de Maringá - Sílvio Nane Junior Airport',\n",
       "  'Ganzhou Airport',\n",
       "  'Jiuhuashan Airport',\n",
       "  'Roberts International Airport',\n",
       "  'Massena International Richards Field',\n",
       "  'Jesus Teran International Airport',\n",
       "  'Leeds Bradford Airport',\n",
       "  'Sunshine Coast Airport',\n",
       "  'Sunyani Airport',\n",
       "  'Buka Airport',\n",
       "  'Raleigh-Durham',\n",
       "  'Kaukura Airport',\n",
       "  'Western Neb. Rgnl/William B. Heilig Airport',\n",
       "  'Ontario International Airport',\n",
       "  'Yasouj Airport',\n",
       "  \"Land's End Airport\",\n",
       "  'Ramsar Airport',\n",
       "  'Kota Kinabalu International Airport',\n",
       "  'Almirante Padilla Airport',\n",
       "  'Pohang Airport',\n",
       "  'Presidente Peron Airport',\n",
       "  'Bert Mooney Airport',\n",
       "  'Dong Hoi Airport',\n",
       "  'Yaoqiang Airport',\n",
       "  'Semera Airport',\n",
       "  'Velikiy Ustyug Airport',\n",
       "  'Sulaymaniyah International Airport',\n",
       "  'Quepos Managua Airport',\n",
       "  'Brainerd Lakes Regional Airport',\n",
       "  'Xilinhot Airport',\n",
       "  'Key Field',\n",
       "  'Al Massira Airport',\n",
       "  'Ronneby Airport',\n",
       "  'Wellington International Airport',\n",
       "  'Narrandera Airport',\n",
       "  'In Salah Airport',\n",
       "  'Cauayan Airport',\n",
       "  'Selawik Airport',\n",
       "  'Fort St John Airport',\n",
       "  'Cascavel Airport',\n",
       "  'Tiree Airport',\n",
       "  'Richards Bay Airport',\n",
       "  'Cacoal Airport',\n",
       "  'El Alto International Airport',\n",
       "  'Sultan Azlan Shah Airport',\n",
       "  'Quelimane Airport',\n",
       "  'Persian Gulf International Airport',\n",
       "  'Port Hardy Airport',\n",
       "  'Memanbetsu Airport',\n",
       "  'Stavropol Shpakovskoye Airport',\n",
       "  'Bisha Airport',\n",
       "  'Tununak Airport',\n",
       "  'Antwerp International Airport (Deurne)',\n",
       "  'Misratah Airport',\n",
       "  'Comandante Espora Airport',\n",
       "  'Gannan Xiahe Airport',\n",
       "  'Sanya Phoenix International Airport',\n",
       "  'Yakima Air Terminal McAllister Field',\n",
       "  'Ahwaz Airport',\n",
       "  'Tanjung Manis Airport',\n",
       "  'Erechim Airport',\n",
       "  'Sevilla Airport',\n",
       "  'Barinas Airport',\n",
       "  'Spichenkovo Airport',\n",
       "  'Siwo Airport',\n",
       "  'Mc Clellan-Palomar Airport',\n",
       "  'Montpellier-Méditerranée Airport',\n",
       "  'Lambert St Louis International Airport',\n",
       "  'Voronezh International Airport',\n",
       "  'Usinsk Airport',\n",
       "  'Evansville Regional Airport',\n",
       "  'Kunming Wujiaba International Airport',\n",
       "  'Longjia Airport',\n",
       "  'Marechal Rondon Airport',\n",
       "  'Mário Ribeiro Airport',\n",
       "  'Hay River / Merlyn Carter Airport',\n",
       "  'Minsk International Airport',\n",
       "  'Addis Ababa Bole International Airport',\n",
       "  'Crooked Creek Airport',\n",
       "  'Le Havre Octeville Airport',\n",
       "  'Rajahmundry Airport',\n",
       "  'Dasht-e Naz Airport',\n",
       "  'Craig Cove Airport',\n",
       "  'Polokwane International Airport',\n",
       "  'Al Najaf International Airport',\n",
       "  'Oita Airport',\n",
       "  'Mardin Airport',\n",
       "  'Kanas Airport',\n",
       "  'Olsztyn-Mazury Airport',\n",
       "  'Diqing Airport',\n",
       "  'Tingwall Airport',\n",
       "  'Araraquara Airport',\n",
       "  'Rendani Airport',\n",
       "  'Delingha Airport',\n",
       "  'Maio Airport',\n",
       "  'Sint Martin, Princess Juliana International Airport',\n",
       "  'Aratika Nord Airport',\n",
       "  'Sam Ratulangi Airport',\n",
       "  'Shigatse Peace Airport',\n",
       "  'Ministro Victor Konder International Airport',\n",
       "  'Regina International Airport',\n",
       "  'Wichita Mid Continent Airport',\n",
       "  'Quzhou Airport',\n",
       "  'Samaná El Catey International Airport',\n",
       "  'Tucson International Airport',\n",
       "  'Imam Khomeini International Airport',\n",
       "  'Bonito Airport',\n",
       "  'Barcelos Airport',\n",
       "  'Miyazaki Airport',\n",
       "  'Sandy Lake Airport',\n",
       "  'Mildura Airport',\n",
       "  'St Paul Island Airport',\n",
       "  'Gorno-Altaysk Airport',\n",
       "  'Kandahar Airport',\n",
       "  'Queenstown International Airport',\n",
       "  'Bhavnagar Airport',\n",
       "  'Kona International At Keahole Airport',\n",
       "  'Logroño-Agoncillo Airport',\n",
       "  'Bol Airport',\n",
       "  'Northwest Arkansas Regional Airport',\n",
       "  'Chiang Mai International Airport',\n",
       "  'Moises R. Espinosa Airport',\n",
       "  'Orenburg Central Airport',\n",
       "  'Lensk Airport',\n",
       "  'Birsa Munda Airport',\n",
       "  'Rijeka Airport',\n",
       "  'Sultan Khairun Babullah Airport',\n",
       "  'Sokol Airport',\n",
       "  'Fergana International Airport',\n",
       "  'Reykjavik Airport',\n",
       "  'Olbia Costa Smeralda Airport',\n",
       "  'Rota International Airport',\n",
       "  'General Ignacio P. Garcia International Airport',\n",
       "  'Los Colonizadores Airport',\n",
       "  'Grand Junction Regional Airport',\n",
       "  'Capital City Airport',\n",
       "  'McGhee Tyson Airport',\n",
       "  'Fort Severn Airport',\n",
       "  'Paphos International Airport',\n",
       "  'Palm Beach International Airport',\n",
       "  'Legazpi City International Airport',\n",
       "  'Sovetskiy Airport',\n",
       "  'Townsville Airport',\n",
       "  'Gabès Matmata International Airport',\n",
       "  'Hewanorra International Airport',\n",
       "  'Cincinnati Municipal Airport Lunken Field',\n",
       "  'Kao Airport',\n",
       "  'Urgench Airport',\n",
       "  'Rach Gia Airport',\n",
       "  'Cedar City Regional Airport',\n",
       "  'Niagara Falls International Airport',\n",
       "  'Golog Maqin Airport',\n",
       "  'Bou Chekif Airport',\n",
       "  'Jixi Xingkaihu Airport',\n",
       "  'Nanyang Airport',\n",
       "  'Igiugig Airport',\n",
       "  'Mayaguana Airport',\n",
       "  \"Lutselk'e Airport\",\n",
       "  'Jorge Wilsterman International Airport',\n",
       "  'Youngstown Warren Regional Airport',\n",
       "  'Båtsfjord Airport',\n",
       "  'Kingston Norman Rogers Airport',\n",
       "  'Ubari Airport',\n",
       "  'Bartolomeu Lisandro Airport',\n",
       "  'Tunxi International Airport',\n",
       "  'Quesnel Airport',\n",
       "  'Charles M. Schulz Sonoma County Airport',\n",
       "  'Stavanger Airport',\n",
       "  'Sapporo, New Chitose Airport',\n",
       "  'Naples Municipal Airport',\n",
       "  'Agartala Airport',\n",
       "  'Dawson Creek Airport',\n",
       "  'Takapoto Airport',\n",
       "  'Stockholm Skavsta Airport',\n",
       "  'Eastern Oregon Regional At Pendleton Airport',\n",
       "  'Mörön Airport',\n",
       "  'Mexico City, Licenciado Benito Juarez International Airport',\n",
       "  'Datong Airport',\n",
       "  'Ngjiva Pereira Airport',\n",
       "  'Toulouse-Blagnac Airport',\n",
       "  'Williamsport Regional Airport',\n",
       "  'Gdańsk Lech Wałęsa Airport',\n",
       "  'Makemo Airport',\n",
       "  'Cataratas International Airport',\n",
       "  'Elcho Island Airport',\n",
       "  'Malta International Airport',\n",
       "  'Kostanay West Airport',\n",
       "  'Seattle-Tacoma',\n",
       "  'Presidente Castro Pinto International Airport',\n",
       "  'Calicut International Airport',\n",
       "  'Moscow, Domodedovo International Airport',\n",
       "  'Geraldton Airport',\n",
       "  'Dundee Airport',\n",
       "  'Shungnak Airport',\n",
       "  'Kuujjuarapik Airport',\n",
       "  'Taldykorgan Airport',\n",
       "  'Lewiston Nez Perce County Airport',\n",
       "  'Ağrı Airport',\n",
       "  'Xishuangbanna Gasa Airport',\n",
       "  'Bailian Airport',\n",
       "  'Kanpur Airport',\n",
       "  'Skellefteå Airport',\n",
       "  'Montgomery Regional (Dannelly Field) Airport',\n",
       "  'Coronel Artilleria Victor Larrea Airport',\n",
       "  'Kastoria National Airport',\n",
       "  'Örnsköldsvik Airport',\n",
       "  'Cherepovets Airport',\n",
       "  'Jamestown Regional Airport',\n",
       "  'Mineralnyye Vody Airport',\n",
       "  'Jodhpur Airport',\n",
       "  'Douala International Airport',\n",
       "  'Toronto Pearson International Airport',\n",
       "  'Aksu Airport',\n",
       "  \"St. John's International Airport\",\n",
       "  'Noi Bai International Airport',\n",
       "  'Castlegar/West Kootenay Regional Airport',\n",
       "  'Arctic Village Airport',\n",
       "  'Kyaukpyu Airport',\n",
       "  'Ottawa Macdonald-Cartier International Airport',\n",
       "  'Calbayog Airport',\n",
       "  'Sachs Harbour (David Nasogaluak Jr. Saaryuaq) Airport',\n",
       "  'Maastricht Aachen Airport',\n",
       "  'Rodríguez Ballón International Airport',\n",
       "  'Tuluksak Airport',\n",
       "  'Playa De Oro International Airport',\n",
       "  'Vijayawada Airport',\n",
       "  'Rutland - Southern Vermont Regional Airport',\n",
       "  'Port Lincoln Airport',\n",
       "  'Bahías de Huatulco International Airport',\n",
       "  'José Leonardo Chirinos Airport',\n",
       "  'Hatay Airport',\n",
       "  'Stockton Metropolitan Airport',\n",
       "  'Dillingham Airport',\n",
       "  'Mont Joli Airport',\n",
       "  'Banjul International Airport',\n",
       "  'Mount Hagen Kagamuga Airport',\n",
       "  'Whitehorse / Erik Nielsen International Airport',\n",
       "  'Trepell Airport',\n",
       "  'Tongoa Airport',\n",
       "  'Myitkyina Airport',\n",
       "  'Konya Airport',\n",
       "  'Donskoye Airport',\n",
       "  'Chumphon Airport',\n",
       "  'Çanakkale Airport',\n",
       "  'Pensacola Regional Airport',\n",
       "  'Matecaña International Airport',\n",
       "  'Kinmen Airport',\n",
       "  'Ketapang(Rahadi Usman) Airport',\n",
       "  'Tonghua Sanyuanpu Airport',\n",
       "  'Kowanyama Airport',\n",
       "  'Jorge E. Gonzalez Torres Airport',\n",
       "  'Lodwar Airport',\n",
       "  'Fukue Airport',\n",
       "  'Shijiazhuang Daguocun International Airport',\n",
       "  'El Yopal Airport',\n",
       "  'Marudi Airport',\n",
       "  'Rondonópolis Airport',\n",
       "  'Barkley Regional Airport',\n",
       "  'Yeager Airport',\n",
       "  'Churchill Falls Airport',\n",
       "  'Joplin Regional Airport',\n",
       "  'Halmstad Airport',\n",
       "  'Tripoli International Airport',\n",
       "  'Devonport Airport',\n",
       "  'Roxas Airport',\n",
       "  'Bob Baker Memorial Airport',\n",
       "  'Lindu Airport',\n",
       "  'Quad City International Airport',\n",
       "  'Capitan Oriel Lea Plaza Airport',\n",
       "  'Port Lions Airport',\n",
       "  'Thunder Bay Airport',\n",
       "  'Arturo Michelena International Airport',\n",
       "  'Sveg Airport',\n",
       "  'Santa Elena de Uairen Airport',\n",
       "  'White Mountain Airport',\n",
       "  'Yancheng Airport',\n",
       "  'Jose Maria Córdova International Airport',\n",
       "  'Xieng Khouang Airport',\n",
       "  'Dalanzadgad Airport',\n",
       "  'Ioannis Kapodistrias International Airport',\n",
       "  'Poplar Hill Airport',\n",
       "  'Treasure Cay Airport',\n",
       "  'Paris Charles de Gaulle',\n",
       "  'John C. Munro Hamilton International Airport',\n",
       "  'Malatya Erhaç Airport',\n",
       "  'Mount Pleasant Airport',\n",
       "  'Kingman Airport',\n",
       "  'Vaasa Airport',\n",
       "  'Jorge Newbery Airpark',\n",
       "  'Makkovik Airport',\n",
       "  'Jining Qufu Airport',\n",
       "  'University of Illinois Willard Airport',\n",
       "  'La Macarena Airport',\n",
       "  'Surat Airport',\n",
       "  'Lanai Airport',\n",
       "  \"Nice-Cote d'Azur Airport\",\n",
       "  'Tulsa International Airport',\n",
       "  'Kangiqsujuaq (Wakeham Bay) Airport',\n",
       "  'Naxos Airport',\n",
       "  'Rabil Airport',\n",
       "  'Hanimaadhoo Airport',\n",
       "  'Houghton County Memorial Airport',\n",
       "  'Chandigarh Airport',\n",
       "  'Tolmachevo Airport',\n",
       "  'Mecheria Airport',\n",
       "  'Lázaro Cárdenas Airport',\n",
       "  'Philibert Tsiranana (Amborovy) Airport',\n",
       "  'Blackpool International Airport',\n",
       "  'Gombe Lawanti International Airport',\n",
       "  'Tromsø Airport',\n",
       "  'Vilo Acuña International Airport',\n",
       "  'Fascene Airport',\n",
       "  'Taree Airport',\n",
       "  'Lingling Airport',\n",
       "  'Kolkata, Netaji Subhash Chandra Bose International Airport',\n",
       "  'Bukoba Airport',\n",
       "  'Venango Regional Airport',\n",
       "  'Kapuskasing Airport',\n",
       "  'Coastal Carolina Regional Airport',\n",
       "  'Gainesville Regional Airport',\n",
       "  'Sittwe Airport',\n",
       "  'Awang Airport',\n",
       "  'Durham Tees Valley Airport',\n",
       "  'Maestro Wilson Fonseca Airport',\n",
       "  'Camilo Daza International Airport',\n",
       "  'Guangzhou Baiyun International Airport',\n",
       "  'Hasvik Airport',\n",
       "  'Provo Municipal Airport',\n",
       "  'Lakeba Island Airport',\n",
       "  'Pichoy Airport',\n",
       "  'Herat Airport',\n",
       "  'Surat Thani Airport',\n",
       "  'Haifa International Airport',\n",
       "  'Wenzhou Yongqiang Airport',\n",
       "  'Antonio Rivera Rodriguez Airport',\n",
       "  'Brno-Tuřany Airport',\n",
       "  'Loreto International Airport',\n",
       "  'Enontekio Airport',\n",
       "  'Ravensthorpe Airport',\n",
       "  'Asosa Airport',\n",
       "  'Coffs Harbour Airport',\n",
       "  'São Filipe Airport',\n",
       "  'Dijon-Bourgogne Airport',\n",
       "  'Pointe Vele Airport',\n",
       "  'Bhuj Airport',\n",
       "  'Kalymnos Airport',\n",
       "  'Aasiaat Airport',\n",
       "  'Debrecen International Airport',\n",
       "  'Lal Bahadur Shastri Airport',\n",
       "  'Wrangell Airport',\n",
       "  'Rhinelander Oneida County Airport',\n",
       "  'Chapecó Airport',\n",
       "  'Kiunga Airport',\n",
       "  'Kars Airport',\n",
       "  'Yelizovo Airport',\n",
       "  'Maui, Kahului Airport',\n",
       "  'Spokane International Airport',\n",
       "  'E. T. Joshua Airport',\n",
       "  'Lanzarote Airport',\n",
       "  'Cape Town International Airport',\n",
       "  'Togiak Airport',\n",
       "  'Alejandro Velasco Astete International Airport',\n",
       "  'Harlingen, Valley International Airport',\n",
       "  'Savonlinna Airport',\n",
       "  'Nosara Airport',\n",
       "  'Varna Airport',\n",
       "  'Range Regional Airport',\n",
       "  'Tarko-Sale Airport',\n",
       "  'El Golea Airport',\n",
       "  'Lomé-Tokoin Airport',\n",
       "  'Rennell/Tingoa Airport',\n",
       "  'Frankfurt-Hahn Airport',\n",
       "  'Manihi Airport',\n",
       "  'Changzhoudao Airport',\n",
       "  'Capitán Aníbal Arab Airport',\n",
       "  'Lincoln Airport',\n",
       "  'Vardø Airport, Svartnes',\n",
       "  'Waimea Kohala Airport',\n",
       "  'Osh Airport',\n",
       "  'Jardines Del Rey Airport',\n",
       "  'Khrabrovo Airport',\n",
       "  'Shikezi Huayuan Airport',\n",
       "  'Esenboğa International Airport',\n",
       "  'Mutiara Airport',\n",
       "  'Ajaccio-Napoléon Bonaparte Airport',\n",
       "  'Bermuda, L.F. Wade International International Airport',\n",
       "  'Canaima Airport',\n",
       "  'Clovis Municipal Airport',\n",
       "  'Rigolet Airport',\n",
       "  'Girona Airport',\n",
       "  'Nusatupe Airport',\n",
       "  'Yemelyanovo Airport',\n",
       "  'Cork Airport',\n",
       "  'La Romaine Airport',\n",
       "  'Bristol International Airport',\n",
       "  'Portland International Jetport Airport',\n",
       "  'Shannon Airport',\n",
       "  'Coober Pedy Airport',\n",
       "  'Toamasina Airport',\n",
       "  'Russian Mission Airport',\n",
       "  'Castres-Mazamet Airport',\n",
       "  'Vorkuta Airport',\n",
       "  'Barisal Airport',\n",
       "  'Mahlon Sweet Field',\n",
       "  'Bogashevo Airport',\n",
       "  'Nador International Airport',\n",
       "  'Batumi International Airport',\n",
       "  'Isle of Man Airport',\n",
       "  'Rockhampton Airport',\n",
       "  'Frans Kaisiepo Airport',\n",
       "  'Gogebic Iron County Airport',\n",
       "  'Torres Airstrip',\n",
       "  'MBS International Airport',\n",
       "  'Ghriss/Mascara Airport',\n",
       "  'Kushiro Airport',\n",
       "  'Raja Haji Fisabilillah International Airport',\n",
       "  'Sohag International Airport',\n",
       "  'Périgueux-Bassillac Airport',\n",
       "  'Piedmont Triad International Airport',\n",
       "  'Narvik Framnes Airport',\n",
       "  'Faleolo International Airport',\n",
       "  'Dr. Babasaheb Ambedkar International Airport',\n",
       "  'La Abraq Airport',\n",
       "  'Kasese Airport',\n",
       "  'Bora Bora Airport',\n",
       "  'Tokyo Narita',\n",
       "  'Ballera Airport',\n",
       "  'Taloyoak Airport',\n",
       "  'Urdzhar Airport',\n",
       "  'Adolfo Suarez Barajas Airport International Airport',\n",
       "  'North Central West Virginia Airport',\n",
       "  'Gallatin Field',\n",
       "  'Manda Airstrip',\n",
       "  'Vladivostok International Airport',\n",
       "  'St George Airport',\n",
       "  'Benbecula Airport',\n",
       "  'Kegaska Airport',\n",
       "  'Deer Lake Airport',\n",
       "  'Mundo Maya International Airport',\n",
       "  'Ostend-Bruges International Airport',\n",
       "  'Malé International Airport',\n",
       "  'Deauville-Saint-Gatien Airport',\n",
       "  'Zemunik Airport',\n",
       "  'Kununurra Airport',\n",
       "  'Kastelorizo Airport',\n",
       "  'Nyala Airport',\n",
       "  'Langkawi International Airport',\n",
       "  'Fabio Alberto Leon Bentley Airport',\n",
       "  'Sirnak Airport',\n",
       "  'Francisco B. Reyes Airport',\n",
       "  'Quatro de Fevereiro Airport',\n",
       "  'Maya-Maya Airport',\n",
       "  'L M Clayton Airport',\n",
       "  'Gran Canaria Airport',\n",
       "  'Jiayuguan Airport',\n",
       "  'Bulolo Airport',\n",
       "  'Brunswick Golden Isles Airport',\n",
       "  'Kagoshima Airport',\n",
       "  'Touggourt Sidi Madhi Airport',\n",
       "  'Las Vegas Mc Carran',\n",
       "  'Lungi International Airport',\n",
       "  'Samarkand Airport',\n",
       "  'Zweibrücken Airport',\n",
       "  'Taupo Airport',\n",
       "  'Warrnambool Airport',\n",
       "  'General Rodolfo Sánchez Taboada International Airport',\n",
       "  'Robert Gray  Army Air Field Airport',\n",
       "  'Capitán Av. Selin Zeitun Lopez Airport',\n",
       "  'Flinders Island Airport',\n",
       "  'Bonaventure Airport',\n",
       "  'Algiers, Houari Boumediene Airport',\n",
       "  'Yichang Airport',\n",
       "  'Lokpriya Gopinath Bordoloi International Airport',\n",
       "  'Münster Osnabrück Airport',\n",
       "  'Northwest Alabama Regional Airport',\n",
       "  'Arad International Airport',\n",
       "  'RAAF Base Curtin',\n",
       "  'Marshall Don Hunter Sr Airport',\n",
       "  'Waskaganish Airport',\n",
       "  'Tupelo Regional Airport',\n",
       "  'Araxá Airport',\n",
       "  'Stillwater Regional Airport',\n",
       "  'Vancouver',\n",
       "  'Little Rock, Bill and Hillary Clinton National Airport/Adams Field',\n",
       "  'Tri Cities Regional Tn Va Airport',\n",
       "  'Hualien Airport',\n",
       "  'Itaituba Airport',\n",
       "  'Clark International Airport',\n",
       "  'Kaduna Airport',\n",
       "  'Hagfors Airport',\n",
       "  'Muan International Airport',\n",
       "  'Vunisea Airport',\n",
       "  'La Chinita International Airport',\n",
       "  'Owensboro Daviess County Airport',\n",
       "  'Quinhagak Airport',\n",
       "  'Aberdeen Regional Airport',\n",
       "  'George Best Belfast City Airport',\n",
       "  'Dusseldorf International Airport',\n",
       "  'Honiara International Airport',\n",
       "  'Athens, Eleftherios Venizelos International Airport',\n",
       "  'Long Seridan Airport',\n",
       "  'Berlevåg Airport',\n",
       "  'Long Akah Airport',\n",
       "  'Chimbu Airport',\n",
       "  'Oksibil Airport',\n",
       "  'Vilhena Airport',\n",
       "  'Roi Et Airport',\n",
       "  'Hermanos Serdán International Airport',\n",
       "  'José Celestino Mutis Airport',\n",
       "  'Kaunas International Airport',\n",
       "  'Vitoria/Foronda Airport',\n",
       "  'Toowoomba Airport',\n",
       "  'Girua Airport',\n",
       "  'Palma De Mallorca Airport',\n",
       "  'Dickinson Theodore Roosevelt Regional Airport',\n",
       "  'Charlottesville Albemarle Airport',\n",
       "  'Penticton Airport',\n",
       "  'Shetland Islands, Fair Isle Airport',\n",
       "  'Duluth International Airport',\n",
       "  'Westport Airport',\n",
       "  'Rafael Hernandez Airport',\n",
       "  'Malindi Airport',\n",
       "  'Jerez Airport',\n",
       "  'Zahedan International Airport',\n",
       "  'La Florida Airport',\n",
       "  'Abadan Airport',\n",
       "  'Munda Airport',\n",
       "  'Tabriz International Airport',\n",
       "  'Ningbo Lishe International Airport',\n",
       "  'Tabubil Airport',\n",
       "  'Soummam Airport',\n",
       "  'Petersburg James A Johnson Airport',\n",
       "  'Sunan Shuofang International Airport',\n",
       "  'Geneva-Cointrin International Airport',\n",
       "  'Stagen Airport',\n",
       "  'Sayun International Airport',\n",
       "  'Yuzhno-Sakhalinsk Airport',\n",
       "  'Detroit Metropolitan, Wayne County',\n",
       "  'City of Colorado Springs Municipal Airport',\n",
       "  'Lubumbashi International Airport',\n",
       "  'Zhoushuizi Airport',\n",
       "  'Hobart International Airport',\n",
       "  'Mombasa Moi International Airport',\n",
       "  'Joensuu Airport',\n",
       "  'Waynesville-St. Robert Regional Forney field',\n",
       "  'El Fasher Airport',\n",
       "  'Havre City County Airport',\n",
       "  'Cancun International Airport',\n",
       "  'Kashgar Airport',\n",
       "  'Los Garzones Airport',\n",
       "  'Changbaishan Airport',\n",
       "  'Deadhorse Airport',\n",
       "  'Koyuk Alfred Adams Airport',\n",
       "  'Hooper Bay Airport',\n",
       "  'Saïss Airport',\n",
       "  'Ben Schoeman Airport',\n",
       "  'Nevşehir Kapadokya International Airport',\n",
       "  'Malmö Sturup Airport',\n",
       "  'Turpan Jiaohe Airport',\n",
       "  'Red Deer Regional Airport',\n",
       "  'Chimoio Airport',\n",
       "  'Iliamna Airport',\n",
       "  'Weipa Airport',\n",
       "  'Paulatuk (Nora Aliqatchialuk Ruben) Airport',\n",
       "  'Trollhättan-Vänersborg Airport',\n",
       "  'Catamarca Airport',\n",
       "  'Kuopio Airport',\n",
       "  'Heho Airport',\n",
       "  'Tancredo Neves International Airport',\n",
       "  'Wattay International Airport',\n",
       "  'Padang Kemiling (Fatmawati Soekarno) Airport',\n",
       "  'Bocas Del Toro International Airport',\n",
       "  'Goloson International Airport',\n",
       "  'Irkutsk Airport',\n",
       "  'Sandane Airport, Anda',\n",
       "  'King Abdulaziz International Airport',\n",
       "  'Orlando Sanford International Airport',\n",
       "  'Eirunepé Airport',\n",
       "  'F. D. Roosevelt Airport',\n",
       "  'Buon Ma Thuot Airport',\n",
       "  'Brevig Mission Airport',\n",
       "  'Saga Airport',\n",
       "  'Cà Mau Airport',\n",
       "  'Central Wisconsin Airport',\n",
       "  'Luoyang Airport',\n",
       "  'Donegal Airport',\n",
       "  'Valesdir Airport',\n",
       "  'Ayers Rock Connellan Airport',\n",
       "  'Enua Airport',\n",
       "  'Zhoushan Airport',\n",
       "  'Uzhhorod International Airport',\n",
       "  'Toledo Express Airport',\n",
       "  'Pilot Point Airport',\n",
       "  'Attawapiskat Airport',\n",
       "  'Arnold Palmer Regional Airport',\n",
       "  'Mackay Airport',\n",
       "  'Newtok Airport',\n",
       "  'Zakynthos, Dionysios Solomos Airport',\n",
       "  'Cam Ranh Airport',\n",
       "  'Tenerife South Airport',\n",
       "  'Nordholz-Spieka',\n",
       "  'Piloto Civil N. Fernández Airport',\n",
       "  'Berbera Airport',\n",
       "  'Uytash Airport',\n",
       "  'Gwadar International Airport',\n",
       "  'Las Américas International Airport',\n",
       "  'Sao Paulo, Guarulhos - Governador Andras Franco Montoro International Airport',\n",
       "  'Kasiguncu Airport',\n",
       "  'General Wayne A. Downing Peoria International Airport',\n",
       "  'Sioux Gateway Col. Bud Day Field',\n",
       "  'Kullu Manali Airport',\n",
       "  'Egilsstaðir Airport',\n",
       "  'Phu Cat Airport',\n",
       "  'Yellowstone Regional Airport',\n",
       "  'Roshchino International Airport',\n",
       "  'Ronald Reagan Washington National Airport',\n",
       "  \"Val-d'Or Airport\",\n",
       "  'Ivalo Airport',\n",
       "  'Pune Airport',\n",
       "  'Cadete FAP Guillermo Del Castillo Paredes Airport',\n",
       "  'Kawthoung Airport',\n",
       "  'Gabala International Airport',\n",
       "  'Pakuba Airport',\n",
       "  'Capitan Corbeta CA Curbelo International Airport',\n",
       "  'Perth International Airport',\n",
       "  'Mysore Airport',\n",
       "  'Mendi Airport',\n",
       "  'Altai Airport',\n",
       "  'Nyagan Airport',\n",
       "  'Dhaka / Hazrat Shahjalal International Airport',\n",
       "  'San Carlos De Bariloche Airport',\n",
       "  'Gelendzhik Airport',\n",
       "  'Menorca Airport',\n",
       "  'Meadows Field',\n",
       "  'Barnstable Municipal Boardman Polando Field',\n",
       "  'Long Banga Airport',\n",
       "  'Choibalsan Airport',\n",
       "  'Santa Fe',\n",
       "  'Santa Rosa Airport',\n",
       "  'Ålesund Airport',\n",
       "  'Paamiut Airport',\n",
       "  'Solovki Airport',\n",
       "  'Mohammed V International Airport',\n",
       "  'Seymour Airport',\n",
       "  'Khanty Mansiysk Airport',\n",
       "  'Cotopaxi International Airport',\n",
       "  'Changzhi Airport',\n",
       "  'Venetie Airport',\n",
       "  'Alice Springs Airport',\n",
       "  'Dayong Airport',\n",
       "  'Mariana Grajales Airport',\n",
       "  'Stella Maris Airport',\n",
       "  'Novy Urengoy Airport',\n",
       "  'Maroantsetra Airport',\n",
       "  'Perpignan-Rivesaltes (Llabanère) Airport',\n",
       "  'Sukhothai Airport',\n",
       "  'Barter Island LRRS Airport',\n",
       "  'Fort Mcpherson Airport',\n",
       "  'Daegu Airport',\n",
       "  'La Tabatière Airport',\n",
       "  'Belfast International Airport',\n",
       "  'Husein Sastranegara International Airport',\n",
       "  'Catania-Fontanarossa Airport',\n",
       "  'Yamagata Airport',\n",
       "  'Gheshm Airport',\n",
       "  'Egal International Airport',\n",
       "  'Lebanon Municipal Airport',\n",
       "  'Alfonso López Pumarejo Airport',\n",
       "  'Çardak Airport',\n",
       "  'Sleetmute Airport',\n",
       "  'Bamaga Injinoo Airport',\n",
       "  'Tampere-Pirkkala Airport',\n",
       "  'Asturias Airport',\n",
       "  'Lloydminster Airport',\n",
       "  'St Petersburg Clearwater International Airport',\n",
       "  'Licenciado y General Ignacio Lopez Rayon Airport',\n",
       "  'Circle City /New/ Airport',\n",
       "  'Fort Simpson Airport',\n",
       "  'Milan, Malpensa International Airport',\n",
       "  'Anshan Air Base',\n",
       "  'Atyrau Airport',\n",
       "  'South Bend Regional Airport',\n",
       "  'Sitka Rocky Gutierrez Airport',\n",
       "  'Rarotonga International Airport',\n",
       "  'Plácido de Castro Airport',\n",
       "  'General Lucio Blanco International Airport',\n",
       "  'Hilo International Airport',\n",
       "  'Birmingham International Airport',\n",
       "  'Dezful Airport',\n",
       "  'Lawas Airport',\n",
       "  'Quetzalcóatl International Airport',\n",
       "  'Linfen Qiaoli Airport',\n",
       "  'Jolo Airport',\n",
       "  'Ulaangom Airport',\n",
       "  'Moosonee Airport',\n",
       "  'Changsha Huanghua International Airport',\n",
       "  'Worland Municipal Airport',\n",
       "  'Copernicus Wroclaw Airport',\n",
       "  'Albuquerque International Sunport Airport',\n",
       "  'Sydney Kingsford Smith',\n",
       "  'Inca Manco Capac International Airport',\n",
       "  'Santa Maria Airport',\n",
       "  'Beaver Airport',\n",
       "  'Jacksonville International Airport',\n",
       "  'Formosa Airport',\n",
       "  'Norfolk International Airport',\n",
       "  'Kivalina Airport',\n",
       "  'Bayannur Tianjitai Airport',\n",
       "  'Horta Airport',\n",
       "  'Nikolai Airport',\n",
       "  'Key West International Airport',\n",
       "  'Ust-Tsylma Airport',\n",
       "  'Zurich-Kloten Airport',\n",
       "  'Natuashish Airport',\n",
       "  'Kiritimati (Christmas Island) - Cassidy International Airport',\n",
       "  'Fukushima Airport',\n",
       "  'Shenandoah Valley Regional Airport',\n",
       "  'Wallblake Airport',\n",
       "  'Walaha Airport',\n",
       "  ...]}"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().group().by(T.label).by('desc').next()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
