{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 3. GroupCount, Group\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import T\n",
    "from loader import __"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## groupCount()\n",
    "__Get types of vertices__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'continent': 7, 'country': 237, 'version': 1, 'airport': 3374}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().groupCount().by(T.label).next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Equivalent to"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().label().groupCount().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## group()\n",
    "Also equivalent to"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "x3 = g.V().group().by(T.label).by(__.count()).next()\n",
    "assert x2 == x3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Count of airports by country__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'PR': 6,\n",
       " 'PT': 14,\n",
       " 'PW': 1,\n",
       " 'PY': 2,\n",
       " 'QA': 1,\n",
       " 'AE': 10,\n",
       " 'AF': 4,\n",
       " 'AG': 1,\n",
       " 'AI': 1,\n",
       " 'AL': 1,\n",
       " 'AM': 2,\n",
       " 'AO': 14,\n",
       " 'AR': 36,\n",
       " 'AS': 1,\n",
       " 'AT': 6,\n",
       " 'RE': 2,\n",
       " 'AU': 124,\n",
       " 'AW': 1,\n",
       " 'AZ': 5,\n",
       " 'RO': 14,\n",
       " 'BA': 4,\n",
       " 'BB': 1,\n",
       " 'RS': 2,\n",
       " 'BD': 7,\n",
       " 'RU': 120,\n",
       " 'BE': 5,\n",
       " 'BF': 2,\n",
       " 'BG': 4,\n",
       " 'RW': 2,\n",
       " 'BH': 1,\n",
       " 'BI': 1,\n",
       " 'BJ': 1,\n",
       " 'BL': 1,\n",
       " 'BM': 1,\n",
       " 'BN': 1,\n",
       " 'BO': 15,\n",
       " 'SA': 26,\n",
       " 'SB': 17,\n",
       " 'BQ': 3,\n",
       " 'BR': 115,\n",
       " 'SC': 2,\n",
       " 'BS': 18,\n",
       " 'SD': 5,\n",
       " 'SE': 39,\n",
       " 'BT': 1,\n",
       " 'SG': 1,\n",
       " 'BW': 4,\n",
       " 'SH': 2,\n",
       " 'SI': 1,\n",
       " 'BY': 2,\n",
       " 'BZ': 13,\n",
       " 'SK': 2,\n",
       " 'SL': 1,\n",
       " 'SN': 3,\n",
       " 'SO': 5,\n",
       " 'CA': 203,\n",
       " 'SR': 1,\n",
       " 'SS': 1,\n",
       " 'CC': 1,\n",
       " 'CD': 11,\n",
       " 'ST': 1,\n",
       " 'CF': 1,\n",
       " 'SV': 1,\n",
       " 'CG': 3,\n",
       " 'CH': 5,\n",
       " 'SX': 1,\n",
       " 'CI': 1,\n",
       " 'SY': 2,\n",
       " 'SZ': 1,\n",
       " 'CK': 6,\n",
       " 'CL': 17,\n",
       " 'CM': 5,\n",
       " 'CN': 209,\n",
       " 'CO': 50,\n",
       " 'CR': 13,\n",
       " 'TC': 4,\n",
       " 'TD': 1,\n",
       " 'CU': 12,\n",
       " 'CV': 7,\n",
       " 'TG': 1,\n",
       " 'TH': 32,\n",
       " 'CW': 1,\n",
       " 'CX': 1,\n",
       " 'TJ': 4,\n",
       " 'CY': 3,\n",
       " 'CZ': 5,\n",
       " 'TL': 1,\n",
       " 'TM': 1,\n",
       " 'TN': 8,\n",
       " 'TO': 1,\n",
       " 'TR': 48,\n",
       " 'TT': 2,\n",
       " 'DE': 33,\n",
       " 'TV': 1,\n",
       " 'TW': 9,\n",
       " 'TZ': 8,\n",
       " 'DJ': 1,\n",
       " 'DK': 8,\n",
       " 'DM': 1,\n",
       " 'DO': 7,\n",
       " 'UA': 15,\n",
       " 'UG': 4,\n",
       " 'UK': 58,\n",
       " 'DZ': 29,\n",
       " 'US': 579,\n",
       " 'EC': 15,\n",
       " 'EE': 3,\n",
       " 'EG': 10,\n",
       " 'EH': 2,\n",
       " 'UY': 2,\n",
       " 'UZ': 11,\n",
       " 'ER': 1,\n",
       " 'VC': 1,\n",
       " 'ES': 42,\n",
       " 'VE': 24,\n",
       " 'ET': 14,\n",
       " 'VG': 2,\n",
       " 'VI': 2,\n",
       " 'VN': 21,\n",
       " 'VU': 26,\n",
       " 'FI': 20,\n",
       " 'FJ': 10,\n",
       " 'FK': 2,\n",
       " 'FM': 4,\n",
       " 'FO': 1,\n",
       " 'FR': 58,\n",
       " 'WF': 2,\n",
       " 'GA': 2,\n",
       " 'WS': 1,\n",
       " 'GD': 1,\n",
       " 'GE': 3,\n",
       " 'GF': 1,\n",
       " 'GG': 2,\n",
       " 'GH': 5,\n",
       " 'GI': 1,\n",
       " 'GL': 14,\n",
       " 'GM': 1,\n",
       " 'GN': 1,\n",
       " 'GP': 1,\n",
       " 'GQ': 2,\n",
       " 'GR': 39,\n",
       " 'GT': 2,\n",
       " 'GU': 1,\n",
       " 'GW': 1,\n",
       " 'GY': 2,\n",
       " 'HK': 1,\n",
       " 'HN': 6,\n",
       " 'HR': 8,\n",
       " 'YE': 9,\n",
       " 'HT': 2,\n",
       " 'HU': 2,\n",
       " 'ID': 67,\n",
       " 'YT': 1,\n",
       " 'IE': 7,\n",
       " 'IL': 5,\n",
       " 'IM': 1,\n",
       " 'IN': 73,\n",
       " 'ZA': 20,\n",
       " 'IQ': 6,\n",
       " 'IR': 44,\n",
       " 'IS': 5,\n",
       " 'IT': 36,\n",
       " 'ZM': 8,\n",
       " 'JE': 1,\n",
       " 'ZW': 3,\n",
       " 'JM': 2,\n",
       " 'JO': 2,\n",
       " 'JP': 63,\n",
       " 'KE': 14,\n",
       " 'KG': 2,\n",
       " 'KH': 3,\n",
       " 'KI': 2,\n",
       " 'KM': 1,\n",
       " 'KN': 2,\n",
       " 'KP': 1,\n",
       " 'KR': 15,\n",
       " 'KS': 1,\n",
       " 'KW': 1,\n",
       " 'KY': 3,\n",
       " 'KZ': 20,\n",
       " 'LA': 8,\n",
       " 'LB': 1,\n",
       " 'LC': 2,\n",
       " 'LK': 6,\n",
       " 'LR': 2,\n",
       " 'LS': 1,\n",
       " 'LT': 3,\n",
       " 'LU': 1,\n",
       " 'LV': 1,\n",
       " 'LY': 10,\n",
       " 'MA': 14,\n",
       " 'MD': 1,\n",
       " 'ME': 2,\n",
       " 'MF': 1,\n",
       " 'MG': 13,\n",
       " 'MH': 2,\n",
       " 'MK': 1,\n",
       " 'ML': 1,\n",
       " 'MM': 14,\n",
       " 'MN': 10,\n",
       " 'MO': 1,\n",
       " 'MP': 2,\n",
       " 'MQ': 1,\n",
       " 'MR': 3,\n",
       " 'MS': 1,\n",
       " 'MT': 1,\n",
       " 'MU': 2,\n",
       " 'MV': 8,\n",
       " 'MW': 2,\n",
       " 'MX': 59,\n",
       " 'MY': 34,\n",
       " 'MZ': 10,\n",
       " 'NA': 4,\n",
       " 'NC': 1,\n",
       " 'NE': 1,\n",
       " 'NF': 1,\n",
       " 'NG': 18,\n",
       " 'NI': 1,\n",
       " 'NL': 5,\n",
       " 'NO': 49,\n",
       " 'NP': 10,\n",
       " 'NR': 1,\n",
       " 'NZ': 25,\n",
       " 'OM': 4,\n",
       " 'PA': 5,\n",
       " 'PE': 20,\n",
       " 'PF': 30,\n",
       " 'PG': 26,\n",
       " 'PH': 38,\n",
       " 'PK': 21,\n",
       " 'PL': 13,\n",
       " 'PM': 1}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').groupCount().by('country').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In select countries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'FR': 58, 'GR': 39, 'BE': 5}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').groupCount().by('country').select('FR','GR','BE').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Count of outgoing vertices for each continent code__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'EU': 583, 'AS': 932, 'NA': 978, 'OC': 284, 'AF': 294, 'AN': 0, 'SA': 303}"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('continent').group().by('code').by(__.out().count()).next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Group all descriptions by their label__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'continent': ['Oceania',\n",
       "  'Europe',\n",
       "  'Asia',\n",
       "  'Antarctica',\n",
       "  'South America',\n",
       "  'North America',\n",
       "  'Africa'],\n",
       " 'country': ['Democratic Republic of the Congo',\n",
       "  'Oman',\n",
       "  'Senegal',\n",
       "  'Iran',\n",
       "  'Isle of Man',\n",
       "  'Malaysia',\n",
       "  'Slovakia',\n",
       "  'Eritrea',\n",
       "  'Kuwait',\n",
       "  'Western Sahara',\n",
       "  'Austria',\n",
       "  'United Kingdom',\n",
       "  'Hong Kong',\n",
       "  'Turkey',\n",
       "  'Saint Helena',\n",
       "  'Norfolk Island',\n",
       "  'Cambodia',\n",
       "  'Iraq',\n",
       "  'Sweden',\n",
       "  'Nicaragua',\n",
       "  'Malawi',\n",
       "  'Kenya',\n",
       "  'Christmas Island',\n",
       "  'Rwanda',\n",
       "  'Jordan',\n",
       "  'Chile',\n",
       "  'Nigeria',\n",
       "  'Guadeloupe',\n",
       "  'Northern Mariana Islands',\n",
       "  'Guinea',\n",
       "  'Botswana',\n",
       "  'Equatorial Guinea',\n",
       "  'Portugal',\n",
       "  'Czech Republic',\n",
       "  'Mongolia',\n",
       "  'Saudi Arabia',\n",
       "  'Central African Republic',\n",
       "  'Ukraine',\n",
       "  'Suriname',\n",
       "  'Libya',\n",
       "  'Malta',\n",
       "  'Latvia',\n",
       "  'New Zealand',\n",
       "  'Reunion',\n",
       "  'Mali',\n",
       "  'Algeria',\n",
       "  'Japan',\n",
       "  'Bonaire - Sint Eustatius and Saba',\n",
       "  'Thailand',\n",
       "  'Saint Vincent and Grenadines',\n",
       "  'Nauru',\n",
       "  'Madagascar',\n",
       "  'Vanuatu',\n",
       "  'Macedonia',\n",
       "  'Australia',\n",
       "  'San Marino',\n",
       "  'Ireland',\n",
       "  'Maldives',\n",
       "  'Philippines',\n",
       "  'Palau',\n",
       "  'Singapore',\n",
       "  'Peru',\n",
       "  'Martinique',\n",
       "  'Liberia',\n",
       "  'Armenia',\n",
       "  'Timor-Leste',\n",
       "  'Anguilla',\n",
       "  \"Côte d'Ivoire\",\n",
       "  'Morocco',\n",
       "  'Mexico',\n",
       "  'Antigua and Barbuda',\n",
       "  'Bosnia and Herzegovina',\n",
       "  'Uzbekistan',\n",
       "  'Dominican Republic',\n",
       "  'Guatemala',\n",
       "  'New Caledonia',\n",
       "  'Nepal',\n",
       "  'United Arab Emirates',\n",
       "  'Congo',\n",
       "  'Montenegro',\n",
       "  'Lebanon',\n",
       "  'Spain',\n",
       "  'Belarus',\n",
       "  'Fiji',\n",
       "  'Iceland',\n",
       "  'Burundi',\n",
       "  'Bolivia',\n",
       "  'Slovenia',\n",
       "  'Comoros',\n",
       "  'Greenland',\n",
       "  'Cabo Verde',\n",
       "  'Guyana',\n",
       "  'Andorra',\n",
       "  'Republic of Korea',\n",
       "  'Lesotho',\n",
       "  'Afghanistan',\n",
       "  'Gambia',\n",
       "  'Seychelles',\n",
       "  'Cameroon',\n",
       "  'Barbados',\n",
       "  'Romania',\n",
       "  'French Guiana',\n",
       "  'Saint Kitts and Nevis',\n",
       "  'Aruba',\n",
       "  'Estonia',\n",
       "  'Namibia',\n",
       "  'Ethiopia',\n",
       "  'Brunei',\n",
       "  'Djibouti',\n",
       "  'British Virgin Islands',\n",
       "  'Angola',\n",
       "  'Mauritania',\n",
       "  'Tanzania',\n",
       "  'Paraguay',\n",
       "  'Monaco',\n",
       "  'Moldova',\n",
       "  'Saint Pierre and Miquelon',\n",
       "  'Jamaica',\n",
       "  'Liechtenstein',\n",
       "  'Guam',\n",
       "  'Cyprus',\n",
       "  'Uruguay',\n",
       "  'China',\n",
       "  'Benin',\n",
       "  'Grenada',\n",
       "  'Bahrain',\n",
       "  'Marshall Islands',\n",
       "  'Cuba',\n",
       "  'Guernsey',\n",
       "  'Jersey',\n",
       "  'Falkland Islands',\n",
       "  'Solomon Islands',\n",
       "  'Turks and Caicos Islands',\n",
       "  'Sri Lanka',\n",
       "  'Pakistan',\n",
       "  'Israel',\n",
       "  'Switzerland',\n",
       "  'Gibraltar',\n",
       "  'Tonga',\n",
       "  'El Salvador',\n",
       "  'Mauritius',\n",
       "  'Croatia',\n",
       "  'Bahamas',\n",
       "  'Costa Rica',\n",
       "  'Tajikistan',\n",
       "  'Somalia',\n",
       "  'Syrian Arab Republic',\n",
       "  'Finland',\n",
       "  'American Samoa',\n",
       "  'Ecuador',\n",
       "  'Haiti',\n",
       "  'Egypt',\n",
       "  'Saint-Martin (France)',\n",
       "  'Turkmenistan',\n",
       "  'Togo',\n",
       "  'Cook Islands',\n",
       "  'Netherlands',\n",
       "  'Saint Lucia',\n",
       "  'Georgia',\n",
       "  'Cocos (Keeling) Islands',\n",
       "  'Samoa',\n",
       "  'Taiwan',\n",
       "  'Russian Federation',\n",
       "  \"Democratic People's Republic of Korea\",\n",
       "  'Mayotte',\n",
       "  'Indonesia',\n",
       "  'Mozambique',\n",
       "  'Sao Tome and Principe',\n",
       "  'Guinea-Bissau',\n",
       "  'Belize',\n",
       "  'Swaziland',\n",
       "  'Wallis and Futuna Islands',\n",
       "  'Colombia',\n",
       "  'Canada',\n",
       "  'Venezuela',\n",
       "  'Gabon',\n",
       "  'Kazakhstan',\n",
       "  'Macau',\n",
       "  'Zimbabwe',\n",
       "  'Brazil',\n",
       "  'Tunisia',\n",
       "  'Papua New Guinea',\n",
       "  'Trinidad and Tobago',\n",
       "  'Kyrgyzstan',\n",
       "  'Italy',\n",
       "  'Sierra Leone',\n",
       "  'Cayman Islands',\n",
       "  'Pitcairn',\n",
       "  'Bulgaria',\n",
       "  'Argentina',\n",
       "  'Saint-Barthelemy',\n",
       "  'Kosovo',\n",
       "  'Albania',\n",
       "  'Bangladesh',\n",
       "  'Azerbajan',\n",
       "  'Montserrat',\n",
       "  'Kiribati',\n",
       "  'Virgin Islands (US)',\n",
       "  'Hungary',\n",
       "  'Serbia',\n",
       "  'Greece',\n",
       "  'Tuvalu',\n",
       "  'Sudan',\n",
       "  'Curacao',\n",
       "  'Federated States of Micronesia',\n",
       "  'Myanmar',\n",
       "  'South Sudan',\n",
       "  'Sint Martin',\n",
       "  'Panama',\n",
       "  'Honduras',\n",
       "  'Denmark',\n",
       "  'Lithuania',\n",
       "  'Germany',\n",
       "  'French Polynesia',\n",
       "  'Burkina Faso',\n",
       "  'Belgium',\n",
       "  'United States',\n",
       "  'Qatar',\n",
       "  'Bhutan',\n",
       "  'Bermuda',\n",
       "  'India',\n",
       "  'France',\n",
       "  'Yemen',\n",
       "  'Poland',\n",
       "  'Uganda',\n",
       "  'Dominica',\n",
       "  'Zambia',\n",
       "  'Chad',\n",
       "  'Luxembourg',\n",
       "  'Norway',\n",
       "  'South Africa',\n",
       "  'Viet Nam',\n",
       "  'Puerto Rico',\n",
       "  'Faroe Islands',\n",
       "  'Niger',\n",
       "  'Ghana',\n",
       "  'Lao PDR'],\n",
       " 'version': ['Version: 0.77 Generated: 2017-10-06 16:24:40 UTC\\nGraph created by Kelvin R. Lawrence\\nPlease let me know of any errors you find in the graph.'],\n",
       " 'airport': ['Nelson Airport',\n",
       "  'Saurimo Airport',\n",
       "  'Chico Municipal Airport',\n",
       "  'Yakubu Gowon Airport',\n",
       "  'Santos Dumont Airport',\n",
       "  'Kelowna International Airport',\n",
       "  'Show Low Regional Airport',\n",
       "  'Esenboğa International Airport',\n",
       "  'Kerikeri Airport',\n",
       "  'La Chorrera Airport',\n",
       "  'Block Island State Airport',\n",
       "  'New York John F. Kennedy International Airport',\n",
       "  'Victoria Falls International Airport',\n",
       "  'Vinnytsia/Gavyryshivka Airport',\n",
       "  'Longjia Airport',\n",
       "  'Burketown Airport',\n",
       "  'Maya-Maya Airport',\n",
       "  'Lampedusa Airport',\n",
       "  'Hasanuddin International Airport',\n",
       "  'Whatì Airport',\n",
       "  'Alejandro Velasco Astete International Airport',\n",
       "  'Central Airport',\n",
       "  'Perth International Airport',\n",
       "  'Santa Genoveva Airport',\n",
       "  'Asmara International Airport',\n",
       "  'Mardin Airport',\n",
       "  'Jixi Xingkaihu Airport',\n",
       "  'Cengiz Topel Airport',\n",
       "  'Memorial Field',\n",
       "  'Diqing Airport',\n",
       "  'Toulon-Hyères Airport',\n",
       "  'Dr. Babasaheb Ambedkar International Airport',\n",
       "  'Sønderborg Airport',\n",
       "  'Salalah Airport',\n",
       "  'Fort Dodge Regional Airport',\n",
       "  'Orlando Sanford International Airport',\n",
       "  'Orange Airport',\n",
       "  'Longreach Airport',\n",
       "  'Des Moines International Airport',\n",
       "  'Port Augusta Airport',\n",
       "  'Multan International Airport',\n",
       "  'Kittila Airport',\n",
       "  'Point Hope Airport',\n",
       "  'Uralsk Airport',\n",
       "  'Ust-Tsylma Airport',\n",
       "  'Las Termas Airport',\n",
       "  'Kasane Airport',\n",
       "  'Salzburg Airport',\n",
       "  'Cincinnati Northern Kentucky International Airport',\n",
       "  'Namangan Airport',\n",
       "  'Waimea Kohala Airport',\n",
       "  'Craig Cove Airport',\n",
       "  'Platinum Airport',\n",
       "  'George Best Belfast City Airport',\n",
       "  'Hao Airport',\n",
       "  'Brownsville South Padre Island International Airport',\n",
       "  'Florence Regional Airport',\n",
       "  'San Pedro Airport',\n",
       "  'Buka Airport',\n",
       "  'Tambor Airport',\n",
       "  'Chiang Mai International Airport',\n",
       "  'Johannesburg, OR Tambo International Airport',\n",
       "  'Berlin-Schönefeld International Airport',\n",
       "  'New Castle Airport',\n",
       "  'Rafha Domestic Airport',\n",
       "  'Hamadan Airport',\n",
       "  'Hoedspruit Air Force Base Airport',\n",
       "  'Ain Arnat Airport',\n",
       "  'Goroka Airport',\n",
       "  'Mostar International Airport',\n",
       "  'Yenbo - Prince Abdul Mohsin Bin Airport',\n",
       "  'Pietermaritzburg Airport',\n",
       "  'Fukuoka Airport',\n",
       "  'Kavieng Airport',\n",
       "  'Ormoc Airport',\n",
       "  'Juba International Airport',\n",
       "  'Tokyo Narita',\n",
       "  'Maniitsoq Airport',\n",
       "  'Luena Airport',\n",
       "  'Southwest Florida International Airport',\n",
       "  'Northwest Alabama Regional Airport',\n",
       "  'Chautauqua County-Jamestown Airport',\n",
       "  'Powell River Airport',\n",
       "  'Brno-Tuřany Airport',\n",
       "  'Long Beach Airport',\n",
       "  'El Tari Airport',\n",
       "  'Newark, Liberty',\n",
       "  'Kharkiv International Airport',\n",
       "  'Gustavo Vargas Airport',\n",
       "  'Monastir Habib Bourguiba International Airport',\n",
       "  'Jackson-Medgar Wiley Evers International Airport',\n",
       "  'Fairbanks International Airport',\n",
       "  'Atyrau Airport',\n",
       "  'Belfast International Airport',\n",
       "  \"St. John's International Airport\",\n",
       "  'Hyderabad, Rajiv Gandhi International Airport',\n",
       "  'Qurghonteppa International Airport',\n",
       "  'Southampton Airport',\n",
       "  'St Michael Airport',\n",
       "  'Siem Reap International Airport',\n",
       "  'Moruya Airport',\n",
       "  'Ernesto Cortissoz International Airport',\n",
       "  'Timişoara Traian Vuia Airport',\n",
       "  'Guillermo León Valencia Airport',\n",
       "  'Paulatuk (Nora Aliqatchialuk Ruben) Airport',\n",
       "  'Takamatsu Airport',\n",
       "  'Eek Airport',\n",
       "  'Leros Airport',\n",
       "  'Juan Gualberto Gomez International Airport',\n",
       "  'Aktobe Airport',\n",
       "  'General Urquiza Airport',\n",
       "  'Coari Airport',\n",
       "  'Asheville Regional Airport',\n",
       "  'Devils Lake Regional Airport',\n",
       "  'Calvi-Sainte-Catherine Airport',\n",
       "  'Funchal, Madeira Airport',\n",
       "  'Douala International Airport',\n",
       "  'Bodaybo Airport',\n",
       "  'Malatya Erhaç Airport',\n",
       "  'Las Américas International Airport',\n",
       "  'Erzurum International Airport',\n",
       "  'Bharatpur Airport',\n",
       "  'San Luis Airport',\n",
       "  'Baie Comeau Airport',\n",
       "  'Mundo Maya International Airport',\n",
       "  'Invercargill Airport',\n",
       "  'Maio Airport',\n",
       "  'Napakiak Airport',\n",
       "  'Bastia-Poretta Airport',\n",
       "  'Bolzano Airport',\n",
       "  'Masset Airport',\n",
       "  'Gachsaran Airport',\n",
       "  \"Bao'anying Airport\",\n",
       "  'Comandante Espora Airport',\n",
       "  'Conakry Airport',\n",
       "  'Buon Ma Thuot Airport',\n",
       "  'City of Derry Airport',\n",
       "  'Cardiff International Airport',\n",
       "  'El Yopal Airport',\n",
       "  'Ban Huoeisay Airport',\n",
       "  'Logroño-Agoncillo Airport',\n",
       "  'Casa De Campo International Airport',\n",
       "  'Vunisea Airport',\n",
       "  'Provincetown Municipal Airport',\n",
       "  'Minto Al Wright Airport',\n",
       "  'Ignatyevo Airport',\n",
       "  'Puerto Jimenez Airport',\n",
       "  'Sanikiluaq Airport',\n",
       "  'Ljubljana Jože Pučnik Airport',\n",
       "  'Flagstaff Pulliam Airport',\n",
       "  'Augsburg Airport',\n",
       "  'Mombasa Moi International Airport',\n",
       "  'Tan Tan Airport',\n",
       "  'Kaitaia Airport',\n",
       "  'Desierto de Atacama Airport',\n",
       "  'Tulsa International Airport',\n",
       "  'Pakse International Airport',\n",
       "  'San Javier Airport',\n",
       "  'La Isabela International Airport',\n",
       "  'Pocatello Regional Airport',\n",
       "  'Learmonth Airport',\n",
       "  'Lübeck Blankensee Airport',\n",
       "  'High Level Airport',\n",
       "  'Gerrard Smith International Airport',\n",
       "  'Pointe Vele Airport',\n",
       "  'Philip S. W. Goldson International Airport',\n",
       "  'Dimapur Airport',\n",
       "  'Ua Huka Airport',\n",
       "  'Kwethluk Airport',\n",
       "  'Frankfurt am Main',\n",
       "  'Dickinson Theodore Roosevelt Regional Airport',\n",
       "  'Sirri Island Airport',\n",
       "  'Brindisi – Salento Airport',\n",
       "  \"Arthur's Town Airport\",\n",
       "  'Gustavus Airport',\n",
       "  'Eugenio Maria De Hostos Airport',\n",
       "  'Atlas Brasil Cantanhede Airport',\n",
       "  'Algiers, Houari Boumediene Airport',\n",
       "  'Borg El Arab International Airport',\n",
       "  'Mecheria Airport',\n",
       "  'Dakhla Airport',\n",
       "  'Alberto Carnevalli Airport',\n",
       "  'Wanxian Airport',\n",
       "  'Plovdiv International Airport',\n",
       "  'Noumérat - Moufdi Zakaria Airport',\n",
       "  'Havre City County Airport',\n",
       "  'Qinhuangdao Beidaihe Airport',\n",
       "  'Stella Maris Airport',\n",
       "  'Quetta International Airport',\n",
       "  'Praslin Airport',\n",
       "  'Yingkou Lanqi Airport',\n",
       "  'Libo Airport',\n",
       "  'Akulivik Airport',\n",
       "  'Cabo Frio Airport',\n",
       "  'Woodbourne Airport',\n",
       "  'Yelizovo Airport',\n",
       "  'Attawapiskat Airport',\n",
       "  'Zemunik Airport',\n",
       "  'Wajir Airport',\n",
       "  'Lahad Datu Airport',\n",
       "  'Maumere(Wai Oti) Airport',\n",
       "  \"Val-d'Or Airport\",\n",
       "  'Olsztyn-Mazury Airport',\n",
       "  'Lien Khuong Airport',\n",
       "  'Lanseria Airport',\n",
       "  'Birdsville Airport',\n",
       "  'Manhattan Regional Airport',\n",
       "  'Guararapes - Gilberto Freyre International Airport',\n",
       "  'Kos Airport',\n",
       "  \"Xi'an Xianyang International Airport\",\n",
       "  'Tachileik Airport',\n",
       "  'Roswell International Air Center Airport',\n",
       "  'Akiak Airport',\n",
       "  'Mauke Airport',\n",
       "  'Monterey Peninsula Airport',\n",
       "  'Dundee Airport',\n",
       "  'Chokurdakh Airport',\n",
       "  'Kiev Zhuliany International Airport',\n",
       "  'Pavlodar Airport',\n",
       "  'Malvinas Argentinas Airport',\n",
       "  'Ulukhaktok Holman Airport',\n",
       "  'Kruger Mpumalanga International Airport',\n",
       "  'Esfahan Shahid Beheshti International Airport',\n",
       "  'Raipur Airport',\n",
       "  'Bacolod-Silay City International Airport',\n",
       "  'Bauru - Arealva Airport',\n",
       "  'Stockholm-Bromma Airport',\n",
       "  'Moranbah Airport',\n",
       "  'Tucson International Airport',\n",
       "  'Corumbá International Airport',\n",
       "  'Dehradun Airport',\n",
       "  'El Alto International Airport',\n",
       "  'Birmingham-Shuttlesworth International Airport',\n",
       "  'Licenciado Manuel Crescencio Rejon Int Airport',\n",
       "  'La Fria Airport',\n",
       "  'Dzhezkazgan Airport',\n",
       "  'Tagbilaran Airport',\n",
       "  'Capitan FAP Jose A Quinones Gonzales International Airport',\n",
       "  'South Bend Regional Airport',\n",
       "  'Limnos Airport',\n",
       "  'Saidpur Airport',\n",
       "  'Ulanqab Airport',\n",
       "  'Podgorica Airport',\n",
       "  'Piedras Negras International Airport',\n",
       "  'George Town, Exuma International Airport',\n",
       "  'Ralph Wien Memorial Airport',\n",
       "  'John A. Osborne Airport',\n",
       "  'Merimbula Airport',\n",
       "  'Marseille Provence Airport',\n",
       "  'Savonlinna Airport',\n",
       "  'Levelock Airport',\n",
       "  'Khrabrovo Airport',\n",
       "  'Irkutsk Airport',\n",
       "  'Santa Maria Airport',\n",
       "  'Yakima Air Terminal McAllister Field',\n",
       "  'Jiayuguan Airport',\n",
       "  'Cheyenne Regional Jerry Olson Field',\n",
       "  'Yeosu Airport',\n",
       "  'Puerto Rico, Luis Munoz International Airport',\n",
       "  'Luoyang Airport',\n",
       "  'Resistencia International Airport',\n",
       "  'Warri Airport',\n",
       "  'Gisborne Airport',\n",
       "  'Del Bajio International Airport',\n",
       "  'Macaé Airport',\n",
       "  'Togiak Airport',\n",
       "  'Bologna Guglielmo Marconi Airport',\n",
       "  'Fort Smith Regional Airport',\n",
       "  'Melville Hall Airport',\n",
       "  'London City Airport',\n",
       "  'Trieste–Friuli Venezia Giulia Airport',\n",
       "  'Ceduna Airport',\n",
       "  'Bardufoss Airport',\n",
       "  'Launceston Airport',\n",
       "  'Kazi Nazrul Islam Airport',\n",
       "  'St Petersburg Clearwater International Airport',\n",
       "  'Mahshahr Airport',\n",
       "  'Pakuba Airport',\n",
       "  'Sentani Airport',\n",
       "  'Adirondack Regional Airport',\n",
       "  'Abakan Airport',\n",
       "  'North Central West Virginia Airport',\n",
       "  'Beirut Rafic Hariri International Airport',\n",
       "  'Meixian Airport',\n",
       "  'Gillette Campbell County Airport',\n",
       "  'Shire Inda Selassie Airport',\n",
       "  \"Cox's Bazar Airport\",\n",
       "  'Mazar I Sharif Airport',\n",
       "  'Sevilla Airport',\n",
       "  'Port Bouet Airport',\n",
       "  'Tamworth Airport',\n",
       "  'Mário de Almeida Franco Airport',\n",
       "  'Missoula International Airport',\n",
       "  'Stockholm Skavsta Airport',\n",
       "  'Xinyuan Nalati Airport',\n",
       "  'Gonder Airport',\n",
       "  'Edward G. Pitka Sr Airport',\n",
       "  'Fiji, Nadi International Airport',\n",
       "  'Ayers Rock Connellan Airport',\n",
       "  'Ogden Hinckley Airport',\n",
       "  'Hengyang Airport',\n",
       "  'Tingo Maria Airport',\n",
       "  'Teniente Julio Gallardo Airport',\n",
       "  'Middle Georgia Regional Airport',\n",
       "  'Gaua Island Airport',\n",
       "  'Araracuara Airport',\n",
       "  'Vladivostok International Airport',\n",
       "  'Bachigualato Federal International Airport',\n",
       "  'Sultan Ismail Petra Airport',\n",
       "  'Haifa International Airport',\n",
       "  'Mt. Fuji Shizuoka Airport',\n",
       "  \"Dillon's Bay Airport\",\n",
       "  'St. Thomas, Cyril E. King Airport',\n",
       "  'Minsk International Airport',\n",
       "  'Amado Nervo National Airport',\n",
       "  'Trail Airport',\n",
       "  'Saratov Central Airport',\n",
       "  'Anvik Airport',\n",
       "  'Sept-Îles Airport',\n",
       "  'Chelyabinsk Balandino Airport',\n",
       "  'Quincy Regional Baldwin Field',\n",
       "  'Bingöl Çeltiksuyu Airport',\n",
       "  'Seattle-Tacoma',\n",
       "  'Tiksi Airport',\n",
       "  'Hancock County-Bar Harbor Airport',\n",
       "  'Sultan Mahmud Airport',\n",
       "  'Dhangarhi Airport',\n",
       "  'University of Illinois Willard Airport',\n",
       "  'Coronel FAP Carlos Ciriani Santa Rosa International Airport',\n",
       "  \"L'Espérance Airport\",\n",
       "  'Salamanca Airport',\n",
       "  'Kirensk Airport',\n",
       "  'Napier Airport',\n",
       "  'Trenton Mercer Airport',\n",
       "  'Montréal / Saint-Hubert Airport',\n",
       "  'Linköping City Airport',\n",
       "  'Carriel Sur Airport',\n",
       "  \"Sana'a International Airport\",\n",
       "  'Boende Airport',\n",
       "  'Thompson Airport',\n",
       "  'Mudanjiang Hailang International Airport',\n",
       "  'Tongoa Airport',\n",
       "  'Khanty Mansiysk Airport',\n",
       "  'Casper-Natrona County International Airport',\n",
       "  'Lorient South Brittany (Bretagne Sud) Airport',\n",
       "  'Coral Harbour Airport',\n",
       "  'Garden City Regional Airport',\n",
       "  'Tabubil Airport',\n",
       "  'Richards Bay Airport',\n",
       "  'Francisco Bangoy International Airport',\n",
       "  'Harstad/Narvik Airport, Evenes',\n",
       "  'Khovd Airport',\n",
       "  'Malabo Airport',\n",
       "  'Milas Bodrum International Airport',\n",
       "  'La Tontouta International Airport',\n",
       "  'Santa Barbara Municipal Airport',\n",
       "  'Lethbridge County Airport',\n",
       "  'Mbeya Airport',\n",
       "  'Leirin Airport',\n",
       "  'Skardu Airport',\n",
       "  'Delta County Airport',\n",
       "  'Port Menier Airport',\n",
       "  'Košice Airport',\n",
       "  'Vilo Acuña International Airport',\n",
       "  'Fuzhou Changle International Airport',\n",
       "  'Yampa Valley Airport',\n",
       "  'Tenerife Norte Airport',\n",
       "  'Egilsstaðir Airport',\n",
       "  'Port Hardy Airport',\n",
       "  'Adana Airport',\n",
       "  'Uytash Airport',\n",
       "  'Gimpo International Airport',\n",
       "  'Comox Airport',\n",
       "  'Usinsk Airport',\n",
       "  'Bryansk Airport',\n",
       "  'Pisa International Airport',\n",
       "  'Tainan Airport',\n",
       "  'Imam Khomeini International Airport',\n",
       "  'Gove Airport',\n",
       "  'Tallinn Airport',\n",
       "  'General Rodolfo Sánchez Taboada International Airport',\n",
       "  'Tianshui Maijishan Airport',\n",
       "  'Tartu Airport',\n",
       "  'Moss Airport, Rygge',\n",
       "  'Jackson Hole Airport',\n",
       "  'Majeed Bin Abdulaziz Airport',\n",
       "  'Ibiza Airport',\n",
       "  'Van Ferit Melen Airport',\n",
       "  'Hamilton International Airport',\n",
       "  'Kasos Airport',\n",
       "  'Baotou Airport',\n",
       "  'Perpignan-Rivesaltes (Llabanère) Airport',\n",
       "  'Mumbai, Chhatrapati Shivaji International Airport',\n",
       "  'Catarman National Airport',\n",
       "  'Diomício Freitas Airport',\n",
       "  'Santander Airport',\n",
       "  'Chimoio Airport',\n",
       "  'Lamap Airport',\n",
       "  'Burgas Airport',\n",
       "  'Talagi Airport',\n",
       "  'Jacksonville International Airport',\n",
       "  'Vernal Regional Airport',\n",
       "  'Southwest Georgia Regional Airport',\n",
       "  'Cadjehoun Airport',\n",
       "  'Gu-Lian Airport',\n",
       "  'Pilot Station Airport',\n",
       "  'Tiree Airport',\n",
       "  'Bahawalpur Airport',\n",
       "  'Placencia Airport',\n",
       "  'Satu Mare Airport',\n",
       "  'Hammerfest Airport',\n",
       "  'Chişinău International Airport',\n",
       "  'Rendani Airport',\n",
       "  'E. T. Joshua Airport',\n",
       "  'Larsen Bay Airport',\n",
       "  'Taoxian Airport',\n",
       "  'Marília Airport',\n",
       "  'Sheikh ul Alam Airport',\n",
       "  'Adıyaman Airport',\n",
       "  'Cibao International Airport',\n",
       "  'Merle K (Mudhole) Smith Airport',\n",
       "  'Dubrovnik Airport',\n",
       "  'Wekweètì Airport',\n",
       "  'Changde Airport',\n",
       "  'Shennongjia Hongping Airport',\n",
       "  'Dawadmi Domestic Airport',\n",
       "  'Banja Luka International Airport',\n",
       "  'Pulkovo Airport',\n",
       "  'Chu Lai International Airport',\n",
       "  'Ouzinkie Airport',\n",
       "  'Mukah Airport',\n",
       "  'Sabzevar National Airport',\n",
       "  'Los Alamos Airport',\n",
       "  'South Caicos Airport',\n",
       "  'Batman Airport',\n",
       "  'Aspen-Pitkin Co/Sardy Field',\n",
       "  'Buluh Tumbang (H A S Hanandjoeddin) Airport',\n",
       "  'Guemar Airport',\n",
       "  'Torres Airstrip',\n",
       "  'Entebbe International Airport',\n",
       "  'Xiangfan Airport',\n",
       "  'Chengdu Shuangliu International Airport',\n",
       "  'Kaadedhdhoo Airport',\n",
       "  'Wokal Field Glasgow International Airport',\n",
       "  'Xoxocotlán International Airport',\n",
       "  'Yakutat Airport',\n",
       "  'Saertu Airport',\n",
       "  'Split Airport',\n",
       "  'Halifax / Stanfield International Airport',\n",
       "  'Palm Springs International Airport',\n",
       "  'CFB Bagotville',\n",
       "  'Cape Town International Airport',\n",
       "  'Charleston Air Force Base-International Airport',\n",
       "  'Rampart Airport',\n",
       "  'Grand Forks International Airport',\n",
       "  'Cork Airport',\n",
       "  'Vilankulo Airport',\n",
       "  'Timmins/Victor M. Power',\n",
       "  'Springfield Branson National Airport',\n",
       "  'Mount Hagen Kagamuga Airport',\n",
       "  'Mandalay International Airport',\n",
       "  'Gabès Matmata International Airport',\n",
       "  'Kullu Manali Airport',\n",
       "  'Santa Rosa Airport',\n",
       "  'Phu Bai Airport',\n",
       "  'Rach Gia Airport',\n",
       "  'Kirkenes Airport, Høybuktmoen',\n",
       "  'East Midlands Airport',\n",
       "  'Presidente Castro Pinto International Airport',\n",
       "  'Nantucket Memorial Airport',\n",
       "  'Hail Regional Airport',\n",
       "  'Aktion National Airport',\n",
       "  'Sharurah Airport',\n",
       "  'Fuvahmulah Airport',\n",
       "  'Osh Airport',\n",
       "  'Vaasa Airport',\n",
       "  'Aratika Nord Airport',\n",
       "  'Luang Namtha Airport',\n",
       "  'Co Ong Airport',\n",
       "  'Congonhas Airport',\n",
       "  'Tri Cities Regional Tn Va Airport',\n",
       "  'Jeju International Airport',\n",
       "  'Puerto Lempira Airport',\n",
       "  'Kars Airport',\n",
       "  'Jorge E. Gonzalez Torres Airport',\n",
       "  'Longana Airport',\n",
       "  'Rio Grande Airport',\n",
       "  'Suceava Stefan cel Mare Airport',\n",
       "  'Alta Airport',\n",
       "  'Nanyang Airport',\n",
       "  'Lar Airport',\n",
       "  'Bettles Airport',\n",
       "  'Tapuruquara Airport',\n",
       "  'Angads Airport',\n",
       "  'Auckland International Airport',\n",
       "  'Hangzhou Xiaoshan International Airport',\n",
       "  'Akwa Ibom International Airport',\n",
       "  'Heraklion International Nikos Kazantzakis Airport',\n",
       "  'Mangaia Island Airport',\n",
       "  'Fresno Yosemite International Airport',\n",
       "  'Coen Airport',\n",
       "  'Can Tho International Airport',\n",
       "  'Hang Nadim International Airport',\n",
       "  'Zurich-Kloten Airport',\n",
       "  'Montrose Regional Airport',\n",
       "  'Taichung Ching Chuang Kang Airport',\n",
       "  'Santa Maria Airport',\n",
       "  'Greater Moncton International Airport',\n",
       "  'Greater Rochester International Airport',\n",
       "  'Kadhdhoo Airport',\n",
       "  'Tromsø Airport',\n",
       "  'Shonai Airport',\n",
       "  'Oslo Gardermoen Airport',\n",
       "  'Campbell River Airport',\n",
       "  'Lourdes de Blanc Sablon Airport',\n",
       "  'Kristianstad Airport',\n",
       "  'Barau(Kalimaru) Airport',\n",
       "  'Thule Air Base',\n",
       "  'Taloyoak Airport',\n",
       "  'Sadiq Abubakar III International Airport',\n",
       "  'Nnamdi Azikiwe International Airport',\n",
       "  'Guyuan Liupanshan Airport',\n",
       "  'Bandar Lengeh Airport',\n",
       "  'Jingdezhen Airport',\n",
       "  'German Olano Airport',\n",
       "  'Aksu Airport',\n",
       "  'Stagen Airport',\n",
       "  'Chapecó Airport',\n",
       "  'Tarbes-Lourdes-Pyrénées Airport',\n",
       "  'Mexico City, Licenciado Benito Juarez International Airport',\n",
       "  'Ghadames East Airport',\n",
       "  'Kansas City International Airport',\n",
       "  'Kopitnari Airport',\n",
       "  'John Murtha Johnstown Cambria County Airport',\n",
       "  'JAGS McCartney International Airport',\n",
       "  'Lyon Saint-Exupery Airport',\n",
       "  'Tri Cities Airport',\n",
       "  'Shigatse Peace Airport',\n",
       "  'Tjilik Riwut Airport',\n",
       "  'Pdte. Carlos Ibañez del Campo Airport',\n",
       "  'Tazadit Airport',\n",
       "  'Texarkana Regional Webb Field',\n",
       "  'Mayaguana Airport',\n",
       "  'Russian Mission Airport',\n",
       "  'Kamishly Airport',\n",
       "  'Papa Westray Airport',\n",
       "  'Harlingen, Valley International Airport',\n",
       "  'Abeid Amani Karume International Airport',\n",
       "  'Shikezi Huayuan Airport',\n",
       "  'Al Maktoum International Airport',\n",
       "  'Charlottesville Albemarle Airport',\n",
       "  'Ras Al Khaimah International Airport',\n",
       "  'Castlegar/West Kootenay Regional Airport',\n",
       "  'Vadsø Airport',\n",
       "  'Grenoble Alpes-Isère Airport',\n",
       "  'General Bartolome Salom International Airport',\n",
       "  'Abha Regional Airport',\n",
       "  'Mopah Airport',\n",
       "  'Falcone–Borsellino Airport',\n",
       "  'Presidente Nicolau Lobato International Airport',\n",
       "  'Josefa Camejo International Airport',\n",
       "  'General Servando Canales International Airport',\n",
       "  'Chicago Midway International Airport',\n",
       "  'Ordu Giresun Airport',\n",
       "  'Christmas Island Airport',\n",
       "  'Goulimime Airport',\n",
       "  'King Island Airport',\n",
       "  'Sierra Maestra Airport',\n",
       "  'Myeik Airport',\n",
       "  'Niederrhein Airport',\n",
       "  'Muan International Airport',\n",
       "  'São Gabriel da Cachoeira Airport',\n",
       "  'Hodeidah International Airport',\n",
       "  'Arnold Palmer Regional Airport',\n",
       "  'Port Heiden Airport',\n",
       "  'Oshima Airport',\n",
       "  'University Park Airport',\n",
       "  'Yulin Airport',\n",
       "  'Fuyang Xiguan Airport',\n",
       "  'Phu Quoc Airport',\n",
       "  'Santiago de Compostela Airport',\n",
       "  'Melbourne Essendon Airport',\n",
       "  'Erbil International Airport',\n",
       "  'Viru Viru International Airport',\n",
       "  'Regina International Airport',\n",
       "  'Bedourie Airport',\n",
       "  'Dipolog Airport',\n",
       "  'Quatro de Fevereiro Airport',\n",
       "  'Weifang Airport',\n",
       "  'Trondheim Airport, Værnes',\n",
       "  'Turaif Domestic Airport',\n",
       "  'Macau International Airport',\n",
       "  'False Pass Airport',\n",
       "  'Henri Coanda International Airport',\n",
       "  'Sara Airport',\n",
       "  'Rio de Janeiro ,Galeao Antonio Carlos Jobim International Airport',\n",
       "  'Ireland West Knock Airport',\n",
       "  'Sohag International Airport',\n",
       "  'San Cristóbal Airport',\n",
       "  'Tianjin Binhai International Airport',\n",
       "  'Tallahassee Regional Airport',\n",
       "  'Reus Air Base',\n",
       "  'Orange Walk Airport',\n",
       "  'Chita-Kadala Airport',\n",
       "  'Ashgabat Airport',\n",
       "  'Hartsfield - Jackson Atlanta International Airport',\n",
       "  'Madang Airport',\n",
       "  'Charlotte Douglas International Airport',\n",
       "  'Tweed New Haven Airport',\n",
       "  'Buenos Aires, Ministro Pistarini International Airport',\n",
       "  'L M Clayton Airport',\n",
       "  'Tacheng Airport',\n",
       "  'Guangyuan Airport',\n",
       "  'Paris Beauvais Tillé Airport',\n",
       "  'Nagasaki Airport',\n",
       "  'Xilinhot Airport',\n",
       "  'Menara Airport',\n",
       "  'Badajoz Airport',\n",
       "  'Pensacola Regional Airport',\n",
       "  'Gainesville Regional Airport',\n",
       "  'Laoag International Airport',\n",
       "  'The Pas Airport',\n",
       "  'Bojnord Airport',\n",
       "  'Alashankou Bole (Bortala) airport',\n",
       "  'Sorong (Jefman) Airport',\n",
       "  'Mbandaka Airport',\n",
       "  'Nantong Airport',\n",
       "  'Tirana International Airport Mother Teresa',\n",
       "  'Balıkesir Körfez Airport',\n",
       "  'Charlo Airport',\n",
       "  'Suvarnabhumi Bangkok International Airport',\n",
       "  'Tavie Airport',\n",
       "  'Sfax Thyna International Airport',\n",
       "  'Huatugou Airport',\n",
       "  'Bremen Airport',\n",
       "  'Kimmirut Airport',\n",
       "  'Richmond International Airport',\n",
       "  'Westerland Sylt Airport',\n",
       "  'St George Airport',\n",
       "  'Kitakyūshū Airport',\n",
       "  'Fort St John Airport',\n",
       "  'Ellisras Matimba Airport',\n",
       "  'Bucholz Army Air Field',\n",
       "  'Sand Point Airport',\n",
       "  'Genoa Cristoforo Colombo Airport',\n",
       "  'Ørsta-Volda Airport, Hovden',\n",
       "  'Barinas Airport',\n",
       "  'Tokachi-Obihiro Airport',\n",
       "  'Quepos Managua Airport',\n",
       "  'Arctic Village Airport',\n",
       "  'Hermanos Serdán International Airport',\n",
       "  'Saipan International Airport',\n",
       "  'Lampang Airport',\n",
       "  'Keewaywin Airport',\n",
       "  'Nairobi, Jomo Kenyatta International Airport',\n",
       "  'King Fahd International Airport',\n",
       "  'Dushanbe Airport',\n",
       "  'Nouadhibou International Airport',\n",
       "  'Bubung Airport',\n",
       "  'Amami Airport',\n",
       "  'Tabriz International Airport',\n",
       "  'Amsterdam Airport Schiphol',\n",
       "  'Gyumri Shirak Airport',\n",
       "  'Malta International Airport',\n",
       "  'Moshoeshoe I International Airport',\n",
       "  'Transilvania Târgu Mureş International Airport',\n",
       "  'Leonardo da Vinci-Fiumicino International Airport',\n",
       "  'Yamaguchi Ube Airport',\n",
       "  'Jorge Newbery Airpark',\n",
       "  'Narathiwat Airport',\n",
       "  'Horn Island Airport',\n",
       "  'Deer Lake Airport',\n",
       "  'Morondava Airport',\n",
       "  'Dimokritos Airport',\n",
       "  'Lilongwe International Airport',\n",
       "  'Christchurch International Airport',\n",
       "  'Jaipur International Airport',\n",
       "  'Hualien Airport',\n",
       "  'Tel Aviv, Ben Gurion International Airport',\n",
       "  'Kaukura Airport',\n",
       "  'Naryan Mar Airport',\n",
       "  'Waingapu Airport',\n",
       "  'Coronel FAP Francisco Secada Vignetta International Airport',\n",
       "  'Moree Airport',\n",
       "  'Sivas Airport',\n",
       "  'Rennes-Saint-Jacques Airport',\n",
       "  'Jose Joaquin de Olmedo International Airport',\n",
       "  'Savusavu Airport',\n",
       "  'Samos Airport',\n",
       "  'Manuel Márquez de León International Airport',\n",
       "  'Smithers Airport',\n",
       "  'Myrtle Beach International Airport',\n",
       "  'Tamarindo De Santa Cruz Airport',\n",
       "  'Dinard-Pleurtuit-Saint-Malo Airport',\n",
       "  'K. D. Matanzima Airport',\n",
       "  'Waterford Airport',\n",
       "  'Béchar Boudghene Ben Ali Lotfi Airport',\n",
       "  'Gassim/Prince Nayef bin Abdulaziz Regional Airport',\n",
       "  'Victoria Regional Airport',\n",
       "  'Toronto Pearson International Airport',\n",
       "  'Nadym Airport',\n",
       "  'Santiago Perez Airport',\n",
       "  'Herat Airport',\n",
       "  'Bangor International Airport',\n",
       "  'Gambella Airport',\n",
       "  'Chania International Airport',\n",
       "  'General Lucio Blanco International Airport',\n",
       "  'Alta Floresta Airport',\n",
       "  'Fort Worth Alliance Airport',\n",
       "  'Catania-Fontanarossa Airport',\n",
       "  'Örnsköldsvik Airport',\n",
       "  'Senai International Airport',\n",
       "  'Khabarovsk-Novy Airport',\n",
       "  'Manila, Ninoy Aquino International Airport',\n",
       "  'Linfen Qiaoli Airport',\n",
       "  'Dong Hoi Airport',\n",
       "  'Abraham Lincoln Capital Airport',\n",
       "  'Virac Airport',\n",
       "  'Clark International Airport',\n",
       "  'Soekarno-Hatta International Airport',\n",
       "  'Bartolomeu Lisandro Airport',\n",
       "  'Lima, Jorge Chavez International Airport',\n",
       "  'Grise Fiord Airport',\n",
       "  'Sainte Marie Airport',\n",
       "  'Caçador Airport',\n",
       "  'Port Gentil Airport',\n",
       "  'Austin Bergstrom International Airport',\n",
       "  'Kaltag Airport',\n",
       "  'Bemidji Regional Airport',\n",
       "  'Al Ain International Airport',\n",
       "  'Thessaloniki Macedonia International Airport',\n",
       "  'General Francisco J. Mujica International Airport',\n",
       "  'General Abelardo L. Rodríguez International Airport',\n",
       "  'Montgomery Regional (Dannelly Field) Airport',\n",
       "  'Sialkot Airport',\n",
       "  \"Nice-Cote d'Azur Airport\",\n",
       "  'Fort Yukon Airport',\n",
       "  'Quinhagak Airport',\n",
       "  'South Arkansas Regional At Goodwin Field',\n",
       "  'Rockhampton Airport',\n",
       "  'Da Nang International Airport',\n",
       "  'Ballina Byron Gateway Airport',\n",
       "  'Antonio Rivera Rodriguez Airport',\n",
       "  'Kingston, Norman Manley International Airport',\n",
       "  'Guarani International Airport',\n",
       "  'Abbotsford Airport',\n",
       "  'Nuku Hiva Airport',\n",
       "  'Dallas/Fort Worth International Airport',\n",
       "  'Goodnews Airport',\n",
       "  'Coober Pedy Airport',\n",
       "  'Kushiro Airport',\n",
       "  'Frank Pais International Airport',\n",
       "  'Süleyman Demirel International Airport',\n",
       "  'Porto Santo Airport',\n",
       "  'Ostend-Bruges International Airport',\n",
       "  'Terrace Airport',\n",
       "  'Mashhad International Airport',\n",
       "  'Rizhao Shanzihe Airport',\n",
       "  'Newquay Cornwall Airport',\n",
       "  'Zhengzhou Xinzheng International Airport',\n",
       "  'Sleetmute Airport',\n",
       "  'Zhuhai Airport',\n",
       "  'Pitt Greenville Airport',\n",
       "  'Katiu Airport',\n",
       "  'Ketchikan International Airport',\n",
       "  'Bayankhongor Airport',\n",
       "  'Lonorore Airport',\n",
       "  'Kédougou Airport',\n",
       "  'Nalchik Airport',\n",
       "  'Salt Lake City',\n",
       "  'Aupaluk Airport',\n",
       "  'Topeka Regional Airport - Forbes Field',\n",
       "  'Buffalo Niagara International Airport',\n",
       "  'Bosaso Airport',\n",
       "  'Mansa Airport',\n",
       "  'Roshchino International Airport',\n",
       "  'Tarko-Sale Airport',\n",
       "  'Syktyvkar Airport',\n",
       "  'Meadows Field',\n",
       "  'Makung Airport',\n",
       "  'Durango La Plata County Airport',\n",
       "  'Panama Pacific International Airport',\n",
       "  'Enrique Malek International Airport',\n",
       "  'Lea County Regional Airport',\n",
       "  'Ford Airport',\n",
       "  'Hosea Kutako International Airport',\n",
       "  'Kitale Airport',\n",
       "  'Wales Airport',\n",
       "  'Nakhon Si Thammarat Airport',\n",
       "  'Tokua Airport',\n",
       "  'Broome International Airport',\n",
       "  'Athens Ben Epps Airport',\n",
       "  'El Golea Airport',\n",
       "  'Léopold Sédar Senghor International Airport',\n",
       "  'Rum Cay Airport',\n",
       "  'Lynchburg Regional Preston Glenn Field',\n",
       "  'Saint John Airport',\n",
       "  'Waynesville-St. Robert Regional Forney field',\n",
       "  'Bob Baker Memorial Airport',\n",
       "  'Gode Airport',\n",
       "  'Sri Guru Ram Dass Jee International Airport',\n",
       "  'Itaituba Airport',\n",
       "  'Range Regional Airport',\n",
       "  'Zhoushan Airport',\n",
       "  'Campo Grande Airport',\n",
       "  'Owen Roberts International Airport',\n",
       "  'Ordos Ejin Horo Airport',\n",
       "  'Dillingham Airport',\n",
       "  'Haines Airport',\n",
       "  'Melilla Airport',\n",
       "  'Iloilo International Airport',\n",
       "  'Chubu Centrair International Airport',\n",
       "  'Larnaca International Airport',\n",
       "  'La Rochelle-Île de Ré Airport',\n",
       "  'Turin Airport',\n",
       "  'Sultan Azlan Shah Airport',\n",
       "  'Baoshan Yunduan Airport',\n",
       "  'Karlstad Airport',\n",
       "  'Sir Bani Yas Island Airport',\n",
       "  'Santorini Airport',\n",
       "  'Paros Airport',\n",
       "  'Honiara International Airport',\n",
       "  'Zona da Mata Regional Airport',\n",
       "  'Prof. Eribelto Manoel Reino State Airport',\n",
       "  'Kumasi Airport',\n",
       "  'Olympic Dam Airport',\n",
       "  'Turukhansk Airport',\n",
       "  'Noto Airport',\n",
       "  'Chingozi Airport',\n",
       "  'Birmingham International Airport',\n",
       "  'Orenburg Central Airport',\n",
       "  'Daocheng Yading Airport',\n",
       "  'Kuai, Lihue Airport',\n",
       "  'Lauro Kurtz Airport',\n",
       "  'Bethel Airport',\n",
       "  'Brigadier Antonio Parodi Airport',\n",
       "  'Wellington International Airport',\n",
       "  'Torsby Airport',\n",
       "  'Iskandar Airport',\n",
       "  'Port Lions Airport',\n",
       "  'Ufa International Airport',\n",
       "  'Bearskin Lake Airport',\n",
       "  'Port Harcourt International Airport',\n",
       "  'Eduardo Falla Solano Airport',\n",
       "  'Cambridge Bay Airport',\n",
       "  'Sultan Thaha Airport',\n",
       "  'Ciudad Obregón International Airport',\n",
       "  'Central Nebraska Regional Airport',\n",
       "  'Mannheim-City Airport',\n",
       "  'V.C. Bird International Airport',\n",
       "  'Jamestown Regional Airport',\n",
       "  'Chuuk International Airport',\n",
       "  'Szczecin-Goleniów Solidarność Airport',\n",
       "  'Yiershi Airport',\n",
       "  'Jyvaskyla Airport',\n",
       "  'Ciampino–G. B. Pastine International Airport',\n",
       "  'Hilton Head Airport',\n",
       "  'Luxembourg-Findel International Airport',\n",
       "  'Bou Chekif Airport',\n",
       "  'Agen-La Garenne Airport',\n",
       "  'Ulaangom Airport',\n",
       "  'Campbeltown Airport',\n",
       "  'Yuncheng Guangong Airport',\n",
       "  'Joplin Regional Airport',\n",
       "  'Gerardo Tobar López Airport',\n",
       "  'Wuhai Airport',\n",
       "  'LTS Pulau Redang Airport',\n",
       "  'General Pedro Jose Mendez International Airport',\n",
       "  'Imperial County Airport',\n",
       "  'Easterwood Field',\n",
       "  'Rhodes, Diagoras Airport',\n",
       "  'Mallam Aminu International Airport',\n",
       "  'Iwakuni Marine Corps Air Station',\n",
       "  'Matei Airport',\n",
       "  'St. Anthony Airport',\n",
       "  'Winnipeg / James Armstrong Richardson International Airport',\n",
       "  'Catamarca Airport',\n",
       "  'Phnom Penh International Airport',\n",
       "  'Kooddoo Airport',\n",
       "  'Augusta Regional At Bush Field',\n",
       "  'Sheldon Point Airport',\n",
       "  'Drake Bay Airport',\n",
       "  'Alexander the Great International Airport',\n",
       "  'EuroAirport Basle-Mulhouse-Freiburg Airport',\n",
       "  'Kunming Wujiaba International Airport',\n",
       "  'Chippewa Valley Regional Airport',\n",
       "  'Blackpool International Airport',\n",
       "  'Ministro Victor Konder International Airport',\n",
       "  'Sharm El Sheikh International Airport',\n",
       "  'San Luis County Regional Airport',\n",
       "  'Oakland',\n",
       "  'Churchill Falls Airport',\n",
       "  'Belgrade Nikola Tesla Airport',\n",
       "  'Whyalla Airport',\n",
       "  'Rochester International Airport',\n",
       "  'Mariscal Sucre International Airport',\n",
       "  'Bonaire, Flamingo International Airport',\n",
       "  'Kosrae International Airport',\n",
       "  'Four Corners Regional Airport',\n",
       "  'Wainwright Airport',\n",
       "  'Kulob Airport',\n",
       "  'Idaho Falls Regional Airport',\n",
       "  'Wagga Wagga City Airport',\n",
       "  'Toussaint Louverture International Airport',\n",
       "  'Zenata – Messali El Hadj Airport',\n",
       "  'Cotopaxi International Airport',\n",
       "  'Dublin International Airport',\n",
       "  'New Bedford Regional Airport',\n",
       "  'Toledo Express Airport',\n",
       "  \"Hassi R'Mel Airport\",\n",
       "  'Termez Airport',\n",
       "  'Hubli Airport',\n",
       "  'Golmud Airport',\n",
       "  'Stronsay Airport',\n",
       "  'Montevideo, Carrasco International /General C L Berisso Airport',\n",
       "  'Rurenabaque Airport',\n",
       "  'Batna Airport',\n",
       "  'Dezful Airport',\n",
       "  'Sardar Vallabhbhai Patel International Airport',\n",
       "  'Hooper Bay Airport',\n",
       "  'Funafuti International Airport',\n",
       "  'Evansville Regional Airport',\n",
       "  'Muscat International Airport',\n",
       "  'Ipota Airport',\n",
       "  'São Pedro Airport',\n",
       "  \"Martha's Vineyard Airport\",\n",
       "  'Camilo Daza International Airport',\n",
       "  'Antonio B. Won Pat International Airport',\n",
       "  'Dryden Regional Airport',\n",
       "  'Rondonópolis Airport',\n",
       "  'Marau Airport',\n",
       "  'Eday Airport',\n",
       "  'Marechal Rondon Airport',\n",
       "  'Mendi Airport',\n",
       "  'Maestro Wilson Fonseca Airport',\n",
       "  'Altoona Blair County Airport',\n",
       "  'Almirante Padilla Airport',\n",
       "  'Greenville Spartanburg International Airport',\n",
       "  'Diyarbakir Airport',\n",
       "  'Charlottetown Airport',\n",
       "  'Ukhta Airport',\n",
       "  'General E. Mosconi Airport',\n",
       "  'Skiros Airport',\n",
       "  'Momote Airport',\n",
       "  'Stevens Village Airport',\n",
       "  'Mehrabad International Airport',\n",
       "  'Silver Creek Airport',\n",
       "  'Aomori Airport',\n",
       "  'Kufra Airport',\n",
       "  'Mo i Rana Airport, Røssvoll',\n",
       "  'Qamdo Bangda Airport',\n",
       "  'Hanimaadhoo Airport',\n",
       "  'Gladstone Airport',\n",
       "  'Shageluk Airport',\n",
       "  'Skellefteå Airport',\n",
       "  'Hachijojima Airport',\n",
       "  'London Southend Airport',\n",
       "  'Naha Airport',\n",
       "  'Jiuhuashan Airport',\n",
       "  'Kisumu Airport',\n",
       "  'Cabinda Airport',\n",
       "  'Goose Bay Airport',\n",
       "  'Boise Air Terminal/Gowen field',\n",
       "  'Kuujjuaq Airport',\n",
       "  'La Tabatière Airport',\n",
       "  'Kyzyl Airport',\n",
       "  'Lijiang Airport',\n",
       "  'Patos de Minas Airport',\n",
       "  'Bintulu Airport',\n",
       "  'Niagara Falls International Airport',\n",
       "  'Lokichoggio Airport',\n",
       "  'Birsa Munda Airport',\n",
       "  'Karamay Airport',\n",
       "  'Komodo (Mutiara II) Airport',\n",
       "  'Gwadar International Airport',\n",
       "  'Francisco B. Reyes Airport',\n",
       "  'Martin Miguel De Guemes International Airport',\n",
       "  'Providence, Theodore Francis Green State Airport',\n",
       "  'Francisco Sarabia International Airport',\n",
       "  'Arar Domestic Airport',\n",
       "  'Hechi Jin Cheng Jiang Airport',\n",
       "  'Elazığ Airport',\n",
       "  'Corvo Airport',\n",
       "  'Taupo Airport',\n",
       "  'Las Vegas Mc Carran',\n",
       "  'Nevşehir Kapadokya International Airport',\n",
       "  'Sibulan Airport',\n",
       "  'Saniat Rmel Airport',\n",
       "  'Dongshan Airport',\n",
       "  'Altamira Airport',\n",
       "  'Domingo Faustino Sarmiento Airport',\n",
       "  'Kalmar Airport',\n",
       "  'Bol Airport',\n",
       "  'Hugo Cantergiani Regional Airport',\n",
       "  'Eilat Airport',\n",
       "  'Wemindji Airport',\n",
       "  'Nakhchivan Airport',\n",
       "  'Tari Airport',\n",
       "  'Rankin Inlet Airport',\n",
       "  'Kandahar Airport',\n",
       "  ...]}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().group().by(T.label).by('desc').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Runways grouped by code__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'VHC': [1], 'NSN': [5], 'CIC': [2], 'SDU': [2], 'JOS': [1]}"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasLabel('airport').limit(5).group().by('code').by('runways').next()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
