{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 4. Gt, Lt, Between, Within, Mean, Dedup, Where, Neq, Limit, Range, Skip, Tail, TimeLimit\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import P\n",
    "from loader import __\n",
    "from loader import hkVertexId\n",
    "from loader import sydneyVertexId"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## gt(), lt()\n",
    "__Get destinations from HK that have more than 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'runways': [6], 'desc': ['Boston Logan']},\n",
       " {'runways': [7], 'desc': ['Dallas/Fort Worth International Airport']},\n",
       " {'runways': [8], 'desc': [\"Chicago O'Hare International Airport\"]},\n",
       " {'runways': [6], 'desc': ['Amsterdam Airport Schiphol']}]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).out('route').has('runways', P.gt(5)).valueMap('desc', 'runways').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## between()\n",
    "__Get destinations from HK that have 6 to 8 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'runways': [6], 'desc': ['Boston Logan']},\n",
       " {'runways': [7], 'desc': ['Dallas/Fort Worth International Airport']},\n",
       " {'runways': [6], 'desc': ['Amsterdam Airport Schiphol']}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).out('route').has('runways', P.between(6, 8)).valueMap('desc', 'runways').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## within()\n",
    "__Count of vertices that are within region \"AU-NSW\" and \"AU-VIC\"__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Orange Airport',\n",
       " 'Moruya Airport',\n",
       " 'Merimbula Airport',\n",
       " 'Tamworth Airport',\n",
       " 'Melbourne Essendon Airport',\n",
       " 'Moree Airport',\n",
       " 'Ballina Byron Gateway Airport',\n",
       " 'Wagga Wagga City Airport',\n",
       " 'Sydney Kingsford Smith',\n",
       " 'Taree Airport',\n",
       " 'Newcastle Airport',\n",
       " 'Dubbo City Regional Airport',\n",
       " 'Warrnambool Airport',\n",
       " 'Parkes Airport',\n",
       " 'Grafton Airport',\n",
       " 'Armidale Airport',\n",
       " 'Bathurst Airport',\n",
       " 'Mildura Airport',\n",
       " 'Narrabri Airport',\n",
       " 'Broken Hill Airport',\n",
       " 'Sydney Bankstown Airport',\n",
       " 'Coffs Harbour Airport',\n",
       " 'Melbourne International Airport',\n",
       " 'Avalon Airport',\n",
       " 'Port Macquarie Airport',\n",
       " 'Griffith Airport',\n",
       " 'Lord Howe Island Airport',\n",
       " 'Narrandera Airport',\n",
       " 'Portland Airport',\n",
       " 'Albury Airport',\n",
       " 'Lismore Airport',\n",
       " 'Gold Coast Airport']"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('region', P.within('AU-NSW', 'AU-VIC')).values('desc').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## mean()\n",
    "\n",
    "__Get the mean between the number of runways of airports within regions \"AU-NSW\" and \"AU-VIC\"__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1.875"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('region', P.within('AU-NSW', 'AU-VIC')).values('runways').mean().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## dedup()\n",
    "\n",
    "__Get airports that have destinations the HK airport does, and remove duplicates__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Fort Lauderdale/Hollywood International Airport',\n",
       " 'Ronald Reagan Washington National Airport',\n",
       " 'Hartsfield - Jackson Atlanta International Airport',\n",
       " 'Palm Beach International Airport',\n",
       " 'Dallas/Fort Worth International Airport',\n",
       " 'Baltimore/Washington International Airport',\n",
       " 'Raleigh-Durham',\n",
       " 'Orlando International Airport',\n",
       " 'Seattle-Tacoma',\n",
       " 'Austin Bergstrom International Airport',\n",
       " 'San Francisco International Airport',\n",
       " 'Tampa International Airport',\n",
       " 'Washington Dulles International Airport',\n",
       " 'Norman Y. Mineta San Jose International Airport',\n",
       " 'Houston Hobby',\n",
       " 'Las Vegas Mc Carran',\n",
       " 'George Bush Intercontinental',\n",
       " 'Cleveland, Hopkins International Airport',\n",
       " 'Vancouver',\n",
       " 'New Orleans L. Armstrong',\n",
       " 'New York John F. Kennedy International Airport',\n",
       " 'Paris Charles de Gaulle',\n",
       " 'London Heathrow',\n",
       " 'Miami International Airport',\n",
       " 'Tokyo Narita',\n",
       " 'London Gatwick',\n",
       " \"Chicago O'Hare International Airport\",\n",
       " 'Dublin International Airport',\n",
       " 'San Diego Lindbergh',\n",
       " 'Beijing Capital International Airport',\n",
       " 'Long Beach Airport',\n",
       " 'Amsterdam Airport Schiphol',\n",
       " 'Denver International Airport',\n",
       " 'Barcelona International Airport',\n",
       " 'Newark, Liberty',\n",
       " 'Doha, Hamad International Airport',\n",
       " 'Ottawa Macdonald-Cartier International Airport',\n",
       " 'Oakland',\n",
       " 'Charlotte Douglas International Airport',\n",
       " 'Philadelphia International Airport',\n",
       " 'Southwest Florida International Airport',\n",
       " 'Detroit Metropolitan, Wayne County',\n",
       " 'Toronto Pearson International Airport',\n",
       " 'Frankfurt am Main',\n",
       " 'Aruba, Queen Beatrix International Airport',\n",
       " 'Dubai International Airport',\n",
       " 'Hong Kong - Chek Lap Kok International Airport',\n",
       " 'Copenhagen Kastrup Airport',\n",
       " 'Lambert St Louis International Airport',\n",
       " 'Leonardo da Vinci-Fiumicino International Airport',\n",
       " 'Adolfo Suarez Barajas Airport International Airport',\n",
       " 'Long Island Mac Arthur Airport',\n",
       " 'Munich International Airport',\n",
       " 'Halifax / Stanfield International Airport',\n",
       " 'Manchester Airport',\n",
       " 'Cologne Bonn Airport',\n",
       " 'Shannon Airport',\n",
       " 'Cancun International Airport',\n",
       " 'Dallas Love Field',\n",
       " 'Tel Aviv, Ben Gurion International Airport',\n",
       " 'Portland International Airport',\n",
       " 'Ataturk International Airport',\n",
       " 'El Salvador International Airport',\n",
       " 'Kansas City International Airport',\n",
       " 'Pointe-à-Pitre Le Raizet',\n",
       " 'Syracuse Hancock International Airport',\n",
       " 'Lisbon Portela Airport',\n",
       " 'El Dorado International Airport',\n",
       " 'Reykjavik, Keflavik International Airport',\n",
       " 'Bridgetown, Sir Grantley Adams International Airport',\n",
       " 'Charleston Air Force Base-International Airport',\n",
       " 'St. Thomas, Cyril E. King Airport',\n",
       " 'Montego Bay, Sangster International Airport',\n",
       " 'Las Américas International Airport',\n",
       " 'Toussaint Louverture International Airport',\n",
       " 'Norfolk International Airport',\n",
       " 'Jacksonville International Airport',\n",
       " 'Punta Cana International Airport',\n",
       " 'Columbus, Port Columbus International Airport',\n",
       " 'Sint Martin, Princess Juliana International Airport',\n",
       " 'Richmond International Airport',\n",
       " 'Rutland - Southern Vermont Regional Airport',\n",
       " 'Myrtle Beach International Airport',\n",
       " 'Tocumen International Airport',\n",
       " 'Savannah Hilton Head International Airport',\n",
       " 'Akron Canton Regional Airport',\n",
       " 'Cibao International Airport',\n",
       " 'Nantucket Memorial Airport',\n",
       " 'Augusta State Airport',\n",
       " \"Martha's Vineyard Airport\",\n",
       " 'Barnstable Municipal Boardman Polando Field',\n",
       " 'Lebanon Municipal Airport',\n",
       " 'Northern Maine Regional Airport at Presque Isle',\n",
       " 'Adirondack Regional Airport',\n",
       " 'Westchester County',\n",
       " 'Los Angeles International Airport',\n",
       " 'Nashville International Airport',\n",
       " 'New York La Guardia',\n",
       " 'Phoenix Sky Harbor International Airport',\n",
       " 'Puerto Rico, Luis Munoz International Airport',\n",
       " 'Minneapolis-St.Paul International Airport',\n",
       " 'Salt Lake City',\n",
       " 'Shanghai - Pudong International Airport',\n",
       " 'Zurich-Kloten Airport',\n",
       " 'Montreal / Pierre Elliott Trudeau International Airport',\n",
       " 'Oslo Gardermoen Airport',\n",
       " 'Mexico City, Licenciado Benito Juarez International Airport',\n",
       " 'Greater Rochester International Airport',\n",
       " 'Cincinnati Northern Kentucky International Airport',\n",
       " 'General Mitchell International Airport',\n",
       " 'Pittsburgh International Airport',\n",
       " 'Indianapolis International Airport',\n",
       " 'Dusseldorf International Airport',\n",
       " 'Nassau, Lynden Pindling International Airport',\n",
       " 'Chicago Midway International Airport',\n",
       " 'Harrisburg International Airport',\n",
       " 'Bermuda, L.F. Wade International International Airport',\n",
       " 'Buffalo Niagara International Airport',\n",
       " 'Albany International Airport',\n",
       " 'Providenciales Airport',\n",
       " 'João Paulo II Airport',\n",
       " 'Martinique Aimé Césaire International Airport',\n",
       " 'Atlantic City International Airport',\n",
       " 'Praia International Airport',\n",
       " 'Plattsburgh International Airport',\n",
       " 'Billy Bishop Toronto City Centre Airport',\n",
       " 'Provincetown Municipal Airport',\n",
       " 'Hancock County-Bar Harbor Airport',\n",
       " 'Knox County Regional Airport',\n",
       " 'Lajes Field',\n",
       " 'Boston Logan',\n",
       " 'Anchorage Ted Stevens',\n",
       " 'Honolulu International Airport',\n",
       " 'Orange County/Santa Ana, John Wayne',\n",
       " 'San Antonio',\n",
       " 'The Eastern Iowa Airport',\n",
       " 'Lima, Jorge Chavez International Airport',\n",
       " 'Tallahassee Regional Airport',\n",
       " 'Sydney Kingsford Smith',\n",
       " 'City of Colorado Springs Municipal Airport',\n",
       " 'Eppley Airfield',\n",
       " 'Little Rock, Bill and Hillary Clinton National Airport/Adams Field',\n",
       " 'Alexandria International Airport',\n",
       " 'Calgary International Airport',\n",
       " 'Rick Husband Amarillo International Airport',\n",
       " 'Wichita Mid Continent Airport',\n",
       " 'Brownsville South Padre Island International Airport',\n",
       " 'Palm Springs International Airport',\n",
       " 'James M Cox Dayton International Airport',\n",
       " 'Robert Gray  Army Air Field Airport',\n",
       " 'Daniel Oduber Quiros International Airport',\n",
       " 'Monroe Regional Airport',\n",
       " 'Mobile Regional Airport',\n",
       " 'Northwest Arkansas Regional Airport',\n",
       " 'Rio de Janeiro ,Galeao Antonio Carlos Jobim International Airport',\n",
       " 'Waco Regional Airport',\n",
       " 'San Jose, Juan Santamaria International Airport',\n",
       " 'Santiago, Comodoro Arturo Merino Benitez International Airport',\n",
       " 'Southeast Texas Regional Airport',\n",
       " 'General Mariano Escobedo International Airport',\n",
       " 'Evansville Regional Airport',\n",
       " 'Oaklahoma City, Will Rogers World Airport',\n",
       " 'Garden City Regional Airport',\n",
       " 'Ontario International Airport',\n",
       " 'Don Miguel Hidalgo Y Costilla International Airport',\n",
       " 'Grand Junction Regional Airport',\n",
       " 'Piedmont Triad International Airport',\n",
       " 'Louisville International Standiford Field',\n",
       " 'Joplin Regional Airport',\n",
       " 'Boise Air Terminal/Gowen field',\n",
       " 'Manhattan Regional Airport',\n",
       " 'General Rafael Buelna International Airport',\n",
       " 'Simon Bolivar International Airport',\n",
       " 'Hermanos Serdán International Airport',\n",
       " 'Ponciano Arriaga International Airport',\n",
       " 'McGhee Tyson Airport',\n",
       " 'Puerto Vallarta, Licenciado Gustavo Diaz Ordaz International Airport',\n",
       " 'Eagle County Regional Airport',\n",
       " 'Baton Rouge Metropolitan, Ryan Field',\n",
       " 'General Roberto Fierro Villalobos International Airport',\n",
       " 'Gulfport Biloxi International Airport',\n",
       " 'Mc Allen Miller International Airport',\n",
       " 'San Angelo Regional Mathis Field',\n",
       " 'Tyler Pounds Regional Airport',\n",
       " 'Key Field',\n",
       " 'Sacramento International Airport',\n",
       " 'Birmingham-Shuttlesworth International Airport',\n",
       " 'Rapid City Regional Airport',\n",
       " 'Shreveport Regional Airport',\n",
       " 'Santa Barbara Municipal Airport',\n",
       " 'Lubbock Preston Smith International Airport',\n",
       " 'Reno Taoe International Airport',\n",
       " 'Gallatin Field',\n",
       " 'Gunnison Crested Butte Regional Airport',\n",
       " 'Bradley International Airport',\n",
       " 'Billings Logan International Airport',\n",
       " 'Springfield Branson National Airport',\n",
       " 'Texarkana Regional Webb Field',\n",
       " 'Blue Grass Airport',\n",
       " 'Corpus Christi International Airport',\n",
       " 'Bismarck Municipal Airport',\n",
       " 'Montrose Regional Airport',\n",
       " 'Abilene Regional Airport',\n",
       " 'Central Illinois Regional Airport at Bloomington-Normal',\n",
       " 'Des Moines International Airport',\n",
       " 'Cozumel International Airport',\n",
       " 'Lovell Field',\n",
       " 'Columbia Regional Airport',\n",
       " 'Durango La Plata County Airport',\n",
       " 'Joe Foss Field Airport',\n",
       " 'Fort Wayne International Airport',\n",
       " 'East Texas Regional Airport',\n",
       " 'Central Nebraska Regional Airport',\n",
       " 'Greenville Spartanburg International Airport',\n",
       " 'Jackson-Medgar Wiley Evers International Airport',\n",
       " 'Lake Charles Regional Airport',\n",
       " 'Laredo International Airport',\n",
       " 'General Francisco J. Mujica International Airport',\n",
       " 'Querétaro Intercontinental Airport',\n",
       " 'Los Cabos International Airport',\n",
       " 'Abraham Lincoln Capital Airport',\n",
       " 'Eglin Air Force Base',\n",
       " 'Yampa Valley Airport',\n",
       " 'Spokane International Airport',\n",
       " 'Mariscal Sucre International Airport',\n",
       " 'Augusto C. Sandino (Managua) International Airport',\n",
       " 'Owen Roberts International Airport',\n",
       " 'Hattiesburg Laurel Regional Airport',\n",
       " 'Kona International At Keahole Airport',\n",
       " 'Mid Delta Regional Airport',\n",
       " 'Aspen-Pitkin Co/Sardy Field',\n",
       " 'Jackson Hole Airport',\n",
       " 'Cavern City Air Terminal',\n",
       " 'Stillwater Regional Airport',\n",
       " 'Clovis Municipal Airport',\n",
       " 'El Paso International Airport',\n",
       " 'Tucson International Airport',\n",
       " 'Santa Fe',\n",
       " 'Edmonton International Airport',\n",
       " 'Buenos Aires, Ministro Pistarini International Airport',\n",
       " 'Seoul, Incheon International Airport',\n",
       " 'Sao Paulo, Guarulhos - Governador Andras Franco Montoro International Airport',\n",
       " 'Abu Dhabi International Airport',\n",
       " 'Tulsa International Airport',\n",
       " 'Albuquerque International Sunport Airport',\n",
       " 'Memphis International Airport',\n",
       " 'Maui, Kahului Airport',\n",
       " 'Coxen Hole, Juan Manuel Galvez International Airport',\n",
       " 'Huntsville International Carl T Jones Field',\n",
       " 'Midland International Airport',\n",
       " 'General Wayne A. Downing Peoria International Airport',\n",
       " 'La Aurora Airport',\n",
       " 'Easterwood Field',\n",
       " 'Jesus Teran International Airport',\n",
       " 'Del Bajio International Airport',\n",
       " 'Philip S. W. Goldson International Airport',\n",
       " 'Columbia Metropolitan Airport',\n",
       " 'University of Illinois Willard Airport',\n",
       " 'Hector International Airport',\n",
       " 'Montgomery Regional (Dannelly Field) Airport',\n",
       " 'Fort Smith Regional Airport',\n",
       " 'Fresno Yosemite International Airport',\n",
       " 'Quad City International Airport',\n",
       " 'Gerald R. Ford International Airport',\n",
       " 'Lawton Fort Sill Regional Airport',\n",
       " 'Pensacola Regional Airport',\n",
       " 'Dane County Regional Truax Field',\n",
       " 'Lafayette Regional Airport',\n",
       " 'Francisco Sarabia International Airport',\n",
       " 'Sheppard Air Force Base-Wichita Falls Municipal Airport',\n",
       " 'General Leobardo C. Ruiz International Airport',\n",
       " 'Roswell International Air Center Airport',\n",
       " 'Licenciado Manuel Crescencio Rejon Int Airport',\n",
       " 'Sioux Gateway Col. Bud Day Field',\n",
       " 'Branson Airport',\n",
       " 'Cherry Capital Airport',\n",
       " 'Fairbanks International Airport',\n",
       " 'Tokyo Haneda International Airport',\n",
       " 'Taiwan Taoyuan International Airport',\n",
       " \"Shenzhen Bao'an International Airport\",\n",
       " 'Mahlon Sweet Field',\n",
       " 'Helena Regional Airport',\n",
       " 'Pullman Moscow Regional Airport',\n",
       " 'Victoria International Airport',\n",
       " 'Roberts Field',\n",
       " 'San Luis County Regional Airport',\n",
       " 'Great Falls International Airport',\n",
       " 'Xiamen Gaoqi International Airport',\n",
       " 'Bob Hope Airport',\n",
       " 'Yakima Air Terminal McAllister Field',\n",
       " 'Charles M. Schulz Sonoma County Airport',\n",
       " 'Glacier Park International Airport',\n",
       " 'Walla Walla Regional Airport',\n",
       " 'Pangborn Memorial Airport',\n",
       " 'Ketchikan International Airport',\n",
       " 'Kuai, Lihue Airport',\n",
       " 'Tri Cities Airport',\n",
       " 'Kelowna International Airport',\n",
       " 'Bellingham International Airport',\n",
       " 'Rogue Valley International Medford Airport',\n",
       " 'Missoula International Airport',\n",
       " 'Lewiston Nez Perce County Airport',\n",
       " 'Juneau International Airport',\n",
       " 'Helsinki Ventaa',\n",
       " 'Antonio B. Won Pat International Airport',\n",
       " 'Manila, Ninoy Aquino International Airport',\n",
       " 'Auckland International Airport',\n",
       " 'Berlin, Tegel International Airport',\n",
       " 'Kunming Wujiaba International Airport',\n",
       " 'Liuting Airport',\n",
       " 'Osaka, Kansai International Airport',\n",
       " 'Guangzhou Baiyun International Airport',\n",
       " \"Xi'an Xianyang International Airport\",\n",
       " 'Redding Municipal Airport',\n",
       " 'Wuhan Tianhe International Airport',\n",
       " 'Jack Mc Namara Field Airport',\n",
       " 'Chico Municipal Airport',\n",
       " 'Klamath Falls Airport',\n",
       " 'Modesto City Co-Harry Sham Field',\n",
       " 'Southwest Oregon Regional Airport',\n",
       " 'Friedman Memorial Airport',\n",
       " 'Singapore, Changi International Airport',\n",
       " 'Indira Gandhi International Airport',\n",
       " 'Fiji, Nadi International Airport',\n",
       " 'Chengdu Shuangliu International Airport',\n",
       " 'Hangzhou Xiaoshan International Airport',\n",
       " 'Monterey Peninsula Airport',\n",
       " 'Meadows Field',\n",
       " 'Arcata Airport',\n",
       " 'Mammoth Yosemite Airport',\n",
       " 'Brisbane International Airport',\n",
       " 'Saskatoon John G. Diefenbaker International Airport',\n",
       " 'Winnipeg / James Armstrong Richardson International Airport',\n",
       " 'Taoxian Airport',\n",
       " 'London Airport',\n",
       " 'Penticton Airport',\n",
       " 'Campbell River Airport',\n",
       " 'Regina International Airport',\n",
       " 'Kamloops Airport',\n",
       " 'Sandspit Airport',\n",
       " 'Zhengzhou Xinzheng International Airport',\n",
       " 'Trail Airport',\n",
       " 'Bella Coola Airport',\n",
       " 'Castlegar/West Kootenay Regional Airport',\n",
       " 'Dawson Creek Airport',\n",
       " 'Powell River Airport',\n",
       " 'Comox Airport',\n",
       " 'Cranbrook Airport',\n",
       " 'John C. Munro Hamilton International Airport',\n",
       " 'Nanaimo Airport',\n",
       " 'Williams Lake Airport',\n",
       " 'Terrace Airport',\n",
       " 'Anahim Lake Airport',\n",
       " 'Nanjing Lukou Airport',\n",
       " 'Chubu Centrair International Airport',\n",
       " 'Fort McMurray Airport',\n",
       " 'Fort St John Airport',\n",
       " 'Smithers Airport',\n",
       " 'Port Hardy Airport',\n",
       " 'Prince Rupert Airport',\n",
       " 'Quesnel Airport',\n",
       " 'Whitehorse / Erik Nielsen International Airport',\n",
       " 'Prince George Airport',\n",
       " 'Masset Airport',\n",
       " 'Cairo International Airport',\n",
       " 'Vienna International Airport',\n",
       " 'Johannesburg, OR Tambo International Airport',\n",
       " 'Belgrade Nikola Tesla Airport',\n",
       " 'Moscow, Sheremetyevo International Airport',\n",
       " 'Quebec Jean Lesage International Airport',\n",
       " 'Bergen Airport Flesland',\n",
       " 'Warsaw Chopin Airport',\n",
       " 'Geneva-Cointrin International Airport',\n",
       " 'Portland International Jetport Airport',\n",
       " 'Brussels Airport',\n",
       " 'Jose Marti International Airport',\n",
       " 'Curacao, Hato International Airport',\n",
       " \"Nice-Cote d'Azur Airport\",\n",
       " 'Heydar Aliyev International Airport',\n",
       " 'Mohammed V International Airport',\n",
       " 'Hewanorra International Airport',\n",
       " 'King Abdulaziz International Airport',\n",
       " 'V.C. Bird International Airport',\n",
       " 'Riyadh, King Khaled International Airport',\n",
       " 'Jose Joaquin de Olmedo International Airport',\n",
       " 'Gregorio Luperon International Airport',\n",
       " 'Kotoka International Airport',\n",
       " 'Léopold Sédar Senghor International Airport',\n",
       " 'Boryspil International Airport',\n",
       " 'Port of Spain, Piarco International Airport',\n",
       " 'Burlington International Airport',\n",
       " 'Lagos,Murtala Muhammed International Airport',\n",
       " 'Birmingham International Airport',\n",
       " 'Malaga Airport',\n",
       " 'Bangor International Airport',\n",
       " 'Queen Alia International Airport',\n",
       " 'Rafael Hernandez Airport',\n",
       " 'Ramón Villeda Morales International Airport',\n",
       " 'Samaná El Catey International Airport',\n",
       " 'Casa De Campo International Airport',\n",
       " 'Jose Maria Córdova International Airport',\n",
       " 'Fuzhou Changle International Airport',\n",
       " 'Venice Marco Polo Airport',\n",
       " 'Edinburgh Airport',\n",
       " 'Glasgow International Airport',\n",
       " 'Stockholm-Arlanda Airport',\n",
       " 'Paris, Orly Airport',\n",
       " 'Milan, Malpensa International Airport',\n",
       " 'Kuwait International Airport',\n",
       " 'Kingston, Norman Manley International Airport',\n",
       " 'Riga International Airport',\n",
       " 'Tobago-Crown Point Airport',\n",
       " 'Vnukovo International Airport',\n",
       " 'Sarasota Bradenton International Airport',\n",
       " 'Cheddi Jagan International Airport',\n",
       " 'Mercedita Airport',\n",
       " 'Rafael Nuñez International Airport',\n",
       " 'Point Salines International Airport',\n",
       " 'Daytona Beach International Airport',\n",
       " 'East Midlands Airport',\n",
       " 'Bilbao Airport',\n",
       " 'Mumbai, Chhatrapati Shivaji International Airport',\n",
       " 'Cape Town International Airport',\n",
       " 'Kuala Lumpur International Airport',\n",
       " 'Malta International Airport',\n",
       " 'Prague, Ruzyne International Airport',\n",
       " 'Sofia Airport',\n",
       " 'Liverpool John Lennon Airport',\n",
       " 'Luxembourg-Findel International Airport',\n",
       " 'London City Airport',\n",
       " 'Muscat International Airport',\n",
       " 'Southampton Airport',\n",
       " 'Addis Ababa Bole International Airport',\n",
       " 'Turin Airport',\n",
       " 'Islamabad, Benazir Bhutto International Airport',\n",
       " 'Athens, Eleftherios Venizelos International Airport',\n",
       " 'Budapest Ferenc Liszt International Airport',\n",
       " 'Nnamdi Azikiwe International Airport',\n",
       " 'Leeds Bradford Airport',\n",
       " 'Toulouse-Blagnac Airport',\n",
       " 'Tashkent International Airport',\n",
       " 'Verona Villafranca Airport',\n",
       " 'Nantes Atlantique Airport',\n",
       " 'Dubrovnik Airport',\n",
       " 'Suvarnabhumi Bangkok International Airport',\n",
       " 'Marseille Provence Airport',\n",
       " 'Colombo, Bandaranaike International Airport',\n",
       " 'Ibn Batouta Airport',\n",
       " 'Nairobi, Jomo Kenyatta International Airport',\n",
       " 'Faro Airport',\n",
       " 'Peretola Airport',\n",
       " 'Bremen Airport',\n",
       " 'Aberdeen Dyce Airport',\n",
       " 'Amílcar Cabral International Airport',\n",
       " 'Jersey Airport',\n",
       " 'Tivat Airport',\n",
       " 'Bahrain International Airport',\n",
       " 'Ho Chi Minh City, Tan Son Nhat International Airport',\n",
       " 'Hamburg Airport',\n",
       " 'Stuttgart Airport',\n",
       " 'Naples International Airport',\n",
       " 'Bologna Guglielmo Marconi Airport',\n",
       " 'Pulkovo Airport',\n",
       " 'Francisco de Sa Carneiro Airport',\n",
       " 'Salzburg Airport',\n",
       " 'Gran Canaria Airport',\n",
       " 'Clermont-Ferrand Auvergne Airport',\n",
       " 'John Paul II International Airport Kraków-Balice Airport',\n",
       " 'Menara Airport',\n",
       " 'Luxor International Airport',\n",
       " 'Santiago de Compostela Airport',\n",
       " 'Bordeaux-Mérignac Airport',\n",
       " 'Rhodes, Diagoras Airport',\n",
       " 'Maya-Maya Airport',\n",
       " 'Bari Karol Wojtyła Airport',\n",
       " 'Newcastle Airport',\n",
       " 'Pointe Noire Airport',\n",
       " 'Olbia Costa Smeralda Airport',\n",
       " 'Senou Airport',\n",
       " 'Ostrava Leos Janáček Airport',\n",
       " 'Minsk International Airport',\n",
       " 'EuroAirport Basle-Mulhouse-Freiburg Airport',\n",
       " 'Exeter International Airport',\n",
       " 'Jardines Del Rey Airport',\n",
       " 'Stavanger Airport',\n",
       " 'Annaba Airport',\n",
       " 'Ouagadougou Airport',\n",
       " 'Pau Pyrénées Airport',\n",
       " 'Koltsovo Airport',\n",
       " 'Ljubljana Jože Pučnik Airport',\n",
       " 'Algiers, Houari Boumediene Airport',\n",
       " 'Cork Airport',\n",
       " 'Split Airport',\n",
       " 'Lyon Saint-Exupery Airport',\n",
       " 'Beirut Rafic Hariri International Airport',\n",
       " 'Quatro de Fevereiro Airport',\n",
       " 'Sir Seewoosagur Ramgoolam International Airport',\n",
       " 'Chişinău International Airport',\n",
       " 'Billund Airport',\n",
       " 'Brest Bretagne Airport',\n",
       " 'Cadjehoun Airport',\n",
       " 'Lomé-Tokoin Airport',\n",
       " 'Yaoundé Nsimalen International Airport',\n",
       " 'Belfast International Airport',\n",
       " 'Zvartnots International Airport',\n",
       " 'Fuerteventura Airport',\n",
       " 'Tenerife South Airport',\n",
       " 'Valencia Airport',\n",
       " 'Bastia-Poretta Airport',\n",
       " 'Heraklion International Nikos Kazantzakis Airport',\n",
       " 'Thessaloniki Macedonia International Airport',\n",
       " 'Adnan Menderes International Airport',\n",
       " 'Juan Gualberto Gomez International Airport',\n",
       " 'Tbilisi International Airport',\n",
       " 'Cagliari Elmas Airport',\n",
       " 'Rzeszów-Jasionka Airport',\n",
       " 'Podgorica Airport',\n",
       " 'Diori Hamani International Airport',\n",
       " \"Libreville Leon M'ba International Airport\",\n",
       " 'Nouakchott International Airport',\n",
       " 'Biarritz-Anglet-Bayonne Airport',\n",
       " 'Calvi-Sainte-Catherine Airport',\n",
       " 'Rennes-Saint-Jacques Airport',\n",
       " 'Saïss Airport',\n",
       " 'Batna Airport',\n",
       " 'Biskra Airport',\n",
       " 'Zagreb Airport',\n",
       " 'Gothenburg-Landvetter Airport',\n",
       " 'Bengaluru International Airport',\n",
       " 'Larnaca International Airport',\n",
       " 'Genoa Cristoforo Colombo Airport',\n",
       " 'London Luton Airport',\n",
       " 'Tunis Carthage International Airport',\n",
       " 'Bristol International Airport',\n",
       " 'Sevilla Airport',\n",
       " 'Palma De Mallorca Airport',\n",
       " 'Hannover Airport',\n",
       " 'Henri Coanda International Airport',\n",
       " 'Copernicus Wroclaw Airport',\n",
       " 'Lungi International Airport',\n",
       " 'Linate Airport',\n",
       " 'Noi Bai International Airport',\n",
       " 'Ajaccio-Napoléon Bonaparte Airport',\n",
       " 'Lanzarote Airport',\n",
       " 'Al Massira Airport',\n",
       " 'Montpellier-Méditerranée Airport',\n",
       " 'Catania-Fontanarossa Airport',\n",
       " 'Falcone–Borsellino Airport',\n",
       " 'Leipzig Halle Airport',\n",
       " 'Sabiha Gökçen International Airport',\n",
       " 'Nuremberg Airport',\n",
       " 'Cardiff International Airport',\n",
       " 'Presidente Juscelino Kubistschek International Airport',\n",
       " 'Vilnius International Airport',\n",
       " 'Djerba Zarzis International Airport',\n",
       " 'Douala International Airport',\n",
       " 'Mohamed Boudiaf International Airport',\n",
       " 'Djibouti-Ambouli Airport',\n",
       " 'Monastir Habib Bourguiba International Airport',\n",
       " 'Es Senia Airport',\n",
       " \"Bangui M'Poko International Airport\",\n",
       " 'Sfax Thyna International Airport',\n",
       " 'Port Bouet Airport',\n",
       " 'Rabat-Salé Airport',\n",
       " 'Roland Garros Airport',\n",
       " 'Conakry Airport',\n",
       " 'Ivato Airport',\n",
       " 'Asturias Airport',\n",
       " \"N'Djamena International Airport\",\n",
       " 'Ndjili International Airport',\n",
       " 'Vigo Airport',\n",
       " 'Abel Santamaria Airport',\n",
       " 'Angads Airport',\n",
       " 'Robin Hood Doncaster Sheffield Airport',\n",
       " 'Łódź Władysław Reymont Airport',\n",
       " 'Moscow, Domodedovo International Airport',\n",
       " 'Ibiza Airport',\n",
       " 'Chennai International Airport',\n",
       " \"St. John's International Airport\",\n",
       " 'Alama Iqbal International Airport',\n",
       " 'George Best Belfast City Airport',\n",
       " 'Entebbe International Airport',\n",
       " 'Hyderabad, Rajiv Gandhi International Airport',\n",
       " 'Gibraltar Airport',\n",
       " 'Osmany International Airport',\n",
       " 'Tallinn Airport',\n",
       " 'Almaty Airport',\n",
       " 'Santorini Airport',\n",
       " 'Inverness Airport',\n",
       " 'Dhaka / Hazrat Shahjalal International Airport',\n",
       " 'Jinnah International Airport',\n",
       " 'Ashgabat Airport',\n",
       " 'Rotterdam Airport',\n",
       " 'Mikonos Airport',\n",
       " 'Rijeka Airport',\n",
       " 'Tripoli International Airport',\n",
       " 'A Coruna Airport',\n",
       " 'Pula Airport',\n",
       " 'Sardar Vallabhbhai Patel International Airport',\n",
       " 'Al Maktoum International Airport',\n",
       " 'Brindisi – Salento Airport',\n",
       " 'Pisa International Airport',\n",
       " 'Soekarno-Hatta International Airport',\n",
       " 'Astana International Airport',\n",
       " 'Imam Khomeini International Airport',\n",
       " 'Innsbruck Airport',\n",
       " 'San Javier Airport',\n",
       " 'Osaka International Airport',\n",
       " 'Sapporo, New Chitose Airport',\n",
       " 'Gold Coast Airport',\n",
       " 'Fukuoka Airport',\n",
       " 'Phnom Penh International Airport',\n",
       " 'Miho Yonago Airport',\n",
       " 'Sendai Airport',\n",
       " 'Khabarovsk-Novy Airport',\n",
       " 'La Tontouta International Airport',\n",
       " \"Tahiti Faa'a International Airport\",\n",
       " 'Chinggis Khaan International Airport',\n",
       " 'Macau International Airport',\n",
       " 'Longjia Airport',\n",
       " 'Kagoshima Airport',\n",
       " 'Oita Airport',\n",
       " 'Komatsu Airport',\n",
       " 'Niigata Airport',\n",
       " 'Gimhae International Airport',\n",
       " 'Naha Airport',\n",
       " 'Babelthuap Airport',\n",
       " 'Yangon International Airport',\n",
       " 'Yuzhno-Sakhalinsk Airport',\n",
       " 'General Abelardo L. Rodríguez International Airport',\n",
       " 'Melbourne International Airport',\n",
       " 'Cairns International Airport',\n",
       " 'Bali - Ngurah Rai International Airport',\n",
       " 'Port Moresby Jacksons International Airport',\n",
       " 'Kaohsiung International Airport',\n",
       " 'Vladivostok International Airport',\n",
       " 'Takamatsu Airport',\n",
       " 'Kota Kinabalu International Airport',\n",
       " 'Hiroshima Airport',\n",
       " 'Jeju International Airport',\n",
       " 'Mactan Cebu International Airport',\n",
       " 'Matsuyama Airport',\n",
       " 'Saipan International Airport',\n",
       " 'Hakodate Airport',\n",
       " 'Zhoushuizi Airport',\n",
       " 'Daegu Airport',\n",
       " 'Antalya International Airport',\n",
       " 'Hurghada International Airport',\n",
       " 'Ioannis Kapodistrias International Airport',\n",
       " 'Sharjah International Airport',\n",
       " 'Sharm El Sheikh International Airport',\n",
       " 'Paphos International Airport',\n",
       " 'Dalaman International Airport',\n",
       " 'Irkutsk Airport',\n",
       " 'Ulan-Ude Airport (Mukhino)',\n",
       " 'Dnipropetrovsk International Airport',\n",
       " 'Varna Airport',\n",
       " 'Manas International Airport',\n",
       " 'Krasnodar International Airport',\n",
       " 'Mineralnyye Vody Airport',\n",
       " 'Rostov-na-Donu Airport',\n",
       " 'Volgograd International Airport',\n",
       " 'Odessa International Airport',\n",
       " 'Tolmachevo Airport',\n",
       " 'Nizhny Novgorod International Airport',\n",
       " 'Saratov Central Airport',\n",
       " 'Yakutsk Airport',\n",
       " 'Burgas Airport',\n",
       " 'Haikou Meilan International Airport',\n",
       " 'Osh Airport',\n",
       " 'Ust-Kamennogorsk Airport',\n",
       " 'Aktobe Airport',\n",
       " 'Yelizovo Airport',\n",
       " 'Simferopol International Airport',\n",
       " 'Izhevsk Airport',\n",
       " 'Roshchino International Airport',\n",
       " 'Donetsk International Airport',\n",
       " 'Kurgan Airport',\n",
       " 'Chelyabinsk Balandino Airport',\n",
       " 'Andizhan Airport',\n",
       " 'Ufa International Airport',\n",
       " 'Bukhara Airport',\n",
       " 'Belgorod International Airport',\n",
       " 'Uralsk Airport',\n",
       " 'Ukhta Airport',\n",
       " 'Urgench Airport',\n",
       " 'Lankaran International Airport',\n",
       " 'Polyarny Airport',\n",
       " 'Khrabrovo Airport',\n",
       " 'Gorno-Altaysk Airport',\n",
       " 'Astrakhan Airport',\n",
       " 'Novy Urengoy Airport',\n",
       " 'Namangan Airport',\n",
       " 'Cam Ranh Airport',\n",
       " 'Yemelyanovo Airport',\n",
       " 'Kiev Zhuliany International Airport',\n",
       " 'Bolshoye Savino Airport',\n",
       " 'Voronezh International Airport',\n",
       " 'Grozny North Airport',\n",
       " 'Taraz Airport',\n",
       " 'Gabala International Airport',\n",
       " 'Ugolny Airport',\n",
       " 'Sokol Airport',\n",
       " 'Bratsk Airport',\n",
       " 'Barnaul Airport',\n",
       " 'Bogashevo Airport',\n",
       " 'Anapa Airport',\n",
       " 'Stavropol Shpakovskoye Airport',\n",
       " 'Elista Airport',\n",
       " 'Nadym Airport',\n",
       " 'Qurghonteppa International Airport',\n",
       " 'Karshi Khanabad Airport',\n",
       " 'Saransk Airport',\n",
       " 'Pardubice Airport',\n",
       " 'Shymkent Airport',\n",
       " 'Sary-Arka Airport',\n",
       " 'Pavlodar Airport',\n",
       " 'Ganja Airport',\n",
       " 'Mirny Airport',\n",
       " 'Kopitnari Airport',\n",
       " 'Batumi International Airport',\n",
       " 'Ignatyevo Airport',\n",
       " 'Chita-Kadala Airport',\n",
       " 'Kirovsk-Apatity Airport',\n",
       " 'Petrozavodsk Airport',\n",
       " 'Abakan Airport',\n",
       " 'Kemerovo Airport',\n",
       " 'Spichenkovo Airport',\n",
       " 'Beslan Airport',\n",
       " 'Taganrog Yuzhny Airport',\n",
       " 'Sochi International Airport',\n",
       " 'Nizhnevartovsk Airport',\n",
       " 'Noyabrsk Airport',\n",
       " 'Fergana International Airport',\n",
       " 'Nukus Airport',\n",
       " 'Samarkand Airport',\n",
       " 'Bugulma Airport',\n",
       " 'Begishevo Airport',\n",
       " 'Cheboksary Airport',\n",
       " 'Ulyanovsk Baratayevka Airport',\n",
       " 'Orenburg Central Airport',\n",
       " 'Orsk Airport',\n",
       " 'Ürümqi Diwopu International Airport',\n",
       " 'Ovda International Airport',\n",
       " 'Ulyanovsk East Airport',\n",
       " 'Ras Al Khaimah International Airport',\n",
       " 'Alicante International Airport',\n",
       " 'Phuket International Airport',\n",
       " 'Kos Airport',\n",
       " 'Enfidha - Hammamet International Airport',\n",
       " 'Dushanbe Airport',\n",
       " 'Kurumoch International Airport',\n",
       " 'Sanya Phoenix International Airport',\n",
       " 'Dabolim Airport',\n",
       " 'Cherepovets Airport',\n",
       " 'Karlsruhe Baden-Baden Airport',\n",
       " 'Federico Fellini International Airport',\n",
       " 'Aktau Airport',\n",
       " 'Talagi Airport',\n",
       " 'Omsk Central Airport',\n",
       " 'Salekhard Airport',\n",
       " 'Khanty Mansiysk Airport',\n",
       " 'Beloyarskiy Airport',\n",
       " 'Surgut Airport',\n",
       " 'Kulob Airport',\n",
       " 'Vorkuta Airport',\n",
       " 'Kokshetau Airport',\n",
       " 'Norilsk-Alykel Airport',\n",
       " 'Gyumri Shirak Airport',\n",
       " 'Navoi Airport',\n",
       " 'Termez Airport',\n",
       " 'Kazan International Airport',\n",
       " 'Belbek Airport',\n",
       " 'Penza Airport',\n",
       " 'Murmansk Airport',\n",
       " 'Uytash Airport',\n",
       " 'Pobedilovo Airport',\n",
       " 'Khudzhand Airport',\n",
       " 'Lipetsk Airport',\n",
       " 'Zakynthos, Dionysios Solomos Airport',\n",
       " 'Guernsey Airport',\n",
       " 'Menorca Airport',\n",
       " 'Funchal, Madeira Airport',\n",
       " 'Sandefjord Airport, Torp',\n",
       " 'Kaunas International Airport',\n",
       " 'Ålesund Airport',\n",
       " 'Kalamata Airport',\n",
       " 'Malé International Airport',\n",
       " 'Ivalo Airport',\n",
       " 'Priština International Airport',\n",
       " 'Oued Irara Airport',\n",
       " 'Ireland West Knock Airport',\n",
       " 'Aalborg Airport',\n",
       " 'Tirana International Airport Mother Teresa',\n",
       " 'Kefallinia Airport',\n",
       " 'Chania International Airport',\n",
       " 'Milas Bodrum International Airport',\n",
       " 'Chongqing Jiangbei International Airport',\n",
       " 'Limoges Airport',\n",
       " 'Östersund Airport',\n",
       " 'Grenoble Alpes-Isère Airport',\n",
       " 'Sulaymaniyah International Airport',\n",
       " 'Banjul International Airport',\n",
       " 'Trondheim Airport, Værnes',\n",
       " 'Newquay Cornwall Airport',\n",
       " 'Isle of Man Airport',\n",
       " 'Federico Garcia Lorca Airport',\n",
       " 'Berlin-Schönefeld International Airport',\n",
       " 'Tromsø Airport',\n",
       " 'Erfurt Airport',\n",
       " 'Strasbourg Airport',\n",
       " 'Almería International Airport',\n",
       " 'Aktion National Airport',\n",
       " 'Rabil Airport',\n",
       " 'Kigali International Airport',\n",
       " 'La Palma Airport',\n",
       " 'Tianjin Binhai International Airport',\n",
       " 'Rovaniemi Airport',\n",
       " 'Kittila Airport',\n",
       " 'Roanoke–Blacksburg Regional Airport',\n",
       " 'Southeast Iowa Regional Airport',\n",
       " 'Key West International Airport',\n",
       " 'Asheville Regional Airport',\n",
       " 'Appleton International Airport',\n",
       " 'MBS International Airport',\n",
       " 'Providence, Theodore Francis Green State Airport',\n",
       " 'Wilkes Barre Scranton International Airport',\n",
       " 'Charlottesville Albemarle Airport',\n",
       " 'Bishop International Airport',\n",
       " 'South Bend Regional Airport',\n",
       " 'University Park Airport',\n",
       " 'Waterloo Airport',\n",
       " 'Yeager Airport',\n",
       " 'Sawyer International Airport',\n",
       " 'Austin Straubel International Airport',\n",
       " 'Central Wisconsin Airport',\n",
       " 'Muskegon County Airport',\n",
       " 'Lehigh Valley International Airport',\n",
       " 'Waterloo Regional Airport',\n",
       " 'Erie International Tom Ridge Field',\n",
       " 'Duluth International Airport',\n",
       " 'St Cloud Regional Airport',\n",
       " 'Northeast Florida Regional Airport',\n",
       " 'Mason City Municipal Airport',\n",
       " 'Rochester International Airport',\n",
       " 'Topeka Regional Airport - Forbes Field',\n",
       " 'Capital City Airport',\n",
       " 'Kalamazoo Battle Creek International Airport',\n",
       " 'Chippewa Valley Regional Airport',\n",
       " 'Elmira Corning Regional Airport',\n",
       " 'Watertown International Airport',\n",
       " 'Decatur Airport',\n",
       " 'La Crosse Municipal Airport',\n",
       " 'Toledo Express Airport',\n",
       " 'Lincoln Airport',\n",
       " 'Houghton County Memorial Airport',\n",
       " 'Dubuque Regional Airport',\n",
       " 'Barkley Regional Airport',\n",
       " 'Charlotte County Airport',\n",
       " 'Gogebic Iron County Airport',\n",
       " 'Gdańsk Lech Wałęsa Airport',\n",
       " 'Savonlinna Airport',\n",
       " 'Vaasa Airport',\n",
       " 'Stockholm-Bromma Airport',\n",
       " 'Kajaani Airport',\n",
       " 'Kruunupyy Airport',\n",
       " 'Turku Airport',\n",
       " 'Gazipaşa Airport',\n",
       " 'Tampere-Pirkkala Airport',\n",
       " 'Enontekio Airport',\n",
       " 'Joensuu Airport',\n",
       " 'Jyvaskyla Airport',\n",
       " 'Kemi-Tornio Airport',\n",
       " 'Kuusamo Airport',\n",
       " 'Tartu Airport',\n",
       " 'Kuopio Airport',\n",
       " 'Mariehamn Airport',\n",
       " 'Pori Airport',\n",
       " 'Oulu Airport',\n",
       " 'Norrköping Airport',\n",
       " 'Stockholm Västerås Airport',\n",
       " 'Wellington International Airport',\n",
       " 'Christchurch International Airport',\n",
       " 'Canberra International Airport',\n",
       " 'Adelaide International Airport',\n",
       " 'Darwin International Airport',\n",
       " 'Hamilton Island Airport',\n",
       " 'Karratha Airport',\n",
       " 'Cloncurry Airport',\n",
       " 'Moranbah Airport',\n",
       " 'Longreach Airport',\n",
       " 'Queenstown International Airport',\n",
       " 'Armidale Airport',\n",
       " 'Broome International Airport',\n",
       " 'Townsville Airport',\n",
       " 'Lord Howe Island Airport',\n",
       " 'Orange Airport',\n",
       " 'Port Macquarie Airport',\n",
       " 'Tamworth Airport',\n",
       " 'Bonriki International Airport',\n",
       " 'Nauru International Airport',\n",
       " 'Rockhampton Airport',\n",
       " 'Gladstone Airport',\n",
       " 'Hervey Bay Airport',\n",
       " 'Albury Airport',\n",
       " 'Hobart International Airport',\n",
       " 'Launceston Airport',\n",
       " 'Coffs Harbour Airport',\n",
       " 'Ballera Airport',\n",
       " 'Honiara International Airport',\n",
       " 'Charleville Airport',\n",
       " 'Mount Isa Airport',\n",
       " 'Bundaberg Airport',\n",
       " 'Emerald Airport',\n",
       " 'Roma Airport',\n",
       " 'Narrabri Airport',\n",
       " 'Chinchilla Airport',\n",
       " 'Brisbane West Wellcamp Airport',\n",
       " 'Taroom Airport',\n",
       " 'Trepell Airport',\n",
       " 'Perth International Airport',\n",
       " 'Alice Springs Airport',\n",
       " 'Moree Airport',\n",
       " 'Dubbo City Regional Airport',\n",
       " 'Mackay Airport',\n",
       " 'Port Vila Bauerfield Airport',\n",
       " 'Proserpine Whitsunday Coast Airport',\n",
       " 'Norfolk Island International Airport',\n",
       " 'Port Hedland International Airport',\n",
       " 'Santo Pekoa International Airport',\n",
       " 'Thangool Airport',\n",
       " 'Changsha Huanghua International Airport',\n",
       " 'Nanchang Changbei International Airport',\n",
       " 'Sunan International Airport',\n",
       " 'Yanji Chaoyangchuan Airport',\n",
       " 'Lijiang Airport',\n",
       " 'Muan International Airport',\n",
       " 'Longdongbao Airport',\n",
       " 'Qiqihar Sanjiazi Airport',\n",
       " 'Kalibo International Airport',\n",
       " 'Nantong Airport',\n",
       " 'Qianjiang Wulingshan Airport',\n",
       " 'Ordos Ejin Horo Airport',\n",
       " 'Yuncheng Guangong Airport',\n",
       " 'Mangshi Airport',\n",
       " 'Tongliao Airport',\n",
       " 'Bailian Airport',\n",
       " 'Wenzhou Yongqiang Airport',\n",
       " 'Guangyuan Airport',\n",
       " 'Jiamusi Airport',\n",
       " 'Chiang Mai International Airport',\n",
       " 'Siem Reap International Airport',\n",
       " 'Chaoyang Airport',\n",
       " 'Gimpo International Airport',\n",
       " 'Mattala Rajapaksa International Airport',\n",
       " 'Dongying Shengli Airport',\n",
       " 'Changbaishan Airport',\n",
       " 'Wuhai Airport',\n",
       " 'Dayong Airport',\n",
       " 'Zhuhai Airport',\n",
       " 'Yaoqiang Airport',\n",
       " 'Yinchuan Airport',\n",
       " 'Yantai Laishan Airport',\n",
       " 'Jining Qufu Airport',\n",
       " \"Yan'an Airport\",\n",
       " 'Fuyang Xiguan Airport',\n",
       " 'Jingdezhen Airport',\n",
       " 'Jiujiang Lushan Airport',\n",
       " 'Nanping Wuyishan Airport',\n",
       " 'Tongren Fenghuang Airport',\n",
       " 'Yiwu Airport',\n",
       " 'Dachuan Airport',\n",
       " 'Mingyueshan Airport',\n",
       " 'Bayannur Tianjitai Airport',\n",
       " 'Tonghua Sanyuanpu Airport',\n",
       " 'Lanzhou Zhongchuan Airport',\n",
       " 'Ulanqab Airport',\n",
       " 'Sunan Shuofang International Airport',\n",
       " 'Baoshan Yunduan Airport',\n",
       " 'Jixi Xingkaihu Airport',\n",
       " 'Saertu Airport',\n",
       " 'Datong Airport',\n",
       " 'Erenhot Saiwusu International Airport',\n",
       " 'Baotou Airport',\n",
       " 'Beihai Airport',\n",
       " 'Changde Airport',\n",
       " 'Zhanjiang Airport',\n",
       " 'Xiangfan Airport',\n",
       " 'Yulin Airport',\n",
       " 'Zhongwei Shapotou Airport',\n",
       " 'Anqing Airport',\n",
       " 'Ganzhou Airport',\n",
       " 'Shubuling Airport',\n",
       " 'Quanzhou Airport',\n",
       " 'Nanchong Airport',\n",
       " 'Zunyi Xinzhou Airport',\n",
       " 'Hami Airport',\n",
       " 'Weihai Airport',\n",
       " 'Dali Airport',\n",
       " 'Mianyang Airport',\n",
       " ...]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V(hkVertexId).out('route').in_('route').dedup().count().next()\n",
    "g.V(hkVertexId).out('route').in_('route').values('desc').dedup().fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Remove duplicates by number of runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['OAG', 2, 'MIM', 1, 'TMW', 4, 'SYD', 3]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('region','AU-NSW').dedup().by('runways').values('code','runways').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Remove duplicates where there is the same A and C even if B is different__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': v[98344], 'b': v[8328], 'c': v[90152]}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).as_('a').V(sydneyVertexId).as_('c').both().as_('b').limit(10).dedup('a','c').select('a','b','c').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## where(), neq()\n",
    "\n",
    "Exclude the HK airport itself"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1879"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x2 = g.V(hkVertexId).as_('hk').out('route').in_('route').where(P.neq('hk')).dedup().count().next()\n",
    "assert x1 == x2 + 1\n",
    "x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## limit()\n",
    "Limit the amount of results to \"n\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[v[4296], v[8328], v[12488], v[16440], v[24712]]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "n = 5\n",
    "count = g.V(hkVertexId).out('route').limit(n).count().next()\n",
    "assert n == count\n",
    "x1 = g.V(hkVertexId).out('route').limit(n).fold().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## range()\n",
    "Equivalent to using a range starting from 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[v[4296], v[8328], v[12488], v[16440], v[24712]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x2 = g.V(hkVertexId).out('route').range(0, n).fold().next()\n",
    "x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Get the results from \"n\" to the end__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# x1 = g.V(hkVertexId).out('route').range(n, -1).fold().next()\n",
    "# x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## skip()\n",
    "Equivalent to skipping by \"n\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "# x2 = g.V(hkVertexId).out('route').skip(n).fold().next()\n",
    "# assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## tail()\n",
    "__Get the last \"n\" results__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[v[41558224], v[41566416], v[41578704], v[41590872], v[41594968]]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).out('route').tail(n).fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "There is no guarantee to the order of ranges, it is often based on order put into graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## timeLimit()\n",
    "Limit the query to however much can be processed within 10 ms"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['HKG', 'SYD']"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).repeat(__.timeLimit(10).out()).until(__.has('code','SYD')).path().by('code').next()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
