{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 4. Gt, Lt, Between, Within, Mean, Dedup, Where, Neq, Limit, Range, Skip, Tail, TimeLimit\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import P\n",
    "from loader import __\n",
    "from loader import hkVertexId\n",
    "from loader import sydneyVertexId"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## gt(), lt()\n",
    "__Get destinations from HK that have more than 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'runways': [6], 'desc': ['Boston Logan']},\n",
       " {'runways': [7], 'desc': ['Dallas/Fort Worth International Airport']},\n",
       " {'runways': [8], 'desc': [\"Chicago O'Hare International Airport\"]},\n",
       " {'runways': [6], 'desc': ['Amsterdam Airport Schiphol']}]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).out('route').has('runways', P.gt(5)).valueMap('desc', 'runways').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## between()\n",
    "__Get destinations from HK that have 6 to 8 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'runways': [6], 'desc': ['Boston Logan']},\n",
       " {'runways': [7], 'desc': ['Dallas/Fort Worth International Airport']},\n",
       " {'runways': [6], 'desc': ['Amsterdam Airport Schiphol']}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).out('route').has('runways', P.between(6, 8)).valueMap('desc', 'runways').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## within()\n",
    "__Count of vertices that are within region \"AU-NSW\" and \"AU-VIC\"__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Tamworth Airport',\n",
       " 'Port Macquarie Airport',\n",
       " 'Lismore Airport',\n",
       " 'Wagga Wagga City Airport',\n",
       " 'Moruya Airport',\n",
       " 'Albury Airport',\n",
       " 'Taree Airport',\n",
       " 'Merimbula Airport',\n",
       " 'Parkes Airport',\n",
       " 'Coffs Harbour Airport',\n",
       " 'Narrandera Airport',\n",
       " 'Griffith Airport',\n",
       " 'Sydney Kingsford Smith',\n",
       " 'Portland Airport',\n",
       " 'Narrabri Airport',\n",
       " 'Avalon Airport',\n",
       " 'Melbourne International Airport',\n",
       " 'Lord Howe Island Airport',\n",
       " 'Warrnambool Airport',\n",
       " 'Sydney Bankstown Airport',\n",
       " 'Bathurst Airport',\n",
       " 'Orange Airport',\n",
       " 'Gold Coast Airport',\n",
       " 'Mildura Airport',\n",
       " 'Grafton Airport',\n",
       " 'Melbourne Essendon Airport',\n",
       " 'Ballina Byron Gateway Airport',\n",
       " 'Newcastle Airport',\n",
       " 'Moree Airport',\n",
       " 'Broken Hill Airport',\n",
       " 'Dubbo City Regional Airport',\n",
       " 'Armidale Airport']"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('region', P.within('AU-NSW', 'AU-VIC')).values('desc').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## mean()\n",
    "\n",
    "__Get the mean between the number of runways of airports within regions \"AU-NSW\" and \"AU-VIC\"__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1.875"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('region', P.within('AU-NSW', 'AU-VIC')).values('runways').mean().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## dedup()\n",
    "\n",
    "__Get airports that have destinations the HK airport does, and remove duplicates__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Salt Lake City',\n",
       " 'Baltimore/Washington International Airport',\n",
       " 'Anchorage Ted Stevens',\n",
       " 'Orlando International Airport',\n",
       " 'Austin Bergstrom International Airport',\n",
       " 'Boston Logan',\n",
       " 'Minneapolis-St.Paul International Airport',\n",
       " 'Hartsfield - Jackson Atlanta International Airport',\n",
       " 'Nashville International Airport',\n",
       " 'Las Vegas Mc Carran',\n",
       " 'George Bush Intercontinental',\n",
       " 'Toronto Pearson International Airport',\n",
       " 'Raleigh-Durham',\n",
       " 'Tampa International Airport',\n",
       " 'Phoenix Sky Harbor International Airport',\n",
       " 'Ronald Reagan Washington National Airport',\n",
       " 'Honolulu International Airport',\n",
       " 'Los Angeles International Airport',\n",
       " 'Helsinki Ventaa',\n",
       " 'London Heathrow',\n",
       " 'San Antonio',\n",
       " 'Orange County/Santa Ana, John Wayne',\n",
       " 'Dallas/Fort Worth International Airport',\n",
       " 'Dublin International Airport',\n",
       " 'Beijing Capital International Airport',\n",
       " 'Detroit Metropolitan, Wayne County',\n",
       " 'Manchester Airport',\n",
       " 'Fort Lauderdale/Hollywood International Airport',\n",
       " 'Hong Kong - Chek Lap Kok International Airport',\n",
       " 'London Gatwick',\n",
       " 'Washington Dulles International Airport',\n",
       " 'Auckland International Airport',\n",
       " 'Paris Charles de Gaulle',\n",
       " 'New York John F. Kennedy International Airport',\n",
       " 'Shanghai - Pudong International Airport',\n",
       " 'Munich International Airport',\n",
       " 'Frankfurt am Main',\n",
       " 'Ontario International Airport',\n",
       " 'Montreal / Pierre Elliott Trudeau International Airport',\n",
       " 'Tokyo Narita',\n",
       " 'Miami International Airport',\n",
       " 'Portland International Airport',\n",
       " \"Chicago O'Hare International Airport\",\n",
       " 'Mexico City, Licenciado Benito Juarez International Airport',\n",
       " 'Amsterdam Airport Schiphol',\n",
       " 'Seattle-Tacoma',\n",
       " 'Lambert St Louis International Airport',\n",
       " 'Charlotte Douglas International Airport',\n",
       " 'Tel Aviv, Ben Gurion International Airport',\n",
       " 'Cincinnati Northern Kentucky International Airport',\n",
       " 'San Diego Lindbergh',\n",
       " 'Zurich-Kloten Airport',\n",
       " 'Dallas Love Field',\n",
       " 'Long Beach Airport',\n",
       " 'Calgary International Airport',\n",
       " 'Denver International Airport',\n",
       " 'New Orleans L. Armstrong',\n",
       " 'Sacramento International Airport',\n",
       " 'Newark, Liberty',\n",
       " 'Cancun International Airport',\n",
       " 'Seoul, Incheon International Airport',\n",
       " 'Cleveland, Hopkins International Airport',\n",
       " 'Tokyo Haneda International Airport',\n",
       " 'Tucson International Airport',\n",
       " 'Philadelphia International Airport',\n",
       " 'Guangzhou Baiyun International Airport',\n",
       " 'Vancouver',\n",
       " 'Ataturk International Airport',\n",
       " 'Sydney Kingsford Smith',\n",
       " 'Abu Dhabi International Airport',\n",
       " 'Pittsburgh International Airport',\n",
       " 'Singapore, Changi International Airport',\n",
       " 'Palm Springs International Airport',\n",
       " 'Oaklahoma City, Will Rogers World Airport',\n",
       " 'Dubai International Airport',\n",
       " 'Indira Gandhi International Airport',\n",
       " 'Kansas City International Airport',\n",
       " 'Puerto Vallarta, Licenciado Gustavo Diaz Ordaz International Airport',\n",
       " 'Copenhagen Kastrup Airport',\n",
       " 'Antonio B. Won Pat International Airport',\n",
       " 'Albuquerque International Sunport Airport',\n",
       " 'Eppley Airfield',\n",
       " 'Del Bajio International Airport',\n",
       " 'Edmonton International Airport',\n",
       " 'Dusseldorf International Airport',\n",
       " 'Don Miguel Hidalgo Y Costilla International Airport',\n",
       " 'Berlin, Tegel International Airport',\n",
       " 'Manila, Ninoy Aquino International Airport',\n",
       " 'Tocumen International Airport',\n",
       " 'City of Colorado Springs Municipal Airport',\n",
       " 'Boise Air Terminal/Gowen field',\n",
       " 'Kuai, Lihue Airport',\n",
       " 'Reno Taoe International Airport',\n",
       " 'Bradley International Airport',\n",
       " 'Fiji, Nadi International Airport',\n",
       " 'Chengdu Shuangliu International Airport',\n",
       " 'Los Cabos International Airport',\n",
       " 'Indianapolis International Airport',\n",
       " 'General Mitchell International Airport',\n",
       " 'Bob Hope Airport',\n",
       " 'Chicago Midway International Airport',\n",
       " 'Maui, Kahului Airport',\n",
       " 'Taiwan Taoyuan International Airport',\n",
       " 'Osaka, Kansai International Airport',\n",
       " 'Kona International At Keahole Airport',\n",
       " 'Reykjavik, Keflavik International Airport',\n",
       " 'Klamath Falls Airport',\n",
       " 'Rogue Valley International Medford Airport',\n",
       " 'Redding Municipal Airport',\n",
       " 'Modesto City Co-Harry Sham Field',\n",
       " 'San Luis County Regional Airport',\n",
       " 'Wuhan Tianhe International Airport',\n",
       " 'Charles M. Schulz Sonoma County Airport',\n",
       " 'Tri Cities Airport',\n",
       " \"Xi'an Xianyang International Airport\",\n",
       " 'Jackson Hole Airport',\n",
       " 'Glacier Park International Airport',\n",
       " 'Arcata Airport',\n",
       " 'Aspen-Pitkin Co/Sardy Field',\n",
       " 'Mahlon Sweet Field',\n",
       " 'Monterey Peninsula Airport',\n",
       " 'Roberts Field',\n",
       " 'Mammoth Yosemite Airport',\n",
       " 'Montrose Regional Airport',\n",
       " 'Fresno Yosemite International Airport',\n",
       " 'General Francisco J. Mujica International Airport',\n",
       " 'El Salvador International Airport',\n",
       " 'Northwest Arkansas Regional Airport',\n",
       " 'Yampa Valley Airport',\n",
       " 'Hangzhou Xiaoshan International Airport',\n",
       " 'Kunming Wujiaba International Airport',\n",
       " 'Liuting Airport',\n",
       " 'Victoria International Airport',\n",
       " 'Meadows Field',\n",
       " 'Jack Mc Namara Field Airport',\n",
       " 'Chico Municipal Airport',\n",
       " 'Southwest Oregon Regional Airport',\n",
       " 'Santa Barbara Municipal Airport',\n",
       " 'Spokane International Airport',\n",
       " 'Gallatin Field',\n",
       " 'Friedman Memorial Airport',\n",
       " 'San Francisco International Airport',\n",
       " 'Westchester County',\n",
       " 'Houston Hobby',\n",
       " 'Palm Beach International Airport',\n",
       " 'Puerto Rico, Luis Munoz International Airport',\n",
       " 'Doha, Hamad International Airport',\n",
       " 'Barcelona International Airport',\n",
       " 'New York La Guardia',\n",
       " 'Cologne Bonn Airport',\n",
       " 'Shannon Airport',\n",
       " 'Adolfo Suarez Barajas Airport International Airport',\n",
       " 'Norman Y. Mineta San Jose International Airport',\n",
       " 'Nassau, Lynden Pindling International Airport',\n",
       " 'Punta Cana International Airport',\n",
       " 'Montego Bay, Sangster International Airport',\n",
       " 'Bridgetown, Sir Grantley Adams International Airport',\n",
       " 'Aruba, Queen Beatrix International Airport',\n",
       " 'Harrisburg International Airport',\n",
       " 'Albany International Airport',\n",
       " 'Oakland',\n",
       " 'Sint Martin, Princess Juliana International Airport',\n",
       " 'Richmond International Airport',\n",
       " 'Halifax / Stanfield International Airport',\n",
       " 'Myrtle Beach International Airport',\n",
       " 'Leonardo da Vinci-Fiumicino International Airport',\n",
       " 'Ottawa Macdonald-Cartier International Airport',\n",
       " 'Southwest Florida International Airport',\n",
       " 'Oslo Gardermoen Airport',\n",
       " 'Norfolk International Airport',\n",
       " 'Providenciales Airport',\n",
       " 'Akron Canton Regional Airport',\n",
       " 'Syracuse Hancock International Airport',\n",
       " 'Buffalo Niagara International Airport',\n",
       " 'João Paulo II Airport',\n",
       " 'Charleston Air Force Base-International Airport',\n",
       " 'Pointe-à-Pitre Le Raizet',\n",
       " 'Greater Rochester International Airport',\n",
       " 'Savannah Hilton Head International Airport',\n",
       " 'Las Américas International Airport',\n",
       " 'Lisbon Portela Airport',\n",
       " 'Cibao International Airport',\n",
       " 'St. Thomas, Cyril E. King Airport',\n",
       " 'Bermuda, L.F. Wade International International Airport',\n",
       " 'Jacksonville International Airport',\n",
       " 'Columbus, Port Columbus International Airport',\n",
       " 'Long Island Mac Arthur Airport',\n",
       " 'Lebanon Municipal Airport',\n",
       " \"Martha's Vineyard Airport\",\n",
       " 'Barnstable Municipal Boardman Polando Field',\n",
       " 'Rutland - Southern Vermont Regional Airport',\n",
       " 'Nantucket Memorial Airport',\n",
       " 'Knox County Regional Airport',\n",
       " 'Adirondack Regional Airport',\n",
       " 'El Dorado International Airport',\n",
       " 'Augusta State Airport',\n",
       " 'Provincetown Municipal Airport',\n",
       " 'Toussaint Louverture International Airport',\n",
       " 'Martinique Aimé Césaire International Airport',\n",
       " 'Atlantic City International Airport',\n",
       " 'Lajes Field',\n",
       " 'Praia International Airport',\n",
       " 'Plattsburgh International Airport',\n",
       " 'Billy Bishop Toronto City Centre Airport',\n",
       " 'Hancock County-Bar Harbor Airport',\n",
       " 'Northern Maine Regional Airport at Presque Isle',\n",
       " 'Prague, Ruzyne International Airport',\n",
       " 'Venice Marco Polo Airport',\n",
       " 'Athens, Eleftherios Venizelos International Airport',\n",
       " 'Brussels Airport',\n",
       " 'Kingston, Norman Manley International Airport',\n",
       " 'Mumbai, Chhatrapati Shivaji International Airport',\n",
       " 'Budapest Ferenc Liszt International Airport',\n",
       " 'Santiago, Comodoro Arturo Merino Benitez International Airport',\n",
       " 'Vienna International Airport',\n",
       " 'Warsaw Chopin Airport',\n",
       " 'V.C. Bird International Airport',\n",
       " 'Glasgow International Airport',\n",
       " 'Port of Spain, Piarco International Airport',\n",
       " 'San Jose, Juan Santamaria International Airport',\n",
       " 'Lima, Jorge Chavez International Airport',\n",
       " 'Quebec Jean Lesage International Airport',\n",
       " 'Addis Ababa Bole International Airport',\n",
       " 'Sao Paulo, Guarulhos - Governador Andras Franco Montoro International Airport',\n",
       " 'Jose Marti International Airport',\n",
       " 'Jinnah International Airport',\n",
       " 'Saskatoon John G. Diefenbaker International Airport',\n",
       " 'Memphis International Airport',\n",
       " 'Philip S. W. Goldson International Airport',\n",
       " 'King Abdulaziz International Airport',\n",
       " 'Francisco de Sa Carneiro Airport',\n",
       " 'Moscow, Sheremetyevo International Airport',\n",
       " 'Daniel Oduber Quiros International Airport',\n",
       " 'Sarasota Bradenton International Airport',\n",
       " 'Regina International Airport',\n",
       " \"St. John's International Airport\",\n",
       " 'Alama Iqbal International Airport',\n",
       " 'Licenciado Manuel Crescencio Rejon Int Airport',\n",
       " 'Owen Roberts International Airport',\n",
       " 'Cozumel International Airport',\n",
       " 'Cairo International Airport',\n",
       " 'Gregorio Luperon International Airport',\n",
       " 'Samaná El Catey International Airport',\n",
       " 'Juan Gualberto Gomez International Airport',\n",
       " 'General Rafael Buelna International Airport',\n",
       " 'Winnipeg / James Armstrong Richardson International Airport',\n",
       " 'Rafael Nuñez International Airport',\n",
       " 'Cheddi Jagan International Airport',\n",
       " 'George Town, Exuma International Airport',\n",
       " 'London Airport',\n",
       " 'Curacao, Hato International Airport',\n",
       " 'Islamabad, Benazir Bhutto International Airport',\n",
       " 'Vnukovo International Airport',\n",
       " 'Fort McMurray Airport',\n",
       " 'Abel Santamaria Airport',\n",
       " 'Sault Ste Marie Airport',\n",
       " 'Sudbury Airport',\n",
       " 'Deer Lake Airport',\n",
       " 'Timmins/Victor M. Power',\n",
       " 'Sydney / J.A. Douglas McCurdy Airport',\n",
       " 'Kingston Norman Rogers Airport',\n",
       " 'Chris Hadfield Airport',\n",
       " 'Saint John Airport',\n",
       " 'North Bay Airport',\n",
       " 'Charlottetown Airport',\n",
       " 'Greater Moncton International Airport',\n",
       " 'Hewanorra International Airport',\n",
       " 'Antonio Maceo International Airport',\n",
       " 'Frank Pais International Airport',\n",
       " 'Augusto C. Sandino (Managua) International Airport',\n",
       " 'Brandon Municipal Airport',\n",
       " 'Point Salines International Airport',\n",
       " 'Gander International Airport',\n",
       " 'Jardines Del Rey Airport',\n",
       " 'Kelowna International Airport',\n",
       " 'Bahías de Huatulco International Airport',\n",
       " 'Fredericton Airport',\n",
       " 'Windsor Airport',\n",
       " 'Thunder Bay Airport',\n",
       " 'Ignacio Agramonte International Airport',\n",
       " 'Sierra Maestra Airport',\n",
       " 'El Paso International Airport',\n",
       " 'The Eastern Iowa Airport',\n",
       " 'Brisbane International Airport',\n",
       " 'Melbourne International Airport',\n",
       " 'Santa Fe',\n",
       " 'Stockholm-Arlanda Airport',\n",
       " 'Portland International Jetport Airport',\n",
       " 'Nanjing Lukou Airport',\n",
       " 'Wichita Mid Continent Airport',\n",
       " 'Hilo International Airport',\n",
       " 'La Aurora Airport',\n",
       " 'Jesus Teran International Airport',\n",
       " 'General Mariano Escobedo International Airport',\n",
       " 'Tulsa International Airport',\n",
       " 'Durango La Plata County Airport',\n",
       " 'General Leobardo C. Ruiz International Airport',\n",
       " 'Eagle County Regional Airport',\n",
       " 'Xiamen Gaoqi International Airport',\n",
       " 'Grand Junction Regional Airport',\n",
       " \"Shenzhen Bao'an International Airport\",\n",
       " 'Mc Clellan-Palomar Airport',\n",
       " 'Licenciado y General Ignacio Lopez Rayon Airport',\n",
       " 'General Ignacio P. Garcia International Airport',\n",
       " 'Rarotonga International Airport',\n",
       " 'Ernest A. Love Field',\n",
       " 'Riyadh, King Khaled International Airport',\n",
       " 'Yaoqiang Airport',\n",
       " 'Kingman Airport',\n",
       " 'Springfield Branson National Airport',\n",
       " 'Merced Regional Macready Field',\n",
       " 'Yuma MCAS/Yuma International Airport',\n",
       " 'Provo Municipal Airport',\n",
       " 'Bellingham International Airport',\n",
       " 'Xoxocotlán International Airport',\n",
       " 'Santa Maria Pub/Capt G Allan Hancock Field',\n",
       " 'Imperial County Airport',\n",
       " \"Tahiti Faa'a International Airport\",\n",
       " 'Changsha Huanghua International Airport',\n",
       " 'Chongqing Jiangbei International Airport',\n",
       " 'Mactan Cebu International Airport',\n",
       " 'Visalia Municipal Airport',\n",
       " 'General Guadalupe Victoria International Airport',\n",
       " 'Loreto International Airport',\n",
       " 'Ixtapa Zihuatanejo International Airport',\n",
       " 'Playa De Oro International Airport',\n",
       " 'Missoula International Airport',\n",
       " 'Geneva-Cointrin International Airport',\n",
       " 'Suvarnabhumi Bangkok International Airport',\n",
       " 'Milan, Malpensa International Airport',\n",
       " 'Zagreb Airport',\n",
       " 'Gothenburg-Landvetter Airport',\n",
       " 'Paris, Orly Airport',\n",
       " 'Menorca Airport',\n",
       " 'Moscow, Domodedovo International Airport',\n",
       " 'Malaga Airport',\n",
       " 'Riga International Airport',\n",
       " 'Alicante International Airport',\n",
       " 'Astana International Airport',\n",
       " 'Tallinn Airport',\n",
       " 'Split Airport',\n",
       " 'Henri Coanda International Airport',\n",
       " 'Pulkovo Airport',\n",
       " 'Palma De Mallorca Airport',\n",
       " \"Nice-Cote d'Azur Airport\",\n",
       " 'Ibiza Airport',\n",
       " 'Priština International Airport',\n",
       " 'John Paul II International Airport Kraków-Balice Airport',\n",
       " 'Ljubljana Jože Pučnik Airport',\n",
       " 'Chubu Centrair International Airport',\n",
       " 'Gdańsk Lech Wałęsa Airport',\n",
       " 'Burgas Airport',\n",
       " 'Hamburg Airport',\n",
       " 'Chania International Airport',\n",
       " 'Minsk International Airport',\n",
       " 'Ioannis Kapodistrias International Airport',\n",
       " 'Adnan Menderes International Airport',\n",
       " 'Varna Airport',\n",
       " 'Vilnius International Airport',\n",
       " 'Antalya International Airport',\n",
       " 'Dubrovnik Airport',\n",
       " 'Boryspil International Airport',\n",
       " 'Kajaani Airport',\n",
       " 'Kruunupyy Airport',\n",
       " 'Norrköping Airport',\n",
       " 'Cherepovets Airport',\n",
       " 'Kemi-Tornio Airport',\n",
       " 'Turku Airport',\n",
       " 'Tartu Airport',\n",
       " 'Mariehamn Airport',\n",
       " 'Oulu Airport',\n",
       " 'Kuopio Airport',\n",
       " 'Rovaniemi Airport',\n",
       " 'Tampere-Pirkkala Airport',\n",
       " 'Vaasa Airport',\n",
       " 'Gazipaşa Airport',\n",
       " 'Kaunas International Airport',\n",
       " 'Stockholm Västerås Airport',\n",
       " 'Kuusamo Airport',\n",
       " 'Pori Airport',\n",
       " 'Stockholm-Bromma Airport',\n",
       " 'Kittila Airport',\n",
       " 'Koltsovo Airport',\n",
       " 'Joensuu Airport',\n",
       " 'Jyvaskyla Airport',\n",
       " 'Savonlinna Airport',\n",
       " 'Ovda International Airport',\n",
       " 'Enontekio Airport',\n",
       " 'Kuala Lumpur International Airport',\n",
       " 'Bilbao Airport',\n",
       " 'Ho Chi Minh City, Tan Son Nhat International Airport',\n",
       " 'Chennai International Airport',\n",
       " 'Bologna Guglielmo Marconi Airport',\n",
       " 'Rio de Janeiro ,Galeao Antonio Carlos Jobim International Airport',\n",
       " 'Sofia Airport',\n",
       " 'Muscat International Airport',\n",
       " 'Bahrain International Airport',\n",
       " 'Edinburgh Airport',\n",
       " 'Luxembourg-Findel International Airport',\n",
       " 'Gibraltar Airport',\n",
       " 'Tunis Carthage International Airport',\n",
       " 'Johannesburg, OR Tambo International Airport',\n",
       " 'Soekarno-Hatta International Airport',\n",
       " 'Aberdeen Dyce Airport',\n",
       " 'Newcastle Airport',\n",
       " 'Malta International Airport',\n",
       " 'Leeds Bradford Airport',\n",
       " 'Stavanger Airport',\n",
       " 'Belgrade Nikola Tesla Airport',\n",
       " 'Kotoka International Airport',\n",
       " 'Linate Airport',\n",
       " 'Faro Airport',\n",
       " 'Marseille Provence Airport',\n",
       " 'Nantes Atlantique Airport',\n",
       " 'Santorini Airport',\n",
       " 'Almaty Airport',\n",
       " 'Hannover Airport',\n",
       " 'Osmany International Airport',\n",
       " 'Cork Airport',\n",
       " 'Lungi International Airport',\n",
       " 'Mohammed V International Airport',\n",
       " 'Lyon Saint-Exupery Airport',\n",
       " 'Quatro de Fevereiro Airport',\n",
       " 'Tashkent International Airport',\n",
       " 'Rotterdam Airport',\n",
       " 'Sir Seewoosagur Ramgoolam International Airport',\n",
       " 'Dhaka / Hazrat Shahjalal International Airport',\n",
       " 'Colombo, Bandaranaike International Airport',\n",
       " 'Hyderabad, Rajiv Gandhi International Airport',\n",
       " 'EuroAirport Basle-Mulhouse-Freiburg Airport',\n",
       " 'Innsbruck Airport',\n",
       " 'Bengaluru International Airport',\n",
       " 'Cape Town International Airport',\n",
       " 'Nnamdi Azikiwe International Airport',\n",
       " 'Inverness Airport',\n",
       " 'Nairobi, Jomo Kenyatta International Airport',\n",
       " 'Ashgabat Airport',\n",
       " 'Heydar Aliyev International Airport',\n",
       " 'Buenos Aires, Ministro Pistarini International Airport',\n",
       " 'Entebbe International Airport',\n",
       " 'Ibn Batouta Airport',\n",
       " 'Larnaca International Airport',\n",
       " 'Tripoli International Airport',\n",
       " 'San Javier Airport',\n",
       " 'Kuwait International Airport',\n",
       " 'Stuttgart Airport',\n",
       " 'Pisa International Airport',\n",
       " 'Lagos,Murtala Muhammed International Airport',\n",
       " 'Luxor International Airport',\n",
       " 'Queen Alia International Airport',\n",
       " 'Bergen Airport Flesland',\n",
       " 'Algiers, Houari Boumediene Airport',\n",
       " 'George Best Belfast City Airport',\n",
       " 'Beirut Rafic Hariri International Airport',\n",
       " 'Mikonos Airport',\n",
       " 'Rijeka Airport',\n",
       " 'Toulouse-Blagnac Airport',\n",
       " 'A Coruna Airport',\n",
       " 'Imam Khomeini International Airport',\n",
       " 'Al Maktoum International Airport',\n",
       " 'Billund Airport',\n",
       " 'Brindisi – Salento Airport',\n",
       " 'Montpellier-Méditerranée Airport',\n",
       " 'Sardar Vallabhbhai Patel International Airport',\n",
       " 'Pula Airport',\n",
       " 'Louisville International Standiford Field',\n",
       " 'Midland International Airport',\n",
       " 'Birmingham-Shuttlesworth International Airport',\n",
       " 'Simon Bolivar International Airport',\n",
       " 'Rapid City Regional Airport',\n",
       " 'Blue Grass Airport',\n",
       " 'Abilene Regional Airport',\n",
       " 'Texarkana Regional Webb Field',\n",
       " 'Corpus Christi International Airport',\n",
       " 'General Wayne A. Downing Peoria International Airport',\n",
       " 'Brownsville South Padre Island International Airport',\n",
       " 'Baton Rouge Metropolitan, Ryan Field',\n",
       " 'Central Illinois Regional Airport at Bloomington-Normal',\n",
       " 'Columbia Metropolitan Airport',\n",
       " 'University of Illinois Willard Airport',\n",
       " 'Fort Wayne International Airport',\n",
       " 'Evansville Regional Airport',\n",
       " 'Garden City Regional Airport',\n",
       " 'Fort Smith Regional Airport',\n",
       " 'Jackson-Medgar Wiley Evers International Airport',\n",
       " 'Easterwood Field',\n",
       " 'Gulfport Biloxi International Airport',\n",
       " 'Lafayette Regional Airport',\n",
       " 'Gerald R. Ford International Airport',\n",
       " 'Piedmont Triad International Airport',\n",
       " 'Dane County Regional Truax Field',\n",
       " 'Laredo International Airport',\n",
       " 'Greenville Spartanburg International Airport',\n",
       " 'Joplin Regional Airport',\n",
       " 'Joe Foss Field Airport',\n",
       " 'Monroe Regional Airport',\n",
       " 'Lake Charles Regional Airport',\n",
       " 'East Texas Regional Airport',\n",
       " 'Pensacola Regional Airport',\n",
       " 'Coxen Hole, Juan Manuel Galvez International Airport',\n",
       " 'Mobile Regional Airport',\n",
       " 'Quad City International Airport',\n",
       " 'McGhee Tyson Airport',\n",
       " 'San Angelo Regional Mathis Field',\n",
       " 'Shreveport Regional Airport',\n",
       " 'Sheppard Air Force Base-Wichita Falls Municipal Airport',\n",
       " 'Eglin Air Force Base',\n",
       " 'Billings Logan International Airport',\n",
       " 'Waco Regional Airport',\n",
       " 'Tallahassee Regional Airport',\n",
       " 'Lovell Field',\n",
       " 'Columbia Regional Airport',\n",
       " 'Des Moines International Airport',\n",
       " 'James M Cox Dayton International Airport',\n",
       " 'Rick Husband Amarillo International Airport',\n",
       " 'Mariscal Sucre International Airport',\n",
       " 'Lawton Fort Sill Regional Airport',\n",
       " 'Hattiesburg Laurel Regional Airport',\n",
       " 'Hermanos Serdán International Airport',\n",
       " 'Central Nebraska Regional Airport',\n",
       " 'Robert Gray  Army Air Field Airport',\n",
       " 'Mc Allen Miller International Airport',\n",
       " 'Sioux Gateway Col. Bud Day Field',\n",
       " 'Little Rock, Bill and Hillary Clinton National Airport/Adams Field',\n",
       " 'Branson Airport',\n",
       " 'Huntsville International Carl T Jones Field',\n",
       " 'Lubbock Preston Smith International Airport',\n",
       " 'Bismarck Municipal Airport',\n",
       " 'Southeast Texas Regional Airport',\n",
       " 'Alexandria International Airport',\n",
       " 'General Roberto Fierro Villalobos International Airport',\n",
       " 'Hector International Airport',\n",
       " 'Montgomery Regional (Dannelly Field) Airport',\n",
       " 'Manhattan Regional Airport',\n",
       " 'Querétaro Intercontinental Airport',\n",
       " 'Roswell International Air Center Airport',\n",
       " 'Ponciano Arriaga International Airport',\n",
       " 'Abraham Lincoln Capital Airport',\n",
       " 'Francisco Sarabia International Airport',\n",
       " 'Tyler Pounds Regional Airport',\n",
       " 'Key Field',\n",
       " 'Mid Delta Regional Airport',\n",
       " 'Cavern City Air Terminal',\n",
       " 'Gunnison Crested Butte Regional Airport',\n",
       " 'Cherry Capital Airport',\n",
       " 'Clovis Municipal Airport',\n",
       " 'Stillwater Regional Airport',\n",
       " 'Alice Springs Airport',\n",
       " 'Christchurch International Airport',\n",
       " 'Darwin International Airport',\n",
       " 'Bali - Ngurah Rai International Airport',\n",
       " 'Canberra International Airport',\n",
       " 'Cairns International Airport',\n",
       " 'Perth International Airport',\n",
       " 'Wellington International Airport',\n",
       " 'Adelaide International Airport',\n",
       " 'Port Moresby Jacksons International Airport',\n",
       " 'La Tontouta International Airport',\n",
       " 'Townsville Airport',\n",
       " 'Hervey Bay Airport',\n",
       " 'Gladstone Airport',\n",
       " 'Port Vila Bauerfield Airport',\n",
       " 'Karratha Airport',\n",
       " 'Queenstown International Airport',\n",
       " 'Mackay Airport',\n",
       " 'Orange Airport',\n",
       " 'Broome International Airport',\n",
       " 'Lord Howe Island Airport',\n",
       " 'Moree Airport',\n",
       " 'Port Macquarie Airport',\n",
       " 'Launceston Airport',\n",
       " 'Port Hedland International Airport',\n",
       " 'Proserpine Whitsunday Coast Airport',\n",
       " 'Coffs Harbour Airport',\n",
       " 'Honiara International Airport',\n",
       " 'Bundaberg Airport',\n",
       " 'Charleville Airport',\n",
       " 'Mount Isa Airport',\n",
       " 'Rockhampton Airport',\n",
       " 'Cloncurry Airport',\n",
       " 'Longreach Airport',\n",
       " 'Emerald Airport',\n",
       " 'Roma Airport',\n",
       " 'Bonriki International Airport',\n",
       " 'Nauru International Airport',\n",
       " 'Armidale Airport',\n",
       " 'Hamilton Island Airport',\n",
       " 'Albury Airport',\n",
       " 'Hobart International Airport',\n",
       " 'Dubbo City Regional Airport',\n",
       " 'Norfolk Island International Airport',\n",
       " 'Tamworth Airport',\n",
       " 'Trepell Airport',\n",
       " 'Taroom Airport',\n",
       " 'Thangool Airport',\n",
       " 'Brisbane West Wellcamp Airport',\n",
       " 'Ballera Airport',\n",
       " 'Narrabri Airport',\n",
       " 'Chinchilla Airport',\n",
       " 'Santo Pekoa International Airport',\n",
       " 'Moranbah Airport',\n",
       " 'Phuket International Airport',\n",
       " 'Noi Bai International Airport',\n",
       " 'Kaohsiung International Airport',\n",
       " 'Malé International Airport',\n",
       " 'Haikou Meilan International Airport',\n",
       " 'Nanning Wuxu Airport',\n",
       " 'Longdongbao Airport',\n",
       " 'Zhoushuizi Airport',\n",
       " 'Gimhae International Airport',\n",
       " 'Saipan International Airport',\n",
       " 'Gimpo International Airport',\n",
       " 'Ningbo Lishe International Airport',\n",
       " 'Chiang Mai International Airport',\n",
       " 'Jeju International Airport',\n",
       " 'Shanghai Hongqiao International Airport',\n",
       " 'Longjia Airport',\n",
       " 'Sapporo, New Chitose Airport',\n",
       " 'Vladivostok International Airport',\n",
       " 'Naha Airport',\n",
       " 'Fuzhou Changle International Airport',\n",
       " 'Zhengzhou Xinzheng International Airport',\n",
       " 'Yangon International Airport',\n",
       " 'Taoxian Airport',\n",
       " 'Macau International Airport',\n",
       " 'Sanya Phoenix International Airport',\n",
       " 'Khabarovsk-Novy Airport',\n",
       " 'Daegu Airport',\n",
       " 'Mudanjiang Hailang International Airport',\n",
       " 'Yanji Chaoyangchuan Airport',\n",
       " 'Lhasa Gonggar Airport',\n",
       " 'Jinggangshan Airport',\n",
       " 'Yantai Laishan Airport',\n",
       " 'Irkutsk Airport',\n",
       " 'Taiyuan Wusu Airport',\n",
       " 'Qiqihar Sanjiazi Airport',\n",
       " 'Yakutsk Airport',\n",
       " 'Ulan-Ude Airport (Mukhino)',\n",
       " 'Sunan International Airport',\n",
       " 'Lanzhou Zhongchuan Airport',\n",
       " 'Shantou Waisha Airport',\n",
       " 'Dongshan Airport',\n",
       " 'Yemelyanovo Airport',\n",
       " 'Lijiang Airport',\n",
       " 'Sunan Shuofang International Airport',\n",
       " 'Changbaishan Airport',\n",
       " 'Chifeng Airport',\n",
       " 'Baita International Airport',\n",
       " 'Tongliao Airport',\n",
       " 'Ulanhot Airport',\n",
       " 'Dongying Shengli Airport',\n",
       " 'Yuncheng Guangong Airport',\n",
       " 'Yinchuan Airport',\n",
       " 'Qianjiang Wulingshan Airport',\n",
       " 'Lianyungang Airport',\n",
       " 'Xining Caojiabu Airport',\n",
       " 'Yulin Airport',\n",
       " 'Huangyan Luqiao Airport',\n",
       " 'Quanzhou Airport',\n",
       " 'Tunxi International Airport',\n",
       " 'Dachuan Airport',\n",
       " 'Nantong Airport',\n",
       " 'Wuhai Airport',\n",
       " 'Baotou Airport',\n",
       " 'Guilin Liangjiang International Airport',\n",
       " 'Zhanjiang Airport',\n",
       " 'Luoyang Airport',\n",
       " 'Yichang Airport',\n",
       " 'Mangshi Airport',\n",
       " \"Yan'an Airport\",\n",
       " 'Changzhou Airport',\n",
       " 'Zhongwei Shapotou Airport',\n",
       " 'Shubuling Airport',\n",
       " 'Fuyang Xiguan Airport',\n",
       " 'Zhoushan Airport',\n",
       " 'Jiujiang Lushan Airport',\n",
       " 'Guangyuan Airport',\n",
       " 'Saertu Airport',\n",
       " 'Beihai Airport',\n",
       " 'Dayong Airport',\n",
       " 'Jining Qufu Airport',\n",
       " 'Weifang Airport',\n",
       " 'Wenzhou Yongqiang Airport',\n",
       " 'Changde Airport',\n",
       " 'Hefei Luogang International Airport',\n",
       " 'Baoshan Yunduan Airport',\n",
       " 'Chinggis Khaan International Airport',\n",
       " 'Korla Airport',\n",
       " 'Siem Reap International Airport',\n",
       " 'Jixi Xingkaihu Airport',\n",
       " 'Kalibo International Airport',\n",
       " 'Tolmachevo Airport',\n",
       " 'Nanchang Changbei International Airport',\n",
       " 'Ürümqi Diwopu International Airport',\n",
       " 'Mattala Rajapaksa International Airport',\n",
       " 'Dali Airport',\n",
       " 'Muan International Airport',\n",
       " 'Cheongju International Airport',\n",
       " 'Taiping Airport',\n",
       " 'Jiamusi Airport',\n",
       " 'Zunyi Xinzhou Airport',\n",
       " 'Rizhao Shanzihe Airport',\n",
       " 'Karamay Airport',\n",
       " 'Wanxian Airport',\n",
       " 'Mingyueshan Airport',\n",
       " 'Manzhouli Xijiao Airport',\n",
       " 'Yibin Caiba Airport',\n",
       " 'Hami Airport',\n",
       " 'Mianyang Airport',\n",
       " 'Ulanqab Airport',\n",
       " 'Bayannur Tianjitai Airport',\n",
       " 'Liupanshui Yuezhao Airport',\n",
       " 'Luliang Airport',\n",
       " 'Weihai Airport',\n",
       " 'Shiyan Wudangshan Airport',\n",
       " 'Dandong Airport',\n",
       " 'Lianshui Airport',\n",
       " 'Changzhi Airport',\n",
       " 'Ordos Ejin Horo Airport',\n",
       " 'Datong Airport',\n",
       " 'Erenhot Saiwusu International Airport',\n",
       " 'Xilinhot Airport',\n",
       " 'Zhuhai Airport',\n",
       " 'Bailian Airport',\n",
       " 'Xiangfan Airport',\n",
       " 'Anqing Airport',\n",
       " 'Ganzhou Airport',\n",
       " 'Jingdezhen Airport',\n",
       " 'Nanping Wuyishan Airport',\n",
       " 'Yancheng Airport',\n",
       " 'Yiwu Airport',\n",
       " 'Luzhou Airport',\n",
       " 'Chaoyang Airport',\n",
       " 'Anshan Air Base',\n",
       " 'Nanchong Airport',\n",
       " 'Tongren Fenghuang Airport',\n",
       " 'Taizhou Airport',\n",
       " 'Tonghua Sanyuanpu Airport',\n",
       " 'Gold Coast Airport',\n",
       " 'Sunshine Coast Airport',\n",
       " 'Brunei International Airport',\n",
       " 'Devonport Airport',\n",
       " 'Wagga Wagga City Airport',\n",
       " 'King Island Airport',\n",
       " 'Mount Gambier Airport',\n",
       " 'Mildura Airport',\n",
       " 'Kalgoorlie Boulder Airport',\n",
       " 'Wynyard Airport',\n",
       " 'Merimbula Airport',\n",
       " 'Ballina Byron Gateway Airport',\n",
       " 'London City Airport',\n",
       " 'Verona Villafranca Airport',\n",
       " 'Gran Canaria Airport',\n",
       " 'Eindhoven Airport',\n",
       " 'Southampton Airport',\n",
       " 'Tobago-Crown Point Airport',\n",
       " 'Funchal, Madeira Airport',\n",
       " 'Jersey Airport',\n",
       " 'Bremen Airport',\n",
       " 'Isle of Man Airport',\n",
       " 'Almería International Airport',\n",
       " 'Ireland West Knock Airport',\n",
       " 'Lanzarote Airport',\n",
       " 'Rabil Airport',\n",
       " 'Fuerteventura Airport',\n",
       " 'Nuremberg Airport',\n",
       " 'Sharm El Sheikh International Airport',\n",
       " 'Kos Airport',\n",
       " 'Menara Airport',\n",
       " 'Heraklion International Nikos Kazantzakis Airport',\n",
       " 'Thessaloniki Macedonia International Airport',\n",
       " 'Catania-Fontanarossa Airport',\n",
       " 'Milas Bodrum International Airport',\n",
       " 'Enfidha - Hammamet International Airport',\n",
       " 'Hurghada International Airport',\n",
       " 'Béziers-Vias Airport',\n",
       " 'Valencia Airport',\n",
       " 'Aktion National Airport',\n",
       " 'Naples International Airport',\n",
       " 'Olbia Costa Smeralda Airport',\n",
       " 'Turin Airport',\n",
       " 'Dalaman International Airport',\n",
       " 'Federico Garcia Lorca Airport',\n",
       " 'Al Massira Airport',\n",
       " 'Norwich International Airport',\n",
       " 'Reus Air Base',\n",
       " 'Waterford Airport',\n",
       " 'Brussels South Charleroi Airport',\n",
       " 'Rzeszów-Jasionka Airport',\n",
       " 'Girona Airport',\n",
       " 'Vincenzo Florio Airport Trapani-Birgi',\n",
       " 'Zakynthos, Dionysios Solomos Airport',\n",
       " 'Rhodes, Diagoras Airport',\n",
       " 'Guernsey Airport',\n",
       " 'Ciampino–G. B. Pastine International Airport',\n",
       " 'Moss Airport, Rygge',\n",
       " 'Paris Beauvais Tillé Airport',\n",
       " 'Copernicus Wroclaw Airport',\n",
       " 'Dabolim Airport',\n",
       " 'Carcassonne Airport',\n",
       " 'Berlin-Schönefeld International Airport',\n",
       " 'Belfast International Airport',\n",
       " 'Newquay Cornwall Airport',\n",
       " 'Sandefjord Airport, Torp',\n",
       " 'Tenerife South Airport',\n",
       " 'Amílcar Cabral International Airport',\n",
       " 'Paphos International Airport',\n",
       " 'Exeter International Airport',\n",
       " 'Modlin Airport',\n",
       " 'Zemunik Airport',\n",
       " 'Il Caravaggio International Airport',\n",
       " 'M. R. Štefánik Airport',\n",
       " 'Chambéry-Savoie Airport',\n",
       " 'Grenoble Alpes-Isère Airport',\n",
       " 'Calicut International Airport',\n",
       " 'Birmingham International Airport',\n",
       " 'Kolkata, Netaji Subhash Chandra Bose International Airport',\n",
       " 'Seychelles International Airport',\n",
       " 'Kilimanjaro International Airport',\n",
       " 'King Fahd International Airport',\n",
       " \"Sana'a International Airport\",\n",
       " 'Sabiha Gökçen International Airport',\n",
       " 'Kathmandu, Tribhuvan International Airport',\n",
       " 'Sharjah International Airport',\n",
       " 'Zvartnots International Airport',\n",
       " 'Djibouti-Ambouli Airport',\n",
       " 'Khartoum International Airport',\n",
       " 'Esenboğa International Airport',\n",
       " 'Hosea Kutako International Airport',\n",
       " 'Borg El Arab International Airport',\n",
       " 'Skopje Alexander the Great Airport',\n",
       " 'Basrah International Airport',\n",
       " 'Gassim/Prince Nayef bin Abdulaziz Regional Airport',\n",
       " 'Yenbo - Prince Abdul Mohsin Bin Airport',\n",
       " 'Prince Mohammad Bin Abdulaziz Airport',\n",
       " 'Mashhad International Airport',\n",
       " 'Lar Airport',\n",
       " 'Peshawar International Airport',\n",
       " 'Al Najaf International Airport',\n",
       " 'Baghdad International Airport',\n",
       " 'Abha Regional Airport',\n",
       " 'Sri Guru Ram Dass Jee International Airport',\n",
       " 'Dr. Babasaheb Ambedkar International Airport',\n",
       " 'Sialkot Airport',\n",
       " 'Erbil International Airport',\n",
       " 'Tbilisi International Airport',\n",
       " 'Mangalore International Airport',\n",
       " 'Abeid Amani Karume International Airport',\n",
       " 'Krabi Airport',\n",
       " 'Clark International Airport',\n",
       " 'Aden International Airport',\n",
       " 'Cochin International Airport',\n",
       " 'Trivandrum International Airport',\n",
       " 'Al Ahsa Airport',\n",
       " 'Faisalabad International Airport',\n",
       " 'Julius Nyerere International Airport',\n",
       " 'Ras Al Khaimah International Airport',\n",
       " 'Sohar Airport',\n",
       " 'Ta’if Regional Airport',\n",
       " 'Damascus International Airport',\n",
       " 'Shiraz Shahid Dastghaib International Airport',\n",
       " 'Salalah Airport',\n",
       " 'Multan International Airport',\n",
       " 'Sulaymaniyah International Airport',\n",
       " 'Shah Amanat International Airport',\n",
       " 'Maputo Airport',\n",
       " 'Sukkur Airport',\n",
       " 'Tenerife Norte Airport',\n",
       " 'East Midlands Airport',\n",
       " 'Genoa Cristoforo Colombo Airport',\n",
       " 'Venice, Treviso-Sant Angelo Airport',\n",
       " 'Liverpool John Lennon Airport',\n",
       " 'London Luton Airport',\n",
       " 'Sevilla Airport',\n",
       " 'London Stansted Airport',\n",
       " 'Bern Belp Airport',\n",
       " 'Brest Bretagne Airport',\n",
       " 'Santiago de Compostela Airport',\n",
       " 'Bari Karol Wojtyła Airport',\n",
       " 'Falcone–Borsellino Airport',\n",
       " 'Peretola Airport',\n",
       " 'Cardiff International Airport',\n",
       " 'La Palma Airport',\n",
       " 'Dortmund Airport',\n",
       " 'Leipzig Halle Airport',\n",
       " 'Katowice International Airport',\n",
       " 'London Southend Airport',\n",
       " 'Rennes-Saint-Jacques Airport',\n",
       " 'Poznań-Ławica Airport',\n",
       " 'Jerez Airport',\n",
       " 'Chişinău International Airport',\n",
       " 'Bristol International Airport',\n",
       " 'Asturias Airport',\n",
       " 'Badajoz Airport',\n",
       " 'San Sebastian Airport',\n",
       " 'Lille-Lesquin Airport',\n",
       " 'Dresden Airport',\n",
       " 'Banjul International Airport',\n",
       " 'Antwerp International Airport (Deurne)',\n",
       " 'Kiev Zhuliany International Airport',\n",
       " 'Saïss Airport',\n",
       " 'Aalborg Airport',\n",
       " 'Leon Airport',\n",
       " 'Glasgow Prestwick Airport',\n",
       " 'Bordeaux-Mérignac Airport',\n",
       " 'Nador International Airport',\n",
       " 'Léopold Sédar Senghor International Airport',\n",
       " 'Lublin Airport',\n",
       " 'Craiova Airport',\n",
       " 'Es Senia Airport',\n",
       " 'Vigo Airport',\n",
       " 'Santander Airport',\n",
       " 'Cluj-Napoca International Airport',\n",
       " 'Timişoara Traian Vuia Airport',\n",
       " 'Iaşi Airport',\n",
       " 'Stockholm Skavsta Airport',\n",
       " 'Burgos Airport',\n",
       " 'Salamanca Airport',\n",
       " 'Valladolid Airport',\n",
       " 'Trondheim Airport, Værnes',\n",
       " 'Tromsø Airport',\n",
       " 'Salzburg Airport',\n",
       " 'Ajaccio-Napoléon Bonaparte Airport',\n",
       " 'Strasbourg Airport',\n",
       " 'Erfurt Airport',\n",
       " 'Kefallinia Airport',\n",
       " 'Ålesund Airport',\n",
       " 'Kigali International Airport',\n",
       " 'Limoges Airport',\n",
       " 'Ivalo Airport',\n",
       " 'Oued Irara Airport',\n",
       " 'Tirana International Airport Mother Teresa',\n",
       " 'Bastia-Poretta Airport',\n",
       " 'Kalamata Airport',\n",
       " 'Tivat Airport',\n",
       " 'Tianjin Binhai International Airport',\n",
       " 'Östersund Airport',\n",
       " 'Faleolo International Airport',\n",
       " \"Fua'amotu International Airport\",\n",
       " 'Nelson Airport',\n",
       " 'Woodbourne Airport',\n",
       " 'Napier Airport',\n",
       " 'Nausori International Airport',\n",
       " 'Gisborne Airport',\n",
       " 'Palmerston North Airport',\n",
       " 'Kaitaia Airport',\n",
       " 'Hamilton International Airport',\n",
       " 'Kerikeri Airport',\n",
       " 'New Plymouth Airport',\n",
       " 'Paraparaumu Airport',\n",
       " 'Whakatane Airport',\n",
       " 'Whangarei Airport',\n",
       " 'Taupo Airport',\n",
       " 'Dunedin Airport',\n",
       " 'Rotorua Regional Airport',\n",
       " 'Tauranga Airport',\n",
       " 'Wanganui Airport',\n",
       " 'Clermont-Ferrand Auvergne Airport',\n",
       " 'Presidente Juscelino Kubistschek International Airport',\n",
       " 'Podgorica Airport',\n",
       " 'Douala International Airport',\n",
       " 'Lomé-Tokoin Airport',\n",
       " 'Senou Airport',\n",
       " \"N'Djamena International Airport\",\n",
       " 'Conakry Airport',\n",
       " 'Djerba Zarzis International Airport',\n",
       " 'Diori Hamani International Airport',\n",
       " 'Maya-Maya Airport',\n",
       " 'Nouakchott International Airport',\n",
       " 'Ndjili International Airport',\n",
       " 'Pau Pyrénées Airport',\n",
       " 'Mohamed Boudiaf International Airport',\n",
       " \"Bangui M'Poko International Airport\",\n",
       " 'Roland Garros Airport',\n",
       " 'Calvi-Sainte-Catherine Airport',\n",
       " 'Cadjehoun Airport',\n",
       " 'Monastir Habib Bourguiba International Airport',\n",
       " 'Yaoundé Nsimalen International Airport',\n",
       " 'Rabat-Salé Airport',\n",
       " 'Pointe Noire Airport',\n",
       " 'Cagliari Elmas Airport',\n",
       " 'Robin Hood Doncaster Sheffield Airport',\n",
       " 'Batna Airport',\n",
       " 'Biskra Airport',\n",
       " 'Annaba Airport',\n",
       " 'Ouagadougou Airport',\n",
       " 'Port Bouet Airport',\n",
       " 'Sfax Thyna International Airport',\n",
       " 'Ivato Airport',\n",
       " \"Libreville Leon M'ba International Airport\",\n",
       " 'Biarritz-Anglet-Bayonne Airport',\n",
       " 'Ostrava Leos Janáček Airport',\n",
       " 'Łódź Władysław Reymont Airport',\n",
       " 'Angads Airport',\n",
       " 'Phnom Penh International Airport',\n",
       " 'Penang International Airport',\n",
       " 'Fukuoka Airport',\n",
       " 'Samui Airport',\n",
       " 'Da Nang International Airport',\n",
       " 'Hat Yai International Airport',\n",
       " ...]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V(hkVertexId).out('route').in_('route').dedup().count().next()\n",
    "g.V(hkVertexId).out('route').in_('route').values('desc').dedup().fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Remove duplicates by number of runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['TMW', 4, 'PQQ', 2, 'LSY', 1, 'SYD', 3]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('region','AU-NSW').dedup().by('runways').values('code','runways').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Remove duplicates where there is the same A and C even if B is different__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': v[24624], 'b': v[4240], 'c': v[94344]}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).as_('a').V(sydneyVertexId).as_('c').both().as_('b').limit(10).dedup('a','c').select('a','b','c').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## where(), neq()\n",
    "\n",
    "Exclude the HK airport itself"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1879"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x2 = g.V(hkVertexId).as_('hk').out('route').in_('route').where(P.neq('hk')).dedup().count().next()\n",
    "assert x1 == x2 + 1\n",
    "x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## limit()\n",
    "Limit the amount of results to \"n\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[v[4240], v[4312], v[12320], v[12504], v[16392]]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "n = 5\n",
    "count = g.V(hkVertexId).out('route').limit(n).count().next()\n",
    "assert n == count\n",
    "x1 = g.V(hkVertexId).out('route').limit(n).fold().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## range()\n",
    "Equivalent to using a range starting from 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[v[4240], v[4312], v[12320], v[12504], v[16392]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x2 = g.V(hkVertexId).out('route').range(0, n).fold().next()\n",
    "x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Get the results from \"n\" to the end__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# x1 = g.V(hkVertexId).out('route').range(n, -1).fold().next()\n",
    "# x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## skip()\n",
    "Equivalent to skipping by \"n\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "# x2 = g.V(hkVertexId).out('route').skip(n).fold().next()\n",
    "# assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## tail()\n",
    "__Get the last \"n\" results__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[v[1790088], v[1794184], v[1806472], v[3383432], v[3395720]]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).out('route').tail(n).fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "There is no guarantee to the order of ranges, it is often based on order put into graph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## timeLimit()\n",
    "Limit the query to however much can be processed within 10 ms"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['HKG', 'SYD']"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).repeat(__.timeLimit(10).out()).until(__.has('code','SYD')).path().by('code').next()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
