{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 6. Select, Project\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import __\n",
    "from loader import hkVertexId\n",
    "from loader import sydneyVertexId"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## select()\n",
    "__Select the traversal of airports from HK that are 2 flights away__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': v[24624], 'b': v[4240], 'c': v[4104]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[4128]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[4144]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[4152]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[4232]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[4312]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[8240]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[8320]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[8328]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[8336]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[8408]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[12320]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[12336]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[12344]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[12416]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[12424]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[12432]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[12504]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[16392]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[16416]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[16432]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[16512]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[16520]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[20488]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[20512]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[20536]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[20608]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[20616]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[24624]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[24632]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[24712]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[24792]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[28728]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[28808]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[28888]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[32816]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[32824]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[32896]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[36912]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[36920]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[37000]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[37008]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[41096]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[45064]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[45112]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[45192]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[45200]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[49184]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[53256]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[53376]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[53384]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[57400]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[57472]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[57480]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[61488]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[61576]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[65672]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[65680]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[69768]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[69848]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[73776]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[73864]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[77880]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[82056]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[86152]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[86232]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[90248]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[94256]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[94344]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[98352]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[98360]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[98440]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[102448]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[102456]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[102536]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[106632]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[110640]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[114736]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[114744]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[118832]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[118840]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[122936]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[131080]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[131208]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[135224]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[135312]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[139320]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[143496]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[147464]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[155696]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[163888]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[163896]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[167984]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[180280]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[184376]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[188464]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[245816]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[258184]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[262280]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[262288]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[266376]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[278664]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[286856]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[307336]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[311344]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[315528]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[319496]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[319520]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[323592]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[323616]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[327712]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[327736]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[331808]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[336088]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[340184]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[344072]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[368768]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[409648]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[417840]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[434232]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[438328]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[442424]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[446520]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[467000]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[479368]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[491656]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[503944]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[524424]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[536712]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[667784]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[802952]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[807048]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[1007752]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[1011848]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[1015944]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[1020040]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[1024136]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[1028232]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[1040520]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[1069192]},\n",
       " {'a': v[24624], 'b': v[4240], 'c': v[1462280]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[4104]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[4128]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[4152]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[4232]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[4240]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[8200]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[8224]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[8240]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[8248]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[8320]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[8328]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[8336]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[8408]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[12320]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[12336]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[12344]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[12416]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[12424]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[12504]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[16416]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[16520]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[16600]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[20488]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[20512]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[20536]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[20608]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[20616]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[24584]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[24608]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[24624]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[24632]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[24712]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[28728]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[28808]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[28888]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[32816]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[32824]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[32904]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[36912]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[36920]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[37000]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[37008]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[41008]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[41096]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[45064]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[45112]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[45192]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[45200]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[49184]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[49200]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[49208]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[49288]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[53256]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[53376]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[53384]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[57400]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[57472]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[57480]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[61568]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[61576]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[61584]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[65568]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[65664]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[65672]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[69664]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[69768]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[69848]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[73760]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[73864]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[73872]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[77960]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[77968]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[86152]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[90248]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[94256]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[98360]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[98432]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[102536]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[106552]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[106624]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[110640]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[114744]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[118920]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[123016]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[127112]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[135224]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[135304]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[147464]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[147504]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[151680]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[155656]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[155792]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[159792]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[200712]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[208944]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[213024]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[213128]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[241720]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[245888]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[258184]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[262280]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[266376]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[282760]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[303160]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[315528]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[319624]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[323720]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[340104]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[389256]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[409736]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[417800]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[421896]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[421920]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[425992]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[430296]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[434304]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[434392]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[458888]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[503944]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[528440]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[532536]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[680072]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[696456]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[708744]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[757808]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[987272]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[1212552]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[1220744]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[1253512]},\n",
       " {'a': v[24624], 'b': v[4312], 'c': v[1257608]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[4104]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[4128]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[4152]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[4232]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[4240]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[4312]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[8240]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[8248]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[8320]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[8328]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[8336]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[8408]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[12336]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[12344]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[12416]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[12424]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[12432]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[12504]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[16416]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[16432]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[16520]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[16600]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[20488]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[20512]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[20536]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[20608]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[20616]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[20624]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[24608]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[24624]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[24632]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[24704]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[24712]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[28680]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[28720]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[28728]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[28808]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[28888]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[32816]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[32824]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[32904]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[32912]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[36912]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[36920]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[37000]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[37008]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[41016]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[41096]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[41176]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[45064]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[45112]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[45192]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[45200]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[49184]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[49208]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[49368]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[53256]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[53304]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[53376]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[53384]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[53464]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[57376]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[57392]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[57400]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[61472]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[61488]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[61568]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[61576]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[61584]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[65568]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[65664]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[65672]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[69664]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[69768]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[69848]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[73760]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[73776]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[73856]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[73864]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[77880]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[77968]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[81968]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[82048]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[86064]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[86072]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[86152]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[86160]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[86232]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[90248]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[90256]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[94256]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[94336]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[98352]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[98360]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[102448]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[102536]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[106544]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[106552]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[106624]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[106632]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[110640]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[114736]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[114744]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[118912]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[118920]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[123016]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[127024]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[127112]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[131208]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[135384]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[139320]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[147464]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[147592]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[147600]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[151680]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[155792]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[163872]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[172160]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[172168]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[180272]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[180280]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[196640]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[200712]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[200736]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[200752]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[209032]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[213000]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[213128]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[213208]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[217096]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[225328]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[233608]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[241720]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[245816]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[245888]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[254096]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[258176]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[258184]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[262280]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[282760]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[286856]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[295048]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[315528]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[319536]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[323720]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[336008]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[340104]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[356488]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[389256]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[417928]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[430128]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[442584]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[446472]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[446496]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[450568]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[450592]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[450688]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[454664]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[454688]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[454784]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[458760]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[458888]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[499760]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[503944]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[516152]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[528520]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[565304]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[651400]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[675976]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[684040]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[700552]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[815112]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[925832]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[1007752]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[1036424]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[1298568]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[1323144]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[1327240]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[1331336]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[1335432]},\n",
       " {'a': v[24624], 'b': v[12320], 'c': v[1482760]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[4104]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[4128]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[4144]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[4152]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[4232]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[4240]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[4312]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[8224]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[8240]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[8248]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[8320]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[8328]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[8336]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[8408]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[12296]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[12320]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[12336]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[12344]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[12416]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[12424]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[12432]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[16416]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[16432]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[16440]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[16520]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[16528]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[20488]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[20512]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[20528]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[20536]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[20608]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[20616]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[20696]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[24584]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[24608]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[24624]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[24632]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[24712]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[24792]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[28728]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[28808]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[28888]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[32816]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[32824]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[36896]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[36912]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[36920]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[37000]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[37008]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[41096]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[45064]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[45112]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[45192]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[45200]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[49184]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[49208]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[49288]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[49368]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[53256]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[53304]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[53376]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[53384]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[53464]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[57400]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[57472]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[57560]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[61488]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[61576]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[65568]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[65672]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[65680]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[69768]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[69848]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[73776]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[73856]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[73864]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[77880]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[77960]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[81968]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[82056]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[82064]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[86024]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[86072]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[86152]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[86160]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[86232]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[90248]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[94256]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[94344]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[98352]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[98360]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[102432]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[102448]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[102456]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[102536]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[106544]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[110640]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[110808]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[114736]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[114744]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[118832]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[118840]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[118912]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[118920]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[122888]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[122936]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[126984]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[127024]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[127032]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[131080]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[131208]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[135224]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[135304]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[135312]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[139296]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[139320]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[143496]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[147464]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[147592]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[147600]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[151560]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[155696]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[159776]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[159792]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[163888]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[163896]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[167984]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[180280]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[184376]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[188464]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[192544]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[225328]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[225336]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[245816]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[258184]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[262280]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[266376]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[278664]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[286848]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[286856]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[307336]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[311344]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[315528]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[319520]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[327688]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[327712]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[331784]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[331808]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[335904]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[340000]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[344072]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[348288]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[348296]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[352384]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[368768]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[389256]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[397456]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[401544]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[401552]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[405648]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[413840]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[417840]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[417928]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[421936]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[434232]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[438280]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[438328]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[442424]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[446520]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[450616]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[458888]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[467000]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[479368]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[491656]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[503944]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[524424]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[532624]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[536712]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[667784]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[749704]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[798856]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[811144]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[831624]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1011848]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1028232]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1036424]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1040520]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1044616]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1048712]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1052808]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1056904]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1061000]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1069192]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1089672]},\n",
       " {'a': v[24624], 'b': v[12504], 'c': v[1462280]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[4240]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[16416]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[20488]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[20512]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[20608]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[20624]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[24584]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[24608]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[24624]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[24632]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[28680]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[28704]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[28720]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[28728]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[28800]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[28808]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[28816]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[28888]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[32776]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[32800]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[32816]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[32824]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[36896]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[36920]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[37000]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[40992]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[41176]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[45112]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[49208]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[53256]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[53304]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[53464]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[57400]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[65568]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[65584]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[73776]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[73784]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[77856]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[77952]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[81976]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[94256]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[94352]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[98336]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[98440]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[102536]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[106632]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[110624]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[114744]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[118920]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[123096]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[131288]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[135216]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[135224]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[135304]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[139320]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[147592]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[151688]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[155784]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[168152]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[180232]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[188448]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[196736]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[213000]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[217096]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[233600]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[233688]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[237704]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[249904]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[262192]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[266296]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[270392]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[282760]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[307336]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[315528]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[315536]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[323640]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[340184]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[352392]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[385160]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[438408]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[491736]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[495832]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[499928]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[504024]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[508120]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[512128]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[516224]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[536584]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[540680]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[544776]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[553008]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[557104]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[561200]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[565296]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[569392]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[577672]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[598160]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[618552]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[622648]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[626744]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[811144]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[1003656]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[1548424]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[1552520]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[1556616]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[4018312]},\n",
       " {'a': v[24624], 'b': v[16392], 'c': v[4063368]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[4104]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[4128]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[4232]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[4240]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[4312]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[8240]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[8320]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[8336]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[8408]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[12320]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[12336]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[12416]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[12504]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[16392]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[16520]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[20488]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[20512]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[20536]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[20608]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[20624]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[24584]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[24608]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[24624]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[24704]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[24712]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[28680]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[28704]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[28720]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[28728]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[28800]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[28808]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[28816]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[28888]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[32776]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[32800]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[32816]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[32824]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[32984]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[36872]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[36896]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[36912]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[36920]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[37000]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[37008]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[40992]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[41008]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[41016]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[41088]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[41096]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[41176]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[45064]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[45088]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[45112]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[45184]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[45192]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[45272]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[49160]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[49184]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[49200]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[49208]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[49288]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[49368]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[53256]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[53280]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[53304]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[53384]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[53464]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[57392]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[57400]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[61488]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[61568]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[61576]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[61656]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[65592]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[65672]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[65752]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[69640]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[69768]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[73776]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[73784]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[73944]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[77856]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[77872]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[77880]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[78040]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[81952]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[86048]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[86064]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[86072]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[86152]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[86232]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[90168]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[90248]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[90256]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[90328]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[94240]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[94256]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[94264]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[94352]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[98336]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[98352]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[98440]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[98448]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[102536]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[102544]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[106552]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[106632]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[106640]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[110600]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[110624]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[110648]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[110736]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[114696]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[114720]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[114744]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[114832]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[114904]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[118792]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[118816]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[118920]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[119000]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[122912]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[123016]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[123096]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[127008]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[127024]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[127192]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[131104]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[131208]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[131288]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[135216]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[135224]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[135304]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[135384]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[139320]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[139480]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[143416]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[143496]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[147592]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[151688]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[155784]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[159880]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[167992]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[168064]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[168072]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[172168]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[176264]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[180232]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[180272]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[184368]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[184448]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[184456]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[188464]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[192568]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[196664]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[196744]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[200760]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[204856]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[204936]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[208952]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[209032]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[213120]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[217224]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[237704]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[241800]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[249992]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[282760]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[315528]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[327816]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[344200]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[348296]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[356488]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[393352]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[397448]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[405640]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[417928]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[426120]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[430216]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[434312]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[438408]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[442504]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[446600]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[450696]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[454792]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[458888]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[520336]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[540808]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[581688]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[606344]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[782472]},\n",
       " {'a': v[24624], 'b': v[16416], 'c': v[913544]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[4104]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[4128]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[4144]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[4152]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[4232]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[4240]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[4312]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[8224]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[8240]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[8248]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[8320]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[8328]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[8336]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[8408]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[12296]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[12320]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[12336]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[12344]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[12416]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[12424]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[12432]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[12504]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[16416]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[16432]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[16440]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[16512]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[16600]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[20512]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[20536]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[20616]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[20696]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[24584]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[24624]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[24712]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[28728]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[28808]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[28888]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[32824]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[32896]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[32904]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[36912]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[36920]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[37000]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[37008]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[41096]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[45064]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[45112]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[45192]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[45200]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[45272]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[49184]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[49208]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[49288]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[49368]},\n",
       " {'a': v[24624], 'b': v[16520], 'c': v[53376]},\n",
       " ...]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).as_('a').out().as_('b').out().as_('c').select('a', 'b', 'c').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Give vertices multiple aliases__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': 'KKE', 'b': 'NZ-NTL', 'c': 1},\n",
       " {'a': 'VRN', 'b': 'IT-34', 'c': 39},\n",
       " {'a': 'PIX', 'b': 'PT-20', 'c': 2},\n",
       " {'a': 'GGG', 'b': 'US-TX', 'c': 1},\n",
       " {'a': 'GSE', 'b': 'SE-Q', 'c': 20},\n",
       " {'a': 'RDU', 'b': 'US-NC', 'c': 48},\n",
       " {'a': 'TBS', 'b': 'GE-TB', 'c': 37},\n",
       " {'a': 'RAR', 'b': 'CK-U-A', 'c': 10},\n",
       " {'a': 'IXU', 'b': 'IN-MM', 'c': 2},\n",
       " {'a': 'LPK', 'b': 'RU-LIP', 'c': 1}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().has('type','airport').limit(10).as_('a','b','c').select('a','b','c').by('code').by('region').by(__.out().count()).fold().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project()\n",
    "Equivalent done by using project() instead of as() and select()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().has('type','airport').limit(10).project('a','b','c').by('code').by('region').by(__.out().count()).fold().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Use the same alias for different vertices__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# g.V(1).as('a').V(2).as('a').select(first,'a')\n",
    "# g.V(1).as('a').V(2).as('a').select(last,'a')\n",
    "# g.V(1).as('a').V(2).as('a').select(all,'a')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "all (produces list) cannot be used with by modulator\n",
    "\n",
    "unfold and get values instead"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# g.V().has('code','AUS').as('a').\n",
    "#       out().as('a').limit(10).\n",
    "#       select(all,'a').unfold().values('code').fold()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Select the edge between HK and Sydney, and the distance property on it__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4591"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).outE().as_('e').inV().has('code','SYD').select('e').values('dist').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Select certain properties in the map values__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'code': ['HKG'],\n",
       " 'icao': ['VHHH'],\n",
       " 'desc': ['Hong Kong - Chek Lap Kok International Airport']}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).valueMap().select('code','icao','desc').next()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
