{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 6. Select, Project\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import __\n",
    "from loader import hkVertexId\n",
    "from loader import sydneyVertexId"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## select()\n",
    "__Select the traversal of airports from HK that are 2 flights away__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': v[98344], 'b': v[4296], 'c': v[4152]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[4232]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[8232]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[8248]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[8328]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[8392]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[12344]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[12424]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[12488]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[16424]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[16440]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[16584]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[20520]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[20536]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[20616]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[20680]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[24616]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[24632]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[24712]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[24776]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[28712]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[28728]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[28872]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[32808]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[32824]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[32968]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[36904]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[36920]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41000]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41160]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[45096]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[49352]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[53288]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[53448]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[61480]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[61496]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[61640]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[69672]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[69768]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[73768]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[73928]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[77864]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[81960]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[86056]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[90248]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[94248]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[98344]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[98360]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[102456]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[106536]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[110632]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[114824]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[122920]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[123080]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[127016]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[131112]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[135208]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[143560]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[151752]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[192552]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[196648]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[213032]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[233528]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[241704]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[245896]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[249912]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[253992]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[266440]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[270376]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[274472]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[274632]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[278568]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[290856]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[299064]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[303160]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[311336]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[315432]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[323624]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[380968]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[401448]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[409640]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[446600]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[512040]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[573480]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[581672]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[598056]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[761896]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[823496]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[827592]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[831688]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[1347624]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[1351720]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[1355816]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[1359912]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40964184]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40964304]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40964312]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40968400]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40968408]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40972376]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40972496]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40976592]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40980696]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40984664]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40988880]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[40996952]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41005264]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41009368]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41017552]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41021648]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41025624]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41025752]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41029840]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41033936]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41033944]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41046224]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41054296]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41058512]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41070680]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41115856]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41156824]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41181400]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41189464]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41291992]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41369816]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41378008]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41390168]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41390296]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41394264]},\n",
       " {'a': v[98344], 'b': v[4296], 'c': v[41709776]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[4152]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[4232]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[4296]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[8232]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[8248]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[8392]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[12328]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[12344]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[12424]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[12488]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[16424]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[16440]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[16520]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[16584]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[20520]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[20536]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[20616]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[20680]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[24616]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[24632]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[24712]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[24776]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[28712]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[28728]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[28872]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[32808]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[32824]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[36904]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41000]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41160]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[49192]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[49352]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[53288]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[57384]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[61480]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[61496]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[65576]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[69672]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[69768]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[73768]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[73928]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[77864]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[77880]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[81960]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[81976]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[86056]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[90152]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[94248]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[98344]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[98440]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[102456]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[106536]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[106552]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[110632]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[122936]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[139400]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[143400]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[143496]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[143560]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[147512]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[147592]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[147656]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[151688]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[155784]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[159880]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[163976]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[168072]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[172168]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[184360]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[184376]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[184520]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[188456]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[188472]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[192568]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[196648]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[196664]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[200744]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[200760]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[204840]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[204856]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[208952]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[213048]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[213192]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[217144]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[217288]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[221240]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[225336]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[225480]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[229432]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[233528]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[237624]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[241704]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[241720]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[249896]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[254008]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[266440]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[270536]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[274632]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[278728]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[282824]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[286920]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[290856]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[291016]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[295112]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[311336]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[315432]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[315448]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[323624]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[327720]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[352296]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[356392]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[360488]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[360584]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[364584]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[376872]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[380968]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[381064]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[389256]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[393256]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[397352]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[405544]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[409640]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[413736]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[421928]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[442408]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[446520]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[467000]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[499752]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[503848]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[507944]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[512040]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[516136]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[520232]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[524328]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[532520]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[536616]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[540712]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[544808]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[548904]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[553000]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[557096]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[561192]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[565288]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[569384]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[573480]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[577576]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[581672]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[585768]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[589864]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[593960]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[606248]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[667848]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[737320]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[765992]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[770088]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[811048]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[831528]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[913464]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[1138728]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[1191976]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[2576424]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[4091944]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[4153384]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40964304]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40964312]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40968280]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40968400]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40968408]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40972376]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40972496]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40976472]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40976592]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40980568]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40980696]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40988760]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[40988880]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41001176]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41005264]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41013336]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41017432]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41017552]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41017560]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41021648]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41025624]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41025744]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41025752]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41029840]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41029848]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41033936]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41037912]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41042008]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41050328]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41066584]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41066704]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41074904]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41082968]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41083088]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41087184]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41091280]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41091288]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41095376]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41095384]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41099472]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41099480]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41103448]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41103568]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41103576]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41107544]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41107664]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41107672]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41111640]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41111760]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41111768]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41115736]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41115856]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41115864]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41119952]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41185488]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41222232]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41332944]},\n",
       " {'a': v[98344], 'b': v[8328], 'c': v[41337048]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[4152]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[4232]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[4296]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[8232]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[8328]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[8392]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[12328]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[12344]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[12424]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[16424]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[16440]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[16520]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[16584]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[20520]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[20536]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[20616]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[20680]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[24616]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[24712]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[24776]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[28712]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[28728]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[28872]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[32808]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[32824]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[32968]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[36904]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41000]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41160]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[45096]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[49192]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[49352]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[53288]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[57384]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[61480]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[65672]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[69672]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[69768]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[73768]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[77864]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[81960]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[86056]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[90312]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[94248]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[98344]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[98440]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[102456]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[106552]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[114744]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[122920]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[131112]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[143400]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[143560]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[147512]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[147656]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[151752]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[196648]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[200744]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[204840]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[204856]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[217288]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[241704]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[249896]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[270376]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[274632]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[327720]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[331832]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[360584]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[376872]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[381064]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[397352]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[409656]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[434232]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[524424]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[585768]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[606248]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[647368]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[655560]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[659656]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[667848]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[680136]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[753704]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[798760]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[831528]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[987336]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[1146920]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[1187880]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[1191976]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[1548328]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[1552424]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[1564712]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[40964304]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[40964312]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[40968408]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[40972496]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[40976472]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[40976592]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[40980696]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[40988760]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41013336]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41021648]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41025752]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41029848]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41033944]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41042008]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41054424]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41103568]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41300176]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41308368]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41312464]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41316440]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41320656]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41320664]},\n",
       " {'a': v[98344], 'b': v[12488], 'c': v[41402584]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[4152]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[4232]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[4296]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[8232]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[8328]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[8392]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[12328]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[12344]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[12424]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[12488]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[16424]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[16520]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[16584]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[20520]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[20680]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[24616]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[24632]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[24712]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[24776]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[28712]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[28728]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[28872]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[32808]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[32824]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[32968]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[36904]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[36920]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[37064]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41000]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41160]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[45096]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[49192]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[49352]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[53288]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[57384]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[61480]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[69768]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[73768]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[77864]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[77960]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[81960]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[82120]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[86056]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[90152]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[90312]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[94248]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[98344]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[98360]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[98440]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[102440]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[102456]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[106552]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[110648]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[114744]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[122920]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[127016]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[143400]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[143560]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[147656]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[151752]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[172168]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[192552]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[196648]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[200744]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[204840]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[204856]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[213032]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[217288]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[233528]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[241704]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[249896]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[258184]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[262280]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[266280]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[270376]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[327720]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[335912]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[360584]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[376872]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[376968]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[381064]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[393256]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[409656]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[467000]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[569384]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[573480]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[585768]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[606248]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[647368]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[651464]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[655560]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[659656]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[667848]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[798760]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[831528]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[880680]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[1118248]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[1122344]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[1126440]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[1130536]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[1134632]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[1138728]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[1146920]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[1187880]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[1191976]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[2691272]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40964304]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40964312]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40968408]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40972496]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40976472]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40976592]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40980688]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40980696]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40984664]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40984784]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40988760]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[40988880]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41005264]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41013336]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41017552]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41017560]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41021648]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41025624]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41025752]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41029840]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41029848]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41033944]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41042008]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41054424]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41066712]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41078992]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41091280]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41103568]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41169112]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41296080]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41300176]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41300184]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41312344]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41312472]},\n",
       " {'a': v[98344], 'b': v[16440], 'c': v[41316440]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[4296]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[8328]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[12488]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[16440]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[16520]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[20536]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[20680]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[24616]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[28712]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[28872]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[32824]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[32968]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[36904]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[36920]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41000]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41016]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41160]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[49192]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[49352]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[53288]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[61480]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[61640]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[81960]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[82120]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[86056]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[90152]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[90312]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[98344]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[102440]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[110728]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[114744]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[122920]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[123080]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[127016]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[127176]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[143400]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[143560]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[147656]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[196648]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[249896]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[262280]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[266280]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[270376]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[278664]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[335912]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[487624]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[520328]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[585768]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[598072]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[602152]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[602168]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[606264]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[647368]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[676040]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[753704]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[831528]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[942280]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[946376]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[950472]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[954568]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[958664]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[962760]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[966856]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[1122504]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[1527848]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[1531944]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[1536040]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[2236456]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[40964304]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[40968408]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[40972496]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[40976592]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[40980696]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[40984664]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[40984784]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[40988760]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[40988880]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41005264]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41013336]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41042008]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41054424]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41070808]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41132248]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41169112]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41308368]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41324760]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41455832]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41459928]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41464024]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41472088]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41476184]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41480280]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41480400]},\n",
       " {'a': v[98344], 'b': v[24712], 'c': v[41484496]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[4152]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[4232]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[4296]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[8232]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[8248]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[8328]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[8392]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[12344]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[12424]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[12488]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[16424]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[16440]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[16520]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[16584]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[20520]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[20536]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[20616]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[20680]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[24616]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[24632]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[24712]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[24776]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[28728]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[28872]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[32808]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[32824]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[32968]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[36904]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[36920]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[37064]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41000]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41160]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[45096]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[49352]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[53288]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[53448]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[57384]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[57480]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[57544]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[61496]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[69672]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[69768]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[73768]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[73784]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[73928]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[77864]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[77880]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[78024]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[81960]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[86056]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[86072]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[86216]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[90248]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[90312]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[94248]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[98344]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[98360]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[102456]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[102536]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[106536]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[106632]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[110632]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[110648]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[110792]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[114728]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[114744]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[114888]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[118824]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[118920]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[122920]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[123080]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[127016]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[127032]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[135208]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[143400]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[143560]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[147656]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[151592]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[151608]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[159880]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[167992]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[176264]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[176328]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[180424]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[184360]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[184520]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[188456]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[192552]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[192568]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[192712]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[196648]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[204856]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[213032]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[213192]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[225480]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[229576]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[233528]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[233608]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[237768]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[245896]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[249912]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[249992]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[250056]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[253992]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[266280]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[266440]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[270376]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[274472]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[274632]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[278568]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[282664]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[282680]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[286760]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[290856]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[299064]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[303160]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[307400]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[311336]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[315432]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[323624]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[327720]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[335912]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[340008]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[364744]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[376872]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[380968]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[389160]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[401448]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[409640]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[409800]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[422088]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[450760]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[573480]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[581672]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[737320]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[757800]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[761896]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[770088]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[794664]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[798760]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[888872]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40964304]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40964312]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40968408]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40972376]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40972496]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40976472]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40976592]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40980696]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40984664]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40984784]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40984792]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40988880]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40992976]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40996952]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[40997072]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41001048]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41001168]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41001176]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41005144]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41005264]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41009368]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41013336]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41013464]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41017432]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41017552]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41017560]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41021528]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41025624]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41025752]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41029840]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41029848]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41033936]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41050320]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41054296]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41058392]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41058512]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41082968]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41091160]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41115856]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41119960]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41181272]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41181400]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41185368]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41197776]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41201872]},\n",
       " {'a': v[98344], 'b': v[28712], 'c': v[41205968]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[4152]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[4296]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[8232]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[8328]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[12344]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[12424]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[12488]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[16440]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[20520]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[24616]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[28712]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[28808]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[28872]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[32808]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[32824]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[32968]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[36904]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[36920]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[37064]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[41096]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[41160]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[45112]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[45192]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[49208]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[49288]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[49352]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[53304]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[53384]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[53448]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[57400]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[57480]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[57544]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[61480]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[61496]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[69768]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[73768]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[73784]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[73864]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[77864]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[77880]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[78024]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[81960]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[82056]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[86056]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[86072]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[86152]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[86216]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[90168]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[90312]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[94248]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[94264]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[94344]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[94408]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[98344]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[98360]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[98504]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[102536]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[106536]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[110632]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[110648]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[110792]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[114728]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[114744]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[118824]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[118920]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[122920]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[127016]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[127112]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[131128]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[131208]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[135304]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[135368]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[139464]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[143416]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[143560]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[147496]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[151592]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[151608]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[163896]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[164040]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[167992]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[172088]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[176168]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[176184]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[176328]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[184360]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[184456]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[188456]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[192552]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[192712]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[196744]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[200904]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[209032]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[209096]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[213032]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[213128]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[217128]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[221224]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[225320]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[225480]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[229416]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[233512]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[233608]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[237608]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[237768]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[245896]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[249992]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[250056]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[253992]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[254152]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[258248]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[262200]},\n",
       " {'a': v[98344], 'b': v[28728], 'c': v[266280]},\n",
       " ...]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).as_('a').out().as_('b').out().as_('c').select('a', 'b', 'c').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Give vertices multiple aliases__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'a': 'NSN', 'b': 'NZ-NSN', 'c': 4},\n",
       " {'a': 'VHC', 'b': 'AO-LSU', 'c': 2},\n",
       " {'a': 'CIC', 'b': 'US-CA', 'c': 1},\n",
       " {'a': 'JOS', 'b': 'NG-PL', 'c': 1},\n",
       " {'a': 'SDU', 'b': 'BR-RJ', 'c': 18},\n",
       " {'a': 'YLW', 'b': 'CA-BC', 'c': 12},\n",
       " {'a': 'SOW', 'b': 'US-AZ', 'c': 2},\n",
       " {'a': 'ESB', 'b': 'TR-06', 'c': 55},\n",
       " {'a': 'KKE', 'b': 'NZ-NTL', 'c': 1},\n",
       " {'a': 'LCR', 'b': 'CO-AMA', 'c': 2}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().has('type','airport').limit(10).as_('a','b','c').select('a','b','c').by('code').by('region').by(__.out().count()).fold().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## project()\n",
    "Equivalent done by using project() instead of as() and select()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().has('type','airport').limit(10).project('a','b','c').by('code').by('region').by(__.out().count()).fold().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Use the same alias for different vertices__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# g.V(1).as('a').V(2).as('a').select(first,'a')\n",
    "# g.V(1).as('a').V(2).as('a').select(last,'a')\n",
    "# g.V(1).as('a').V(2).as('a').select(all,'a')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "all (produces list) cannot be used with by modulator\n",
    "\n",
    "unfold and get values instead"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# g.V().has('code','AUS').as('a').\n",
    "#       out().as('a').limit(10).\n",
    "#       select(all,'a').unfold().values('code').fold()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Select the edge between HK and Sydney, and the distance property on it__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4591"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).outE().as_('e').inV().has('code','SYD').select('e').values('dist').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Select certain properties in the map values__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'code': ['HKG'],\n",
       " 'icao': ['VHHH'],\n",
       " 'desc': ['Hong Kong - Chek Lap Kok International Airport']}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).valueMap().select('code','icao','desc').next()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
