{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 10. Eq, Neq, Not, And, Or, Gt, Gte, Lt, Lte, Inside, Outside, Within, Without, Between\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import P\n",
    "from loader import __\n",
    "from loader import hkVertexId\n",
    "from loader import sydneyVertexId"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## eq()\n",
    "__Airports that have 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Nelson Airport',\n",
       " 'Gisborne Airport',\n",
       " 'Napier Airport',\n",
       " 'Hamilton International Airport',\n",
       " 'Chicago Midway International Airport',\n",
       " 'Hartsfield - Jackson Atlanta International Airport',\n",
       " 'Toronto Pearson International Airport',\n",
       " 'Ufa International Airport',\n",
       " 'Tauranga Airport',\n",
       " 'George Bush Intercontinental',\n",
       " 'Karup Airport',\n",
       " 'Paraparaumu Airport',\n",
       " 'General Mitchell International Airport',\n",
       " 'Shannon Airport']"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('runways', P.eq(5)).values('desc').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## neq()\n",
    "__Airports that do not have 4 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Nelson Airport',\n",
       " 'Saurimo Airport',\n",
       " 'Chico Municipal Airport',\n",
       " 'Yakubu Gowon Airport',\n",
       " 'Santos Dumont Airport',\n",
       " 'Kelowna International Airport',\n",
       " 'Show Low Regional Airport',\n",
       " 'Esenboğa International Airport',\n",
       " 'La Chorrera Airport',\n",
       " 'Block Island State Airport',\n",
       " 'Victoria Falls International Airport',\n",
       " 'Vinnytsia/Gavyryshivka Airport',\n",
       " 'Longjia Airport',\n",
       " 'Burketown Airport',\n",
       " 'Maya-Maya Airport',\n",
       " 'Lampedusa Airport',\n",
       " 'Hasanuddin International Airport',\n",
       " 'Whatì Airport',\n",
       " 'Alejandro Velasco Astete International Airport',\n",
       " 'Central Airport',\n",
       " 'Perth International Airport',\n",
       " 'Santa Genoveva Airport',\n",
       " 'Asmara International Airport',\n",
       " 'Mardin Airport',\n",
       " 'Jixi Xingkaihu Airport',\n",
       " 'Cengiz Topel Airport',\n",
       " 'Memorial Field',\n",
       " 'Diqing Airport',\n",
       " 'Toulon-Hyères Airport',\n",
       " 'Dr. Babasaheb Ambedkar International Airport',\n",
       " 'Sønderborg Airport',\n",
       " 'Salalah Airport',\n",
       " 'Democratic Republic of the Congo',\n",
       " 'Fort Dodge Regional Airport',\n",
       " 'Orange Airport',\n",
       " 'Longreach Airport',\n",
       " 'Des Moines International Airport',\n",
       " 'Oceania',\n",
       " 'Port Augusta Airport',\n",
       " 'Multan International Airport',\n",
       " 'Kittila Airport',\n",
       " 'Point Hope Airport',\n",
       " 'Uralsk Airport',\n",
       " 'Ust-Tsylma Airport',\n",
       " 'Las Termas Airport',\n",
       " 'Kasane Airport',\n",
       " 'Salzburg Airport',\n",
       " 'Namangan Airport',\n",
       " 'Waimea Kohala Airport',\n",
       " 'Oman',\n",
       " 'Craig Cove Airport',\n",
       " 'Platinum Airport',\n",
       " 'George Best Belfast City Airport',\n",
       " 'Hao Airport',\n",
       " 'Brownsville South Padre Island International Airport',\n",
       " 'Florence Regional Airport',\n",
       " 'San Pedro Airport',\n",
       " 'Buka Airport',\n",
       " 'Tambor Airport',\n",
       " 'Chiang Mai International Airport',\n",
       " 'Johannesburg, OR Tambo International Airport',\n",
       " 'Berlin-Schönefeld International Airport',\n",
       " 'New Castle Airport',\n",
       " 'Rafha Domestic Airport',\n",
       " 'Hamadan Airport',\n",
       " 'Hoedspruit Air Force Base Airport',\n",
       " 'Ain Arnat Airport',\n",
       " 'Goroka Airport',\n",
       " 'Mostar International Airport',\n",
       " 'Yenbo - Prince Abdul Mohsin Bin Airport',\n",
       " 'Pietermaritzburg Airport',\n",
       " 'Fukuoka Airport',\n",
       " 'Kavieng Airport',\n",
       " 'Ormoc Airport',\n",
       " 'Juba International Airport',\n",
       " 'Tokyo Narita',\n",
       " 'Maniitsoq Airport',\n",
       " 'Luena Airport',\n",
       " 'Southwest Florida International Airport',\n",
       " 'Northwest Alabama Regional Airport',\n",
       " 'Chautauqua County-Jamestown Airport',\n",
       " 'Powell River Airport',\n",
       " 'Brno-Tuřany Airport',\n",
       " 'Long Beach Airport',\n",
       " 'El Tari Airport',\n",
       " 'Newark, Liberty',\n",
       " 'Kharkiv International Airport',\n",
       " 'Senegal',\n",
       " 'Gustavo Vargas Airport',\n",
       " 'Monastir Habib Bourguiba International Airport',\n",
       " 'Jackson-Medgar Wiley Evers International Airport',\n",
       " 'Atyrau Airport',\n",
       " 'Belfast International Airport',\n",
       " \"St. John's International Airport\",\n",
       " 'Iran',\n",
       " 'Isle of Man',\n",
       " 'Hyderabad, Rajiv Gandhi International Airport',\n",
       " 'Qurghonteppa International Airport',\n",
       " 'Southampton Airport',\n",
       " 'St Michael Airport',\n",
       " 'Siem Reap International Airport',\n",
       " 'Malaysia',\n",
       " 'Moruya Airport',\n",
       " 'Ernesto Cortissoz International Airport',\n",
       " 'Timişoara Traian Vuia Airport',\n",
       " 'Guillermo León Valencia Airport',\n",
       " 'Paulatuk (Nora Aliqatchialuk Ruben) Airport',\n",
       " 'Slovakia',\n",
       " 'Takamatsu Airport',\n",
       " 'Eek Airport',\n",
       " 'Leros Airport',\n",
       " 'Juan Gualberto Gomez International Airport',\n",
       " 'Aktobe Airport',\n",
       " 'General Urquiza Airport',\n",
       " 'Coari Airport',\n",
       " 'Asheville Regional Airport',\n",
       " 'Devils Lake Regional Airport',\n",
       " 'Calvi-Sainte-Catherine Airport',\n",
       " 'Funchal, Madeira Airport',\n",
       " 'Douala International Airport',\n",
       " 'Bodaybo Airport',\n",
       " 'Malatya Erhaç Airport',\n",
       " 'Las Américas International Airport',\n",
       " 'Erzurum International Airport',\n",
       " 'Eritrea',\n",
       " 'Bharatpur Airport',\n",
       " 'San Luis Airport',\n",
       " 'Baie Comeau Airport',\n",
       " 'Mundo Maya International Airport',\n",
       " 'Maio Airport',\n",
       " 'Napakiak Airport',\n",
       " 'Bastia-Poretta Airport',\n",
       " 'Bolzano Airport',\n",
       " 'Masset Airport',\n",
       " 'Gachsaran Airport',\n",
       " \"Bao'anying Airport\",\n",
       " 'Comandante Espora Airport',\n",
       " 'Kuwait',\n",
       " 'Conakry Airport',\n",
       " 'Western Sahara',\n",
       " 'Buon Ma Thuot Airport',\n",
       " 'City of Derry Airport',\n",
       " 'Cardiff International Airport',\n",
       " 'El Yopal Airport',\n",
       " 'Ban Huoeisay Airport',\n",
       " 'Logroño-Agoncillo Airport',\n",
       " 'Casa De Campo International Airport',\n",
       " 'Vunisea Airport',\n",
       " 'Provincetown Municipal Airport',\n",
       " 'Minto Al Wright Airport',\n",
       " 'Ignatyevo Airport',\n",
       " 'Puerto Jimenez Airport',\n",
       " 'Sanikiluaq Airport',\n",
       " 'Ljubljana Jože Pučnik Airport',\n",
       " 'Austria',\n",
       " 'Flagstaff Pulliam Airport',\n",
       " 'Europe',\n",
       " 'Augsburg Airport',\n",
       " 'Mombasa Moi International Airport',\n",
       " 'Tan Tan Airport',\n",
       " 'Kaitaia Airport',\n",
       " 'Desierto de Atacama Airport',\n",
       " 'Tulsa International Airport',\n",
       " 'United Kingdom',\n",
       " 'Pakse International Airport',\n",
       " 'San Javier Airport',\n",
       " 'La Isabela International Airport',\n",
       " 'Pocatello Regional Airport',\n",
       " 'Learmonth Airport',\n",
       " 'Lübeck Blankensee Airport',\n",
       " 'High Level Airport',\n",
       " 'Gerrard Smith International Airport',\n",
       " 'Pointe Vele Airport',\n",
       " 'Philip S. W. Goldson International Airport',\n",
       " 'Hong Kong',\n",
       " 'Turkey',\n",
       " 'Dimapur Airport',\n",
       " 'Ua Huka Airport',\n",
       " 'Kwethluk Airport',\n",
       " 'Dickinson Theodore Roosevelt Regional Airport',\n",
       " 'Sirri Island Airport',\n",
       " 'Brindisi – Salento Airport',\n",
       " \"Arthur's Town Airport\",\n",
       " 'Saint Helena',\n",
       " 'Gustavus Airport',\n",
       " 'Eugenio Maria De Hostos Airport',\n",
       " 'Atlas Brasil Cantanhede Airport',\n",
       " 'Algiers, Houari Boumediene Airport',\n",
       " 'Borg El Arab International Airport',\n",
       " 'Mecheria Airport',\n",
       " 'Dakhla Airport',\n",
       " 'Alberto Carnevalli Airport',\n",
       " 'Wanxian Airport',\n",
       " 'Plovdiv International Airport',\n",
       " 'Noumérat - Moufdi Zakaria Airport',\n",
       " 'Havre City County Airport',\n",
       " 'Qinhuangdao Beidaihe Airport',\n",
       " 'Stella Maris Airport',\n",
       " 'Quetta International Airport',\n",
       " 'Praslin Airport',\n",
       " 'Yingkou Lanqi Airport',\n",
       " 'Libo Airport',\n",
       " 'Akulivik Airport',\n",
       " 'Cabo Frio Airport',\n",
       " 'Woodbourne Airport',\n",
       " 'Yelizovo Airport',\n",
       " 'Attawapiskat Airport',\n",
       " 'Zemunik Airport',\n",
       " 'Wajir Airport',\n",
       " 'Lahad Datu Airport',\n",
       " 'Maumere(Wai Oti) Airport',\n",
       " \"Val-d'Or Airport\",\n",
       " 'Olsztyn-Mazury Airport',\n",
       " 'Lien Khuong Airport',\n",
       " 'Lanseria Airport',\n",
       " 'Birdsville Airport',\n",
       " 'Manhattan Regional Airport',\n",
       " 'Guararapes - Gilberto Freyre International Airport',\n",
       " 'Kos Airport',\n",
       " \"Xi'an Xianyang International Airport\",\n",
       " 'Tachileik Airport',\n",
       " 'Roswell International Air Center Airport',\n",
       " 'Akiak Airport',\n",
       " 'Mauke Airport',\n",
       " 'Monterey Peninsula Airport',\n",
       " 'Norfolk Island',\n",
       " 'Dundee Airport',\n",
       " 'Chokurdakh Airport',\n",
       " 'Kiev Zhuliany International Airport',\n",
       " 'Pavlodar Airport',\n",
       " 'Malvinas Argentinas Airport',\n",
       " 'Ulukhaktok Holman Airport',\n",
       " 'Kruger Mpumalanga International Airport',\n",
       " 'Esfahan Shahid Beheshti International Airport',\n",
       " 'Raipur Airport',\n",
       " 'Bacolod-Silay City International Airport',\n",
       " 'Cambodia',\n",
       " 'Bauru - Arealva Airport',\n",
       " 'Stockholm-Bromma Airport',\n",
       " 'Moranbah Airport',\n",
       " 'Tucson International Airport',\n",
       " 'Corumbá International Airport',\n",
       " 'Iraq',\n",
       " 'Dehradun Airport',\n",
       " 'Sweden',\n",
       " 'El Alto International Airport',\n",
       " 'Birmingham-Shuttlesworth International Airport',\n",
       " 'Licenciado Manuel Crescencio Rejon Int Airport',\n",
       " 'La Fria Airport',\n",
       " 'Dzhezkazgan Airport',\n",
       " 'Tagbilaran Airport',\n",
       " 'Capitan FAP Jose A Quinones Gonzales International Airport',\n",
       " 'South Bend Regional Airport',\n",
       " 'Limnos Airport',\n",
       " 'Saidpur Airport',\n",
       " 'Ulanqab Airport',\n",
       " 'Podgorica Airport',\n",
       " 'Piedras Negras International Airport',\n",
       " 'George Town, Exuma International Airport',\n",
       " 'Ralph Wien Memorial Airport',\n",
       " 'John A. Osborne Airport',\n",
       " 'Merimbula Airport',\n",
       " 'Marseille Provence Airport',\n",
       " 'Nicaragua',\n",
       " 'Savonlinna Airport',\n",
       " 'Malawi',\n",
       " 'Levelock Airport',\n",
       " 'Kenya',\n",
       " 'Khrabrovo Airport',\n",
       " 'Irkutsk Airport',\n",
       " 'Santa Maria Airport',\n",
       " 'Yakima Air Terminal McAllister Field',\n",
       " 'Jiayuguan Airport',\n",
       " 'Cheyenne Regional Jerry Olson Field',\n",
       " 'Yeosu Airport',\n",
       " 'Puerto Rico, Luis Munoz International Airport',\n",
       " 'Christmas Island',\n",
       " 'Luoyang Airport',\n",
       " 'Resistencia International Airport',\n",
       " 'Warri Airport',\n",
       " 'Gisborne Airport',\n",
       " 'Del Bajio International Airport',\n",
       " 'Macaé Airport',\n",
       " 'Togiak Airport',\n",
       " 'Bologna Guglielmo Marconi Airport',\n",
       " 'Fort Smith Regional Airport',\n",
       " 'Melville Hall Airport',\n",
       " 'London City Airport',\n",
       " 'Trieste–Friuli Venezia Giulia Airport',\n",
       " 'Ceduna Airport',\n",
       " 'Bardufoss Airport',\n",
       " 'Launceston Airport',\n",
       " 'Kazi Nazrul Islam Airport',\n",
       " 'Mahshahr Airport',\n",
       " 'Pakuba Airport',\n",
       " 'Sentani Airport',\n",
       " 'Adirondack Regional Airport',\n",
       " 'Abakan Airport',\n",
       " 'North Central West Virginia Airport',\n",
       " 'Beirut Rafic Hariri International Airport',\n",
       " 'Meixian Airport',\n",
       " 'Gillette Campbell County Airport',\n",
       " 'Shire Inda Selassie Airport',\n",
       " \"Cox's Bazar Airport\",\n",
       " 'Mazar I Sharif Airport',\n",
       " 'Sevilla Airport',\n",
       " 'Port Bouet Airport',\n",
       " 'Mário de Almeida Franco Airport',\n",
       " 'Missoula International Airport',\n",
       " 'Stockholm Skavsta Airport',\n",
       " 'Xinyuan Nalati Airport',\n",
       " 'Gonder Airport',\n",
       " 'Edward G. Pitka Sr Airport',\n",
       " 'Fiji, Nadi International Airport',\n",
       " 'Ayers Rock Connellan Airport',\n",
       " 'Ogden Hinckley Airport',\n",
       " 'Hengyang Airport',\n",
       " 'Tingo Maria Airport',\n",
       " 'Teniente Julio Gallardo Airport',\n",
       " 'Middle Georgia Regional Airport',\n",
       " 'Rwanda',\n",
       " 'Gaua Island Airport',\n",
       " 'Araracuara Airport',\n",
       " 'Bachigualato Federal International Airport',\n",
       " 'Sultan Ismail Petra Airport',\n",
       " 'Haifa International Airport',\n",
       " 'Mt. Fuji Shizuoka Airport',\n",
       " \"Dillon's Bay Airport\",\n",
       " 'St. Thomas, Cyril E. King Airport',\n",
       " 'Minsk International Airport',\n",
       " 'Amado Nervo National Airport',\n",
       " 'Trail Airport',\n",
       " 'Saratov Central Airport',\n",
       " 'Anvik Airport',\n",
       " 'Sept-Îles Airport',\n",
       " 'Jordan',\n",
       " 'Chelyabinsk Balandino Airport',\n",
       " 'Quincy Regional Baldwin Field',\n",
       " 'Bingöl Çeltiksuyu Airport',\n",
       " 'Seattle-Tacoma',\n",
       " 'Tiksi Airport',\n",
       " 'Hancock County-Bar Harbor Airport',\n",
       " 'Sultan Mahmud Airport',\n",
       " 'Dhangarhi Airport',\n",
       " 'Chile',\n",
       " 'Coronel FAP Carlos Ciriani Santa Rosa International Airport',\n",
       " \"L'Espérance Airport\",\n",
       " 'Salamanca Airport',\n",
       " 'Kirensk Airport',\n",
       " 'Nigeria',\n",
       " 'Napier Airport',\n",
       " 'Trenton Mercer Airport',\n",
       " 'Montréal / Saint-Hubert Airport',\n",
       " 'Linköping City Airport',\n",
       " 'Guadeloupe',\n",
       " 'Carriel Sur Airport',\n",
       " \"Sana'a International Airport\",\n",
       " 'Boende Airport',\n",
       " 'Thompson Airport',\n",
       " 'Mudanjiang Hailang International Airport',\n",
       " 'Tongoa Airport',\n",
       " 'Khanty Mansiysk Airport',\n",
       " 'Lorient South Brittany (Bretagne Sud) Airport',\n",
       " 'Coral Harbour Airport',\n",
       " 'Garden City Regional Airport',\n",
       " 'Tabubil Airport',\n",
       " 'Richards Bay Airport',\n",
       " 'Francisco Bangoy International Airport',\n",
       " 'Harstad/Narvik Airport, Evenes',\n",
       " 'Khovd Airport',\n",
       " 'Malabo Airport',\n",
       " 'Milas Bodrum International Airport',\n",
       " 'La Tontouta International Airport',\n",
       " 'Santa Barbara Municipal Airport',\n",
       " 'Lethbridge County Airport',\n",
       " 'Mbeya Airport',\n",
       " 'Leirin Airport',\n",
       " 'Skardu Airport',\n",
       " 'Delta County Airport',\n",
       " 'Port Menier Airport',\n",
       " 'Košice Airport',\n",
       " 'Vilo Acuña International Airport',\n",
       " 'Fuzhou Changle International Airport',\n",
       " 'Yampa Valley Airport',\n",
       " 'Tenerife Norte Airport',\n",
       " 'Egilsstaðir Airport',\n",
       " 'Port Hardy Airport',\n",
       " 'Adana Airport',\n",
       " 'Uytash Airport',\n",
       " 'Northern Mariana Islands',\n",
       " 'Gimpo International Airport',\n",
       " 'Comox Airport',\n",
       " 'Usinsk Airport',\n",
       " 'Bryansk Airport',\n",
       " 'Pisa International Airport',\n",
       " 'Tainan Airport',\n",
       " 'Imam Khomeini International Airport',\n",
       " 'Guinea',\n",
       " 'Gove Airport',\n",
       " 'Botswana',\n",
       " 'Tallinn Airport',\n",
       " 'General Rodolfo Sánchez Taboada International Airport',\n",
       " 'Tianshui Maijishan Airport',\n",
       " 'Tartu Airport',\n",
       " 'Moss Airport, Rygge',\n",
       " 'Jackson Hole Airport',\n",
       " 'Majeed Bin Abdulaziz Airport',\n",
       " 'Ibiza Airport',\n",
       " 'Van Ferit Melen Airport',\n",
       " 'Hamilton International Airport',\n",
       " 'Kasos Airport',\n",
       " 'Baotou Airport',\n",
       " 'Perpignan-Rivesaltes (Llabanère) Airport',\n",
       " 'Mumbai, Chhatrapati Shivaji International Airport',\n",
       " 'Catarman National Airport',\n",
       " 'Diomício Freitas Airport',\n",
       " 'Santander Airport',\n",
       " 'Chimoio Airport',\n",
       " 'Lamap Airport',\n",
       " 'Burgas Airport',\n",
       " 'Talagi Airport',\n",
       " 'Jacksonville International Airport',\n",
       " 'Vernal Regional Airport',\n",
       " 'Southwest Georgia Regional Airport',\n",
       " 'Cadjehoun Airport',\n",
       " 'Gu-Lian Airport',\n",
       " 'Pilot Station Airport',\n",
       " 'Tiree Airport',\n",
       " 'Bahawalpur Airport',\n",
       " 'Placencia Airport',\n",
       " 'Satu Mare Airport',\n",
       " 'Hammerfest Airport',\n",
       " 'Chişinău International Airport',\n",
       " 'Rendani Airport',\n",
       " 'E. T. Joshua Airport',\n",
       " 'Larsen Bay Airport',\n",
       " 'Taoxian Airport',\n",
       " 'Marília Airport',\n",
       " 'Sheikh ul Alam Airport',\n",
       " 'Adıyaman Airport',\n",
       " 'Cibao International Airport',\n",
       " 'Merle K (Mudhole) Smith Airport',\n",
       " 'Dubrovnik Airport',\n",
       " 'Wekweètì Airport',\n",
       " 'Changde Airport',\n",
       " 'Shennongjia Hongping Airport',\n",
       " 'Dawadmi Domestic Airport',\n",
       " 'Banja Luka International Airport',\n",
       " 'Pulkovo Airport',\n",
       " 'Chu Lai International Airport',\n",
       " 'Ouzinkie Airport',\n",
       " 'Mukah Airport',\n",
       " 'Sabzevar National Airport',\n",
       " 'Los Alamos Airport',\n",
       " 'South Caicos Airport',\n",
       " 'Batman Airport',\n",
       " 'Aspen-Pitkin Co/Sardy Field',\n",
       " 'Buluh Tumbang (H A S Hanandjoeddin) Airport',\n",
       " 'Guemar Airport',\n",
       " 'Torres Airstrip',\n",
       " 'Entebbe International Airport',\n",
       " 'Xiangfan Airport',\n",
       " 'Chengdu Shuangliu International Airport',\n",
       " 'Kaadedhdhoo Airport',\n",
       " 'Wokal Field Glasgow International Airport',\n",
       " 'Xoxocotlán International Airport',\n",
       " 'Yakutat Airport',\n",
       " 'Saertu Airport',\n",
       " 'Split Airport',\n",
       " 'Halifax / Stanfield International Airport',\n",
       " 'Palm Springs International Airport',\n",
       " 'CFB Bagotville',\n",
       " 'Cape Town International Airport',\n",
       " 'Charleston Air Force Base-International Airport',\n",
       " 'Rampart Airport',\n",
       " 'Cork Airport',\n",
       " 'Vilankulo Airport',\n",
       " 'Timmins/Victor M. Power',\n",
       " 'Springfield Branson National Airport',\n",
       " 'Mount Hagen Kagamuga Airport',\n",
       " 'Mandalay International Airport',\n",
       " 'Gabès Matmata International Airport',\n",
       " 'Kullu Manali Airport',\n",
       " 'Santa Rosa Airport',\n",
       " 'Phu Bai Airport',\n",
       " 'Rach Gia Airport',\n",
       " 'Kirkenes Airport, Høybuktmoen',\n",
       " 'East Midlands Airport',\n",
       " 'Presidente Castro Pinto International Airport',\n",
       " 'Nantucket Memorial Airport',\n",
       " 'Hail Regional Airport',\n",
       " 'Aktion National Airport',\n",
       " 'Sharurah Airport',\n",
       " 'Fuvahmulah Airport',\n",
       " 'Osh Airport',\n",
       " 'Vaasa Airport',\n",
       " 'Aratika Nord Airport',\n",
       " 'Luang Namtha Airport',\n",
       " 'Co Ong Airport',\n",
       " 'Congonhas Airport',\n",
       " 'Equatorial Guinea',\n",
       " 'Tri Cities Regional Tn Va Airport',\n",
       " 'Jeju International Airport',\n",
       " 'Puerto Lempira Airport',\n",
       " 'Kars Airport',\n",
       " 'Jorge E. Gonzalez Torres Airport',\n",
       " 'Longana Airport',\n",
       " 'Rio Grande Airport',\n",
       " 'Suceava Stefan cel Mare Airport',\n",
       " 'Alta Airport',\n",
       " 'Portugal',\n",
       " 'Nanyang Airport',\n",
       " 'Lar Airport',\n",
       " 'Bettles Airport',\n",
       " 'Tapuruquara Airport',\n",
       " 'Angads Airport',\n",
       " 'Auckland International Airport',\n",
       " 'Hangzhou Xiaoshan International Airport',\n",
       " 'Akwa Ibom International Airport',\n",
       " 'Heraklion International Nikos Kazantzakis Airport',\n",
       " 'Mangaia Island Airport',\n",
       " 'Fresno Yosemite International Airport',\n",
       " 'Coen Airport',\n",
       " 'Can Tho International Airport',\n",
       " 'Hang Nadim International Airport',\n",
       " 'Zurich-Kloten Airport',\n",
       " 'Montrose Regional Airport',\n",
       " 'Taichung Ching Chuang Kang Airport',\n",
       " 'Santa Maria Airport',\n",
       " 'Greater Moncton International Airport',\n",
       " 'Greater Rochester International Airport',\n",
       " 'Kadhdhoo Airport',\n",
       " 'Tromsø Airport',\n",
       " 'Shonai Airport',\n",
       " 'Oslo Gardermoen Airport',\n",
       " 'Czech Republic',\n",
       " 'Campbell River Airport',\n",
       " 'Lourdes de Blanc Sablon Airport',\n",
       " 'Kristianstad Airport',\n",
       " 'Barau(Kalimaru) Airport',\n",
       " 'Thule Air Base',\n",
       " 'Taloyoak Airport',\n",
       " 'Sadiq Abubakar III International Airport',\n",
       " 'Nnamdi Azikiwe International Airport',\n",
       " 'Guyuan Liupanshan Airport',\n",
       " 'Bandar Lengeh Airport',\n",
       " 'Mongolia',\n",
       " 'Jingdezhen Airport',\n",
       " 'German Olano Airport',\n",
       " 'Aksu Airport',\n",
       " 'Stagen Airport',\n",
       " 'Chapecó Airport',\n",
       " 'Tarbes-Lourdes-Pyrénées Airport',\n",
       " 'Mexico City, Licenciado Benito Juarez International Airport',\n",
       " 'Ghadames East Airport',\n",
       " 'Kansas City International Airport',\n",
       " 'Kopitnari Airport',\n",
       " 'John Murtha Johnstown Cambria County Airport',\n",
       " 'JAGS McCartney International Airport',\n",
       " 'Lyon Saint-Exupery Airport',\n",
       " 'Saudi Arabia',\n",
       " 'Tri Cities Airport',\n",
       " 'Shigatse Peace Airport',\n",
       " 'Tjilik Riwut Airport',\n",
       " 'Pdte. Carlos Ibañez del Campo Airport',\n",
       " 'Tazadit Airport',\n",
       " 'Texarkana Regional Webb Field',\n",
       " 'Mayaguana Airport',\n",
       " 'Russian Mission Airport',\n",
       " 'Kamishly Airport',\n",
       " 'Papa Westray Airport',\n",
       " 'Harlingen, Valley International Airport',\n",
       " 'Central African Republic',\n",
       " 'Abeid Amani Karume International Airport',\n",
       " 'Shikezi Huayuan Airport',\n",
       " 'Al Maktoum International Airport',\n",
       " 'Charlottesville Albemarle Airport',\n",
       " 'Ras Al Khaimah International Airport',\n",
       " 'Castlegar/West Kootenay Regional Airport',\n",
       " 'Vadsø Airport',\n",
       " 'Ukraine',\n",
       " 'Grenoble Alpes-Isère Airport',\n",
       " 'General Bartolome Salom International Airport',\n",
       " 'Abha Regional Airport',\n",
       " 'Mopah Airport',\n",
       " 'Falcone–Borsellino Airport',\n",
       " 'Presidente Nicolau Lobato International Airport',\n",
       " 'Josefa Camejo International Airport',\n",
       " 'General Servando Canales International Airport',\n",
       " 'Chicago Midway International Airport',\n",
       " 'Ordu Giresun Airport',\n",
       " 'Christmas Island Airport',\n",
       " 'Goulimime Airport',\n",
       " 'King Island Airport',\n",
       " 'Sierra Maestra Airport',\n",
       " 'Myeik Airport',\n",
       " 'Niederrhein Airport',\n",
       " 'Muan International Airport',\n",
       " 'São Gabriel da Cachoeira Airport',\n",
       " 'Hodeidah International Airport',\n",
       " 'Arnold Palmer Regional Airport',\n",
       " 'Port Heiden Airport',\n",
       " 'Oshima Airport',\n",
       " 'University Park Airport',\n",
       " 'Yulin Airport',\n",
       " 'Fuyang Xiguan Airport',\n",
       " 'Phu Quoc Airport',\n",
       " 'Santiago de Compostela Airport',\n",
       " 'Melbourne Essendon Airport',\n",
       " 'Viru Viru International Airport',\n",
       " 'Regina International Airport',\n",
       " 'Bedourie Airport',\n",
       " 'Dipolog Airport',\n",
       " 'Quatro de Fevereiro Airport',\n",
       " 'Weifang Airport',\n",
       " 'Trondheim Airport, Værnes',\n",
       " 'Turaif Domestic Airport',\n",
       " 'Macau International Airport',\n",
       " 'False Pass Airport',\n",
       " 'Henri Coanda International Airport',\n",
       " 'Sara Airport',\n",
       " 'Rio de Janeiro ,Galeao Antonio Carlos Jobim International Airport',\n",
       " 'Ireland West Knock Airport',\n",
       " 'Sohag International Airport',\n",
       " 'San Cristóbal Airport',\n",
       " 'Tianjin Binhai International Airport',\n",
       " 'Tallahassee Regional Airport',\n",
       " 'Reus Air Base',\n",
       " 'Orange Walk Airport',\n",
       " 'Chita-Kadala Airport',\n",
       " 'Suriname',\n",
       " 'Ashgabat Airport',\n",
       " 'Hartsfield - Jackson Atlanta International Airport',\n",
       " 'Madang Airport',\n",
       " 'Tweed New Haven Airport',\n",
       " 'Buenos Aires, Ministro Pistarini International Airport',\n",
       " 'L M Clayton Airport',\n",
       " 'Tacheng Airport',\n",
       " 'Guangyuan Airport',\n",
       " 'Paris Beauvais Tillé Airport',\n",
       " 'Libya',\n",
       " 'Nagasaki Airport',\n",
       " 'Xilinhot Airport',\n",
       " 'Menara Airport',\n",
       " 'Badajoz Airport',\n",
       " 'Pensacola Regional Airport',\n",
       " 'Gainesville Regional Airport',\n",
       " 'Laoag International Airport',\n",
       " 'The Pas Airport',\n",
       " 'Malta',\n",
       " 'Bojnord Airport',\n",
       " 'Alashankou Bole (Bortala) airport',\n",
       " 'Sorong (Jefman) Airport',\n",
       " 'Mbandaka Airport',\n",
       " 'Nantong Airport',\n",
       " 'Tirana International Airport Mother Teresa',\n",
       " 'Balıkesir Körfez Airport',\n",
       " 'Charlo Airport',\n",
       " 'Suvarnabhumi Bangkok International Airport',\n",
       " 'Tavie Airport',\n",
       " 'Sfax Thyna International Airport',\n",
       " 'Huatugou Airport',\n",
       " 'Bremen Airport',\n",
       " 'Kimmirut Airport',\n",
       " 'Richmond International Airport',\n",
       " 'Westerland Sylt Airport',\n",
       " 'St George Airport',\n",
       " 'Kitakyūshū Airport',\n",
       " 'Fort St John Airport',\n",
       " 'Ellisras Matimba Airport',\n",
       " 'Bucholz Army Air Field',\n",
       " 'Sand Point Airport',\n",
       " 'Genoa Cristoforo Colombo Airport',\n",
       " 'Ørsta-Volda Airport, Hovden',\n",
       " 'Barinas Airport',\n",
       " 'Tokachi-Obihiro Airport',\n",
       " 'Quepos Managua Airport',\n",
       " 'Arctic Village Airport',\n",
       " 'Hermanos Serdán International Airport',\n",
       " 'Saipan International Airport',\n",
       " 'Lampang Airport',\n",
       " 'Keewaywin Airport',\n",
       " 'Latvia',\n",
       " 'New Zealand',\n",
       " 'Nairobi, Jomo Kenyatta International Airport',\n",
       " 'King Fahd International Airport',\n",
       " 'Dushanbe Airport',\n",
       " 'Nouadhibou International Airport',\n",
       " 'Bubung Airport',\n",
       " 'Amami Airport',\n",
       " 'Tabriz International Airport',\n",
       " 'Amsterdam Airport Schiphol',\n",
       " 'Gyumri Shirak Airport',\n",
       " 'Reunion',\n",
       " 'Malta International Airport',\n",
       " 'Moshoeshoe I International Airport',\n",
       " 'Mali',\n",
       " 'Transilvania Târgu Mureş International Airport',\n",
       " 'Leonardo da Vinci-Fiumicino International Airport',\n",
       " 'Algeria',\n",
       " 'Yamaguchi Ube Airport',\n",
       " 'Jorge Newbery Airpark',\n",
       " 'Narathiwat Airport',\n",
       " 'Horn Island Airport',\n",
       " 'Deer Lake Airport',\n",
       " 'Morondava Airport',\n",
       " 'Dimokritos Airport',\n",
       " 'Lilongwe International Airport',\n",
       " 'Christchurch International Airport',\n",
       " 'Jaipur International Airport',\n",
       " 'Hualien Airport',\n",
       " 'Tel Aviv, Ben Gurion International Airport',\n",
       " 'Kaukura Airport',\n",
       " 'Naryan Mar Airport',\n",
       " 'Waingapu Airport',\n",
       " 'Coronel FAP Francisco Secada Vignetta International Airport',\n",
       " 'Moree Airport',\n",
       " 'Sivas Airport',\n",
       " 'Japan',\n",
       " 'Rennes-Saint-Jacques Airport',\n",
       " 'Jose Joaquin de Olmedo International Airport',\n",
       " 'Savusavu Airport',\n",
       " 'Samos Airport',\n",
       " 'Manuel Márquez de León International Airport',\n",
       " 'Smithers Airport',\n",
       " 'Myrtle Beach International Airport',\n",
       " 'Tamarindo De Santa Cruz Airport',\n",
       " 'Dinard-Pleurtuit-Saint-Malo Airport',\n",
       " 'K. D. Matanzima Airport',\n",
       " 'Waterford Airport',\n",
       " 'Béchar Boudghene Ben Ali Lotfi Airport',\n",
       " 'Gassim/Prince Nayef bin Abdulaziz Regional Airport',\n",
       " 'Toronto Pearson International Airport',\n",
       " 'Nadym Airport',\n",
       " 'Santiago Perez Airport',\n",
       " 'Herat Airport',\n",
       " 'Bangor International Airport',\n",
       " 'Gambella Airport',\n",
       " 'Chania International Airport',\n",
       " 'General Lucio Blanco International Airport',\n",
       " 'Alta Floresta Airport',\n",
       " 'Fort Worth Alliance Airport',\n",
       " 'Catania-Fontanarossa Airport',\n",
       " 'Örnsköldsvik Airport',\n",
       " 'Senai International Airport',\n",
       " 'Khabarovsk-Novy Airport',\n",
       " 'Manila, Ninoy Aquino International Airport',\n",
       " 'Linfen Qiaoli Airport',\n",
       " 'Dong Hoi Airport',\n",
       " 'Abraham Lincoln Capital Airport',\n",
       " 'Virac Airport',\n",
       " 'Clark International Airport',\n",
       " 'Soekarno-Hatta International Airport',\n",
       " 'Bartolomeu Lisandro Airport',\n",
       " 'Lima, Jorge Chavez International Airport',\n",
       " 'Grise Fiord Airport',\n",
       " 'Sainte Marie Airport',\n",
       " 'Caçador Airport',\n",
       " 'Port Gentil Airport',\n",
       " 'Austin Bergstrom International Airport',\n",
       " 'Kaltag Airport',\n",
       " 'Bemidji Regional Airport',\n",
       " 'Al Ain International Airport',\n",
       " 'Thessaloniki Macedonia International Airport',\n",
       " 'General Francisco J. Mujica International Airport',\n",
       " 'General Abelardo L. Rodríguez International Airport',\n",
       " 'Montgomery Regional (Dannelly Field) Airport',\n",
       " 'Sialkot Airport',\n",
       " \"Nice-Cote d'Azur Airport\",\n",
       " 'Fort Yukon Airport',\n",
       " 'Quinhagak Airport',\n",
       " 'South Arkansas Regional At Goodwin Field',\n",
       " 'Rockhampton Airport',\n",
       " 'Da Nang International Airport',\n",
       " 'Ballina Byron Gateway Airport',\n",
       " 'Bonaire - Sint Eustatius and Saba',\n",
       " 'Thailand',\n",
       " 'Antonio Rivera Rodriguez Airport',\n",
       " 'Kingston, Norman Manley International Airport',\n",
       " 'Guarani International Airport',\n",
       " 'Abbotsford Airport',\n",
       " 'Nuku Hiva Airport',\n",
       " 'Dallas/Fort Worth International Airport',\n",
       " 'Goodnews Airport',\n",
       " 'Coober Pedy Airport',\n",
       " 'Kushiro Airport',\n",
       " 'Frank Pais International Airport',\n",
       " 'Süleyman Demirel International Airport',\n",
       " 'Porto Santo Airport',\n",
       " 'Ostend-Bruges International Airport',\n",
       " 'Terrace Airport',\n",
       " 'Mashhad International Airport',\n",
       " 'Rizhao Shanzihe Airport',\n",
       " 'Newquay Cornwall Airport',\n",
       " 'Zhengzhou Xinzheng International Airport',\n",
       " 'Sleetmute Airport',\n",
       " 'Zhuhai Airport',\n",
       " 'Pitt Greenville Airport',\n",
       " 'Katiu Airport',\n",
       " 'Ketchikan International Airport',\n",
       " 'Bayankhongor Airport',\n",
       " 'Lonorore Airport',\n",
       " 'Kédougou Airport',\n",
       " 'Nalchik Airport',\n",
       " 'Aupaluk Airport',\n",
       " 'Saint Vincent and Grenadines',\n",
       " 'Nauru',\n",
       " 'Topeka Regional Airport - Forbes Field',\n",
       " 'Buffalo Niagara International Airport',\n",
       " 'Bosaso Airport',\n",
       " 'Mansa Airport',\n",
       " 'Madagascar',\n",
       " 'Roshchino International Airport',\n",
       " 'Tarko-Sale Airport',\n",
       " 'Syktyvkar Airport',\n",
       " 'Meadows Field',\n",
       " 'Vanuatu',\n",
       " 'Makung Airport',\n",
       " 'Durango La Plata County Airport',\n",
       " 'Panama Pacific International Airport',\n",
       " 'Enrique Malek International Airport',\n",
       " 'Lea County Regional Airport',\n",
       " 'Ford Airport',\n",
       " 'Hosea Kutako International Airport',\n",
       " 'Kitale Airport',\n",
       " 'Wales Airport',\n",
       " 'Nakhon Si Thammarat Airport',\n",
       " 'Tokua Airport',\n",
       " 'Broome International Airport',\n",
       " 'Athens Ben Epps Airport',\n",
       " 'El Golea Airport',\n",
       " 'Léopold Sédar Senghor International Airport',\n",
       " 'Rum Cay Airport',\n",
       " 'Lynchburg Regional Preston Glenn Field',\n",
       " 'Saint John Airport',\n",
       " 'Waynesville-St. Robert Regional Forney field',\n",
       " 'Bob Baker Memorial Airport',\n",
       " 'Gode Airport',\n",
       " 'Macedonia',\n",
       " 'Australia',\n",
       " 'San Marino',\n",
       " 'Sri Guru Ram Dass Jee International Airport',\n",
       " 'Itaituba Airport',\n",
       " 'Range Regional Airport',\n",
       " 'Zhoushan Airport',\n",
       " 'Campo Grande Airport',\n",
       " 'Owen Roberts International Airport',\n",
       " 'Ordos Ejin Horo Airport',\n",
       " 'Dillingham Airport',\n",
       " 'Haines Airport',\n",
       " 'Melilla Airport',\n",
       " 'Iloilo International Airport',\n",
       " 'Chubu Centrair International Airport',\n",
       " 'Larnaca International Airport',\n",
       " 'La Rochelle-Île de Ré Airport',\n",
       " 'Turin Airport',\n",
       " 'Sultan Azlan Shah Airport',\n",
       " 'Ireland',\n",
       " 'Baoshan Yunduan Airport',\n",
       " 'Karlstad Airport',\n",
       " 'Sir Bani Yas Island Airport',\n",
       " 'Santorini Airport',\n",
       " 'Paros Airport',\n",
       " 'Honiara International Airport',\n",
       " 'Zona da Mata Regional Airport',\n",
       " 'Prof. Eribelto Manoel Reino State Airport',\n",
       " 'Kumasi Airport',\n",
       " 'Olympic Dam Airport',\n",
       " 'Turukhansk Airport',\n",
       " 'Noto Airport',\n",
       " 'Chingozi Airport',\n",
       " 'Birmingham International Airport',\n",
       " 'Orenburg Central Airport',\n",
       " 'Daocheng Yading Airport',\n",
       " 'Kuai, Lihue Airport',\n",
       " 'Lauro Kurtz Airport',\n",
       " 'Bethel Airport',\n",
       " 'Brigadier Antonio Parodi Airport',\n",
       " 'Wellington International Airport',\n",
       " 'Torsby Airport',\n",
       " 'Iskandar Airport',\n",
       " 'Port Lions Airport',\n",
       " 'Maldives',\n",
       " 'Ufa International Airport',\n",
       " 'Bearskin Lake Airport',\n",
       " 'Port Harcourt International Airport',\n",
       " 'Philippines',\n",
       " 'Eduardo Falla Solano Airport',\n",
       " 'Cambridge Bay Airport',\n",
       " 'Sultan Thaha Airport',\n",
       " 'Ciudad Obregón International Airport',\n",
       " 'Central Nebraska Regional Airport',\n",
       " 'Mannheim-City Airport',\n",
       " 'V.C. Bird International Airport',\n",
       " 'Jamestown Regional Airport',\n",
       " 'Chuuk International Airport',\n",
       " 'Szczecin-Goleniów Solidarność Airport',\n",
       " 'Yiershi Airport',\n",
       " 'Jyvaskyla Airport',\n",
       " 'Ciampino–G. B. Pastine International Airport',\n",
       " 'Hilton Head Airport',\n",
       " 'Luxembourg-Findel International Airport',\n",
       " 'Bou Chekif Airport',\n",
       " 'Palau',\n",
       " 'Agen-La Garenne Airport',\n",
       " 'Ulaangom Airport',\n",
       " 'Campbeltown Airport',\n",
       " 'Yuncheng Guangong Airport',\n",
       " 'Joplin Regional Airport',\n",
       " 'Gerardo Tobar López Airport',\n",
       " 'Wuhai Airport',\n",
       " 'LTS Pulau Redang Airport',\n",
       " 'General Pedro Jose Mendez International Airport',\n",
       " 'Imperial County Airport',\n",
       " 'Easterwood Field',\n",
       " 'Rhodes, Diagoras Airport',\n",
       " 'Mallam Aminu International Airport',\n",
       " 'Iwakuni Marine Corps Air Station',\n",
       " 'Matei Airport',\n",
       " 'St. Anthony Airport',\n",
       " 'Winnipeg / James Armstrong Richardson International Airport',\n",
       " 'Catamarca Airport',\n",
       " 'Phnom Penh International Airport',\n",
       " 'Kooddoo Airport',\n",
       " 'Augusta Regional At Bush Field',\n",
       " 'Sheldon Point Airport',\n",
       " 'Drake Bay Airport',\n",
       " 'Singapore',\n",
       " 'Peru',\n",
       " 'Alexander the Great International Airport',\n",
       " 'EuroAirport Basle-Mulhouse-Freiburg Airport',\n",
       " 'Kunming Wujiaba International Airport',\n",
       " 'Chippewa Valley Regional Airport',\n",
       " 'Blackpool International Airport',\n",
       " 'Martinique',\n",
       " 'Ministro Victor Konder International Airport',\n",
       " 'Sharm El Sheikh International Airport',\n",
       " 'San Luis County Regional Airport',\n",
       " 'Churchill Falls Airport',\n",
       " 'Belgrade Nikola Tesla Airport',\n",
       " 'Liberia',\n",
       " 'Whyalla Airport',\n",
       " 'Rochester International Airport',\n",
       " 'Mariscal Sucre International Airport',\n",
       " 'Bonaire, Flamingo International Airport',\n",
       " 'Kosrae International Airport',\n",
       " 'Four Corners Regional Airport',\n",
       " 'Wainwright Airport',\n",
       " 'Kulob Airport',\n",
       " 'Idaho Falls Regional Airport',\n",
       " 'Wagga Wagga City Airport',\n",
       " 'Toussaint Louverture International Airport',\n",
       " 'Zenata – Messali El Hadj Airport',\n",
       " 'Cotopaxi International Airport',\n",
       " 'Dublin International Airport',\n",
       " 'New Bedford Regional Airport',\n",
       " 'Toledo Express Airport',\n",
       " \"Hassi R'Mel Airport\",\n",
       " 'Armenia',\n",
       " 'Termez Airport',\n",
       " 'Hubli Airport',\n",
       " 'Golmud Airport',\n",
       " 'Stronsay Airport',\n",
       " 'Montevideo, Carrasco International /General C L Berisso Airport',\n",
       " 'Rurenabaque Airport',\n",
       " 'Batna Airport',\n",
       " 'Dezful Airport',\n",
       " 'Sardar Vallabhbhai Patel International Airport',\n",
       " 'Hooper Bay Airport',\n",
       " 'Funafuti International Airport',\n",
       " 'Evansville Regional Airport',\n",
       " 'Timor-Leste',\n",
       " 'Muscat International Airport',\n",
       " 'Ipota Airport',\n",
       " 'São Pedro Airport',\n",
       " \"Martha's Vineyard Airport\",\n",
       " 'Camilo Daza International Airport',\n",
       " 'Antonio B. Won Pat International Airport',\n",
       " 'Dryden Regional Airport',\n",
       " 'Rondonópolis Airport',\n",
       " 'Anguilla',\n",
       " 'Marau Airport',\n",
       " 'Eday Airport',\n",
       " 'Marechal Rondon Airport',\n",
       " 'Mendi Airport',\n",
       " 'Maestro Wilson Fonseca Airport',\n",
       " 'Altoona Blair County Airport',\n",
       " 'Almirante Padilla Airport',\n",
       " 'Greenville Spartanburg International Airport',\n",
       " 'Diyarbakir Airport',\n",
       " 'Charlottetown Airport',\n",
       " 'Ukhta Airport',\n",
       " 'General E. Mosconi Airport',\n",
       " 'Skiros Airport',\n",
       " 'Momote Airport',\n",
       " 'Stevens Village Airport',\n",
       " 'Mehrabad International Airport',\n",
       " 'Silver Creek Airport',\n",
       " 'Aomori Airport',\n",
       " 'Kufra Airport',\n",
       " ...]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().has('runways', P.neq(4)).count().next()\n",
    "g.V().has('runways', P.neq(4)).values('desc').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## not()\n",
    "__Can also achieve the same thing__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().not_(__.values('runways').is_(4)).count().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## and()\n",
    "__To add another condition__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'runways': [5], 'code': ['NSN']},\n",
       " {'runways': [1], 'code': ['VHC']},\n",
       " {'runways': [2], 'code': ['CIC']},\n",
       " {'runways': [1], 'code': ['JOS']},\n",
       " {'runways': [2], 'code': ['SDU']},\n",
       " {'runways': [1], 'code': ['YLW']},\n",
       " {'runways': [2], 'code': ['SOW']},\n",
       " {'runways': [2], 'code': ['ESB']},\n",
       " {'runways': [1], 'code': ['LCR']},\n",
       " {'runways': [1], 'code': ['BID']},\n",
       " {'runways': [1], 'code': ['VFA']},\n",
       " {'runways': [1], 'code': ['VIN']},\n",
       " {'runways': [1], 'code': ['CGQ']},\n",
       " {'runways': [2], 'code': ['BUC']},\n",
       " {'runways': [1], 'code': ['BZV']},\n",
       " {'runways': [1], 'code': ['LMP']},\n",
       " {'runways': [2], 'code': ['UPG']},\n",
       " {'runways': [1], 'code': ['YLE']},\n",
       " {'runways': [1], 'code': ['CUZ']},\n",
       " {'runways': [1], 'code': ['CEM']},\n",
       " {'runways': [2], 'code': ['PER']},\n",
       " {'runways': [1], 'code': ['GYN']},\n",
       " {'runways': [2], 'code': ['ASM']},\n",
       " {'runways': [1], 'code': ['MQM']},\n",
       " {'runways': [1], 'code': ['JXA']},\n",
       " {'runways': [1], 'code': ['KCO']},\n",
       " {'runways': [2], 'code': ['HOT']},\n",
       " {'runways': [1], 'code': ['DIG']},\n",
       " {'runways': [2], 'code': ['TLN']},\n",
       " {'runways': [2], 'code': ['NAG']},\n",
       " {'runways': [1], 'code': ['SGD']},\n",
       " {'runways': [2], 'code': ['SLL']},\n",
       " {'code': ['CD']},\n",
       " {'runways': [2], 'code': ['FOD']},\n",
       " {'runways': [2], 'code': ['OAG']},\n",
       " {'runways': [2], 'code': ['LRE']},\n",
       " {'runways': [2], 'code': ['DSM']},\n",
       " {'code': ['OC']},\n",
       " {'runways': [1], 'code': ['PUG']},\n",
       " {'runways': [1], 'code': ['MUX']},\n",
       " {'runways': [1], 'code': ['KTT']},\n",
       " {'runways': [1], 'code': ['PHO']},\n",
       " {'runways': [1], 'code': ['URA']},\n",
       " {'runways': [1], 'code': ['UTS']},\n",
       " {'runways': [1], 'code': ['RHD']},\n",
       " {'runways': [1], 'code': ['BBK']},\n",
       " {'runways': [1], 'code': ['SZG']},\n",
       " {'runways': [1], 'code': ['NMA']},\n",
       " {'runways': [1], 'code': ['MUE']},\n",
       " {'code': ['OM']},\n",
       " {'runways': [1], 'code': ['CCV']},\n",
       " {'runways': [2], 'code': ['PTU']},\n",
       " {'runways': [1], 'code': ['BHD']},\n",
       " {'runways': [1], 'code': ['HOI']},\n",
       " {'runways': [2], 'code': ['FLO']},\n",
       " {'runways': [1], 'code': ['SPR']},\n",
       " {'runways': [1], 'code': ['BUA']},\n",
       " {'runways': [1], 'code': ['TMU']},\n",
       " {'runways': [1], 'code': ['CNX']},\n",
       " {'runways': [2], 'code': ['JNB']},\n",
       " {'runways': [2], 'code': ['SXF']},\n",
       " {'runways': [1], 'code': ['RAH']},\n",
       " {'runways': [1], 'code': ['HDM']},\n",
       " {'runways': [2], 'code': ['HDS']},\n",
       " {'runways': [1], 'code': ['QSF']},\n",
       " {'runways': [2], 'code': ['GKA']},\n",
       " {'runways': [1], 'code': ['OMO']},\n",
       " {'runways': [1], 'code': ['YNB']},\n",
       " {'runways': [1], 'code': ['PZB']},\n",
       " {'runways': [1], 'code': ['FUK']},\n",
       " {'runways': [1], 'code': ['KVG']},\n",
       " {'runways': [1], 'code': ['OMC']},\n",
       " {'runways': [1], 'code': ['JUB']},\n",
       " {'runways': [2], 'code': ['NRT']},\n",
       " {'runways': [1], 'code': ['JSU']},\n",
       " {'runways': [1], 'code': ['LUO']},\n",
       " {'runways': [1], 'code': ['RSW']},\n",
       " {'runways': [2], 'code': ['MSL']},\n",
       " {'runways': [2], 'code': ['JHW']},\n",
       " {'runways': [1], 'code': ['YPW']},\n",
       " {'runways': [1], 'code': ['BRQ']},\n",
       " {'runways': [2], 'code': ['KOE']},\n",
       " {'runways': [1], 'code': ['HRK']},\n",
       " {'code': ['SN']},\n",
       " {'runways': [1], 'code': ['TME']},\n",
       " {'runways': [1], 'code': ['MIR']},\n",
       " {'runways': [2], 'code': ['JAN']},\n",
       " {'runways': [1], 'code': ['GUW']},\n",
       " {'runways': [2], 'code': ['BFS']},\n",
       " {'code': ['IR']},\n",
       " {'code': ['IM']},\n",
       " {'runways': [1], 'code': ['HYD']},\n",
       " {'runways': [1], 'code': ['KQT']},\n",
       " {'runways': [1], 'code': ['SOU']},\n",
       " {'runways': [1], 'code': ['SMK']},\n",
       " {'runways': [1], 'code': ['REP']},\n",
       " {'code': ['MY']},\n",
       " {'runways': [2], 'code': ['MYA']},\n",
       " {'runways': [1], 'code': ['BAQ']},\n",
       " {'runways': [1], 'code': ['TSR']},\n",
       " {'runways': [1], 'code': ['PPN']},\n",
       " {'runways': [1], 'code': ['YPC']},\n",
       " {'code': ['SK']},\n",
       " {'runways': [1], 'code': ['TAK']},\n",
       " {'runways': [1], 'code': ['EEK']},\n",
       " {'runways': [1], 'code': ['LRS']},\n",
       " {'runways': [1], 'code': ['VRA']},\n",
       " {'runways': [1], 'code': ['AKX']},\n",
       " {'runways': [1], 'code': ['PRA']},\n",
       " {'runways': [1], 'code': ['CIZ']},\n",
       " {'runways': [1], 'code': ['AVL']},\n",
       " {'runways': [2], 'code': ['DVL']},\n",
       " {'runways': [1], 'code': ['CLY']},\n",
       " {'runways': [1], 'code': ['FNC']},\n",
       " {'runways': [1], 'code': ['DLA']},\n",
       " {'runways': [1], 'code': ['ODO']},\n",
       " {'runways': [1], 'code': ['MLX']},\n",
       " {'runways': [1], 'code': ['SDQ']},\n",
       " {'code': ['ER']},\n",
       " {'runways': [1], 'code': ['BHR']},\n",
       " {'runways': [1], 'code': ['IPI']},\n",
       " {'runways': [1], 'code': ['YBC']},\n",
       " {'runways': [1], 'code': ['FRS']},\n",
       " {'runways': [2], 'code': ['MMO']},\n",
       " {'runways': [1], 'code': ['WNA']},\n",
       " {'runways': [1], 'code': ['BIA']},\n",
       " {'runways': [2], 'code': ['BZO']},\n",
       " {'runways': [1], 'code': ['ZMT']},\n",
       " {'runways': [1], 'code': ['GCH']},\n",
       " {'runways': [1], 'code': ['PZI']},\n",
       " {'code': ['KW']},\n",
       " {'runways': [1], 'code': ['CKY']},\n",
       " {'code': ['EH']},\n",
       " {'runways': [1], 'code': ['BMV']},\n",
       " {'runways': [2], 'code': ['LDY']},\n",
       " {'runways': [1], 'code': ['CWL']},\n",
       " {'runways': [1], 'code': ['EYP']},\n",
       " {'runways': [1], 'code': ['HOE']},\n",
       " {'runways': [1], 'code': ['RJL']},\n",
       " {'runways': [1], 'code': ['LRM']},\n",
       " {'runways': [1], 'code': ['KDV']},\n",
       " {'runways': [1], 'code': ['PVC']},\n",
       " {'runways': [1], 'code': ['MNT']},\n",
       " {'runways': [1], 'code': ['BQS']},\n",
       " {'runways': [1], 'code': ['PJM']},\n",
       " {'runways': [1], 'code': ['YSK']},\n",
       " {'runways': [1], 'code': ['LJU']},\n",
       " {'code': ['AT']},\n",
       " {'runways': [1], 'code': ['FLG']},\n",
       " {'code': ['EU']},\n",
       " {'runways': [2], 'code': ['AGB']},\n",
       " {'runways': [2], 'code': ['MBA']},\n",
       " {'runways': [1], 'code': ['TTA']},\n",
       " {'runways': [2], 'code': ['KAT']},\n",
       " {'runways': [1], 'code': ['CPO']},\n",
       " {'code': ['UK']},\n",
       " {'runways': [1], 'code': ['PKZ']},\n",
       " {'runways': [1], 'code': ['JBQ']},\n",
       " {'runways': [2], 'code': ['PIH']},\n",
       " {'runways': [1], 'code': ['LEA']},\n",
       " {'runways': [1], 'code': ['LBC']},\n",
       " {'runways': [1], 'code': ['YOJ']},\n",
       " {'runways': [1], 'code': ['CYB']},\n",
       " {'runways': [1], 'code': ['FUT']},\n",
       " {'runways': [1], 'code': ['BZE']},\n",
       " {'code': ['HK']},\n",
       " {'code': ['TR']},\n",
       " {'runways': [1], 'code': ['DMU']},\n",
       " {'runways': [1], 'code': ['UAH']},\n",
       " {'runways': [1], 'code': ['KWT']},\n",
       " {'runways': [2], 'code': ['DIK']},\n",
       " {'runways': [1], 'code': ['SXI']},\n",
       " {'runways': [2], 'code': ['BDS']},\n",
       " {'runways': [2], 'code': ['ATC']},\n",
       " {'code': ['SH']},\n",
       " {'runways': [2], 'code': ['GST']},\n",
       " {'runways': [1], 'code': ['MAZ']},\n",
       " {'runways': [1], 'code': ['BVB']},\n",
       " {'runways': [2], 'code': ['ALG']},\n",
       " {'runways': [2], 'code': ['MZW']},\n",
       " {'runways': [1], 'code': ['VIL']},\n",
       " {'runways': [1], 'code': ['MRD']},\n",
       " {'runways': [1], 'code': ['WXN']},\n",
       " {'runways': [1], 'code': ['PDV']},\n",
       " {'runways': [2], 'code': ['GHA']},\n",
       " {'runways': [2], 'code': ['HVR']},\n",
       " {'runways': [1], 'code': ['BPE']},\n",
       " {'runways': [1], 'code': ['SML']},\n",
       " {'runways': [2], 'code': ['UET']},\n",
       " {'runways': [1], 'code': ['PRI']},\n",
       " {'runways': [1], 'code': ['YKH']},\n",
       " {'runways': [1], 'code': ['LLB']},\n",
       " {'runways': [1], 'code': ['AKV']},\n",
       " {'runways': [1], 'code': ['CFB']},\n",
       " {'runways': [1], 'code': ['YAT']},\n",
       " {'runways': [2], 'code': ['ZAD']},\n",
       " {'runways': [1], 'code': ['WJR']},\n",
       " {'runways': [1], 'code': ['LDU']},\n",
       " {'runways': [1], 'code': ['MOF']},\n",
       " {'runways': [1], 'code': ['YVO']},\n",
       " {'runways': [1], 'code': ['SZY']},\n",
       " {'runways': [1], 'code': ['DLI']},\n",
       " {'runways': [2], 'code': ['HLA']},\n",
       " {'runways': [2], 'code': ['BVI']},\n",
       " {'runways': [2], 'code': ['MHK']},\n",
       " {'runways': [1], 'code': ['REC']},\n",
       " {'runways': [1], 'code': ['KGS']},\n",
       " {'runways': [1], 'code': ['XIY']},\n",
       " {'runways': [1], 'code': ['THL']},\n",
       " {'runways': [1], 'code': ['AKI']},\n",
       " {'runways': [1], 'code': ['MUK']},\n",
       " {'runways': [2], 'code': ['MRY']},\n",
       " {'code': ['NF']},\n",
       " {'runways': [1], 'code': ['DND']},\n",
       " {'runways': [1], 'code': ['CKH']},\n",
       " {'runways': [1], 'code': ['IEV']},\n",
       " {'runways': [1], 'code': ['PWQ']},\n",
       " {'runways': [1], 'code': ['USH']},\n",
       " {'runways': [1], 'code': ['YHI']},\n",
       " {'runways': [1], 'code': ['MQP']},\n",
       " {'runways': [2], 'code': ['IFN']},\n",
       " {'runways': [1], 'code': ['RPR']},\n",
       " {'runways': [1], 'code': ['BCD']},\n",
       " {'code': ['KH']},\n",
       " {'runways': [1], 'code': ['JTC']},\n",
       " {'runways': [1], 'code': ['BMA']},\n",
       " {'runways': [1], 'code': ['MOV']},\n",
       " {'runways': [1], 'code': ['CMG']},\n",
       " {'code': ['IQ']},\n",
       " {'runways': [1], 'code': ['DED']},\n",
       " {'code': ['SE']},\n",
       " {'runways': [2], 'code': ['LPB']},\n",
       " {'runways': [2], 'code': ['BHM']},\n",
       " {'runways': [2], 'code': ['MID']},\n",
       " {'runways': [2], 'code': ['LFR']},\n",
       " {'runways': [1], 'code': ['DZN']},\n",
       " {'runways': [1], 'code': ['TAG']},\n",
       " {'runways': [1], 'code': ['CIX']},\n",
       " {'runways': [1], 'code': ['LXS']},\n",
       " {'runways': [1], 'code': ['SPD']},\n",
       " {'runways': [1], 'code': ['UCB']},\n",
       " {'runways': [2], 'code': ['TGD']},\n",
       " {'runways': [1], 'code': ['PDS']},\n",
       " {'runways': [1], 'code': ['GGT']},\n",
       " {'runways': [2], 'code': ['OTZ']},\n",
       " {'runways': [1], 'code': ['MNI']},\n",
       " {'runways': [1], 'code': ['MIM']},\n",
       " {'runways': [2], 'code': ['MRS']},\n",
       " {'code': ['NI']},\n",
       " {'runways': [1], 'code': ['SVL']},\n",
       " {'code': ['MW']},\n",
       " {'runways': [1], 'code': ['KLL']},\n",
       " {'code': ['KE']},\n",
       " {'runways': [1], 'code': ['KGD']},\n",
       " {'runways': [1], 'code': ['IKT']},\n",
       " {'runways': [1], 'code': ['AJU']},\n",
       " {'runways': [2], 'code': ['YKM']},\n",
       " {'runways': [1], 'code': ['JGN']},\n",
       " {'runways': [2], 'code': ['CYS']},\n",
       " {'runways': [1], 'code': ['RSU']},\n",
       " {'runways': [2], 'code': ['SJU']},\n",
       " {'code': ['CX']},\n",
       " {'runways': [1], 'code': ['LYA']},\n",
       " {'runways': [1], 'code': ['RES']},\n",
       " {'runways': [1], 'code': ['QRW']},\n",
       " {'runways': [5], 'code': ['GIS']},\n",
       " {'runways': [1], 'code': ['BJX']},\n",
       " {'runways': [1], 'code': ['MEA']},\n",
       " {'runways': [2], 'code': ['TOG']},\n",
       " {'runways': [1], 'code': ['BLQ']},\n",
       " {'runways': [2], 'code': ['FSM']},\n",
       " {'runways': [1], 'code': ['DOM']},\n",
       " {'runways': [1], 'code': ['LCY']},\n",
       " {'runways': [1], 'code': ['TRS']},\n",
       " {'runways': [2], 'code': ['CED']},\n",
       " {'runways': [1], 'code': ['BDU']},\n",
       " {'runways': [1], 'code': ['RDP']},\n",
       " {'runways': [1], 'code': ['MRX']},\n",
       " {'runways': [1], 'code': ['PAF']},\n",
       " {'runways': [1], 'code': ['DJJ']},\n",
       " {'runways': [2], 'code': ['SLK']},\n",
       " {'runways': [1], 'code': ['CKB']},\n",
       " {'runways': [1], 'code': ['MXZ']},\n",
       " {'runways': [2], 'code': ['GCC']},\n",
       " {'runways': [1], 'code': ['SHC']},\n",
       " {'runways': [1], 'code': ['CXB']},\n",
       " {'runways': [2], 'code': ['MZR']},\n",
       " {'runways': [1], 'code': ['SVQ']},\n",
       " {'runways': [1], 'code': ['ABJ']},\n",
       " {'runways': [1], 'code': ['UBA']},\n",
       " {'runways': [2], 'code': ['MSO']},\n",
       " {'runways': [2], 'code': ['NYO']},\n",
       " {'runways': [1], 'code': ['NLT']},\n",
       " {'runways': [1], 'code': ['GDQ']},\n",
       " {'runways': [2], 'code': ['GAL']},\n",
       " {'runways': [2], 'code': ['NAN']},\n",
       " {'runways': [1], 'code': ['AYQ']},\n",
       " {'runways': [1], 'code': ['HNY']},\n",
       " {'runways': [1], 'code': ['TGI']},\n",
       " {'runways': [1], 'code': ['PNT']},\n",
       " {'runways': [2], 'code': ['MCN']},\n",
       " {'code': ['RW']},\n",
       " {'runways': [1], 'code': ['ZGU']},\n",
       " {'runways': [1], 'code': ['ACR']},\n",
       " {'runways': [1], 'code': ['CUL']},\n",
       " {'runways': [1], 'code': ['KBR']},\n",
       " {'runways': [1], 'code': ['HFA']},\n",
       " {'runways': [1], 'code': ['FSZ']},\n",
       " {'runways': [1], 'code': ['DLY']},\n",
       " {'runways': [1], 'code': ['STT']},\n",
       " {'runways': [1], 'code': ['MSQ']},\n",
       " {'runways': [1], 'code': ['TPQ']},\n",
       " {'runways': [1], 'code': ['YZZ']},\n",
       " {'runways': [1], 'code': ['RTW']},\n",
       " {'runways': [1], 'code': ['ANV']},\n",
       " {'code': ['JO']},\n",
       " {'runways': [1], 'code': ['CEK']},\n",
       " {'runways': [1], 'code': ['BGG']},\n",
       " {'runways': [1], 'code': ['IKS']},\n",
       " {'runways': [1], 'code': ['TGG']},\n",
       " {'runways': [1], 'code': ['DHI']},\n",
       " {'code': ['CL']},\n",
       " {'runways': [1], 'code': ['TCQ']},\n",
       " {'runways': [1], 'code': ['SFG']},\n",
       " {'runways': [2], 'code': ['SLM']},\n",
       " {'runways': [1], 'code': ['KCK']},\n",
       " {'code': ['NG']},\n",
       " {'runways': [5], 'code': ['NPE']},\n",
       " {'runways': [2], 'code': ['TTN']},\n",
       " {'runways': [1], 'code': ['LPI']},\n",
       " {'code': ['GP']},\n",
       " {'runways': [1], 'code': ['CCP']},\n",
       " {'runways': [1], 'code': ['SAH']},\n",
       " {'runways': [1], 'code': ['BNB']},\n",
       " {'runways': [2], 'code': ['YTH']},\n",
       " {'runways': [1], 'code': ['MDG']},\n",
       " {'runways': [1], 'code': ['TGH']},\n",
       " {'runways': [1], 'code': ['HMA']},\n",
       " {'runways': [2], 'code': ['LRT']},\n",
       " {'runways': [1], 'code': ['YZS']},\n",
       " {'runways': [2], 'code': ['GCK']},\n",
       " {'runways': [1], 'code': ['TBG']},\n",
       " {'runways': [1], 'code': ['RCB']},\n",
       " {'runways': [1], 'code': ['DVO']},\n",
       " {'runways': [1], 'code': ['EVE']},\n",
       " {'runways': [1], 'code': ['SSG']},\n",
       " {'runways': [1], 'code': ['BJV']},\n",
       " {'runways': [1], 'code': ['NOU']},\n",
       " {'runways': [2], 'code': ['YQL']},\n",
       " {'runways': [1], 'code': ['MBI']},\n",
       " {'runways': [1], 'code': ['VDB']},\n",
       " {'runways': [2], 'code': ['KDU']},\n",
       " {'runways': [2], 'code': ['ESC']},\n",
       " {'runways': [1], 'code': ['YPN']},\n",
       " {'runways': [1], 'code': ['KSC']},\n",
       " {'runways': [1], 'code': ['CYO']},\n",
       " {'runways': [1], 'code': ['FOC']},\n",
       " {'runways': [1], 'code': ['HDN']},\n",
       " {'runways': [1], 'code': ['TFN']},\n",
       " {'runways': [1], 'code': ['EGS']},\n",
       " {'runways': [1], 'code': ['ADA']},\n",
       " {'runways': [2], 'code': ['MCX']},\n",
       " {'code': ['MP']},\n",
       " {'runways': [2], 'code': ['GMP']},\n",
       " {'runways': [2], 'code': ['YQQ']},\n",
       " {'runways': [1], 'code': ['USK']},\n",
       " {'runways': [1], 'code': ['BZK']},\n",
       " {'runways': [2], 'code': ['PSA']},\n",
       " {'runways': [2], 'code': ['TNN']},\n",
       " {'runways': [2], 'code': ['IKA']},\n",
       " {'code': ['GN']},\n",
       " {'runways': [1], 'code': ['GOV']},\n",
       " {'code': ['BW']},\n",
       " {'runways': [1], 'code': ['TLL']},\n",
       " {'runways': [1], 'code': ['MXL']},\n",
       " {'runways': [1], 'code': ['THQ']},\n",
       " {'runways': [1], 'code': ['TAY']},\n",
       " {'runways': [1], 'code': ['RYG']},\n",
       " {'runways': [1], 'code': ['JAC']},\n",
       " {'runways': [1], 'code': ['ULH']},\n",
       " {'runways': [1], 'code': ['IBZ']},\n",
       " {'runways': [1], 'code': ['VAN']},\n",
       " {'runways': [5], 'code': ['HLZ']},\n",
       " {'runways': [1], 'code': ['KSJ']},\n",
       " {'runways': [1], 'code': ['BAV']},\n",
       " {'runways': [2], 'code': ['PGF']},\n",
       " {'runways': [2], 'code': ['BOM']},\n",
       " {'runways': [1], 'code': ['CRM']},\n",
       " {'runways': [1], 'code': ['CCM']},\n",
       " {'runways': [1], 'code': ['SDR']},\n",
       " {'runways': [1], 'code': ['VPY']},\n",
       " {'runways': [1], 'code': ['LPM']},\n",
       " {'runways': [1], 'code': ['BOJ']},\n",
       " {'runways': [1], 'code': ['ARH']},\n",
       " {'runways': [2], 'code': ['JAX']},\n",
       " {'runways': [2], 'code': ['VEL']},\n",
       " {'runways': [2], 'code': ['ABY']},\n",
       " {'runways': [1], 'code': ['COO']},\n",
       " {'runways': [1], 'code': ['OHE']},\n",
       " {'runways': [1], 'code': ['PQS']},\n",
       " {'runways': [1], 'code': ['BHV']},\n",
       " {'runways': [1], 'code': ['PLJ']},\n",
       " {'runways': [1], 'code': ['SUJ']},\n",
       " {'runways': [1], 'code': ['HFT']},\n",
       " {'runways': [1], 'code': ['KIV']},\n",
       " {'runways': [1], 'code': ['MKW']},\n",
       " {'runways': [1], 'code': ['SVD']},\n",
       " {'runways': [1], 'code': ['KLN']},\n",
       " {'runways': [1], 'code': ['SHE']},\n",
       " {'runways': [1], 'code': ['MII']},\n",
       " {'runways': [1], 'code': ['SXR']},\n",
       " {'runways': [1], 'code': ['ADF']},\n",
       " {'runways': [1], 'code': ['STI']},\n",
       " {'runways': [2], 'code': ['CDV']},\n",
       " {'runways': [1], 'code': ['DBV']},\n",
       " {'runways': [1], 'code': ['YFJ']},\n",
       " {'runways': [1], 'code': ['CGD']},\n",
       " {'runways': [1], 'code': ['HPG']},\n",
       " {'runways': [1], 'code': ['DWD']},\n",
       " {'runways': [1], 'code': ['BNX']},\n",
       " {'runways': [2], 'code': ['LED']},\n",
       " {'runways': [1], 'code': ['VCL']},\n",
       " {'runways': [1], 'code': ['KOZ']},\n",
       " {'runways': [1], 'code': ['MKM']},\n",
       " {'runways': [1], 'code': ['AFZ']},\n",
       " {'runways': [1], 'code': ['LAM']},\n",
       " {'runways': [1], 'code': ['XSC']},\n",
       " {'runways': [1], 'code': ['BAL']},\n",
       " {'runways': [1], 'code': ['ASE']},\n",
       " {'runways': [1], 'code': ['TJQ']},\n",
       " {'runways': [2], 'code': ['ELU']},\n",
       " {'runways': [1], 'code': ['TOH']},\n",
       " {'runways': [2], 'code': ['EBB']},\n",
       " {'runways': [1], 'code': ['XFN']},\n",
       " {'runways': [1], 'code': ['CTU']},\n",
       " {'runways': [1], 'code': ['KDM']},\n",
       " {'runways': [2], 'code': ['GGW']},\n",
       " {'runways': [1], 'code': ['OAX']},\n",
       " {'runways': [2], 'code': ['YAK']},\n",
       " {'runways': [1], 'code': ['DQA']},\n",
       " {'runways': [1], 'code': ['SPU']},\n",
       " {'runways': [2], 'code': ['YHZ']},\n",
       " {'runways': [2], 'code': ['PSP']},\n",
       " {'runways': [2], 'code': ['YBG']},\n",
       " {'runways': [2], 'code': ['CPT']},\n",
       " {'runways': [2], 'code': ['CHS']},\n",
       " {'runways': [1], 'code': ['RMP']},\n",
       " {'runways': [2], 'code': ['ORK']},\n",
       " {'runways': [2], 'code': ['VNX']},\n",
       " {'runways': [2], 'code': ['YTS']},\n",
       " {'runways': [2], 'code': ['SGF']},\n",
       " {'runways': [2], 'code': ['HGU']},\n",
       " {'runways': [1], 'code': ['MDL']},\n",
       " {'runways': [1], 'code': ['GAE']},\n",
       " {'runways': [1], 'code': ['KUU']},\n",
       " {'runways': [1], 'code': ['RSA']},\n",
       " {'runways': [1], 'code': ['HUI']},\n",
       " {'runways': [1], 'code': ['VKG']},\n",
       " {'runways': [1], 'code': ['KKN']},\n",
       " {'runways': [1], 'code': ['EMA']},\n",
       " {'runways': [1], 'code': ['JPA']},\n",
       " {'runways': [1], 'code': ['HAS']},\n",
       " {'runways': [1], 'code': ['PVK']},\n",
       " {'runways': [1], 'code': ['SHW']},\n",
       " {'runways': [1], 'code': ['FVM']},\n",
       " {'runways': [1], 'code': ['OSS']},\n",
       " {'runways': [1], 'code': ['VAA']},\n",
       " {'runways': [1], 'code': ['RKA']},\n",
       " {'runways': [1], 'code': ['LXG']},\n",
       " {'runways': [1], 'code': ['VCS']},\n",
       " {'runways': [2], 'code': ['CGH']},\n",
       " {'code': ['GQ']},\n",
       " {'runways': [2], 'code': ['TRI']},\n",
       " {'runways': [2], 'code': ['CJU']},\n",
       " {'runways': [1], 'code': ['PEU']},\n",
       " {'runways': [1], 'code': ['KSY']},\n",
       " {'runways': [1], 'code': ['SJE']},\n",
       " {'runways': [1], 'code': ['LOD']},\n",
       " {'runways': [1], 'code': ['RIG']},\n",
       " {'runways': [1], 'code': ['SCV']},\n",
       " {'runways': [1], 'code': ['ALF']},\n",
       " {'code': ['PT']},\n",
       " {'runways': [1], 'code': ['NNY']},\n",
       " {'runways': [1], 'code': ['LRR']},\n",
       " {'runways': [1], 'code': ['BTT']},\n",
       " {'runways': [1], 'code': ['IRZ']},\n",
       " {'runways': [1], 'code': ['OUD']},\n",
       " {'runways': [2], 'code': ['AKL']},\n",
       " {'runways': [1], 'code': ['HGH']},\n",
       " {'runways': [1], 'code': ['QUO']},\n",
       " {'runways': [1], 'code': ['MGS']},\n",
       " {'runways': [2], 'code': ['FAT']},\n",
       " {'runways': [1], 'code': ['CUQ']},\n",
       " {'runways': [1], 'code': ['VCA']},\n",
       " {'runways': [1], 'code': ['BTH']},\n",
       " {'runways': [2], 'code': ['MTJ']},\n",
       " {'runways': [1], 'code': ['RMQ']},\n",
       " {'runways': [2], 'code': ['YQM']},\n",
       " {'runways': [1], 'code': ['KDO']},\n",
       " {'runways': [1], 'code': ['TOS']},\n",
       " {'runways': [1], 'code': ['SYO']},\n",
       " {'runways': [2], 'code': ['OSL']},\n",
       " {'code': ['CZ']},\n",
       " {'runways': [1], 'code': ['YBL']},\n",
       " {'runways': [1], 'code': ['YBX']},\n",
       " {'runways': [1], 'code': ['KID']},\n",
       " {'runways': [1], 'code': ['BEJ']},\n",
       " {'runways': [2], 'code': ['THU']},\n",
       " {'runways': [1], 'code': ['YYH']},\n",
       " {'runways': [1], 'code': ['SKO']},\n",
       " {'runways': [1], 'code': ['ABV']},\n",
       " {'runways': [1], 'code': ['GYU']},\n",
       " {'runways': [1], 'code': ['BDH']},\n",
       " {'code': ['MN']},\n",
       " {'runways': [1], 'code': ['JDZ']},\n",
       " {'runways': [1], 'code': ['PCR']},\n",
       " {'runways': [1], 'code': ['AKU']},\n",
       " {'runways': [1], 'code': ['KBU']},\n",
       " {'runways': [1], 'code': ['XAP']},\n",
       " {'runways': [1], 'code': ['LDE']},\n",
       " {'runways': [2], 'code': ['MEX']},\n",
       " {'runways': [2], 'code': ['LTD']},\n",
       " {'runways': [1], 'code': ['KUT']},\n",
       " {'runways': [1], 'code': ['GDT']},\n",
       " {'runways': [2], 'code': ['LYS']},\n",
       " {'code': ['SA']},\n",
       " {'runways': [1], 'code': ['RKZ']},\n",
       " {'runways': [1], 'code': ['PKY']},\n",
       " {'runways': [1], 'code': ['OUZ']},\n",
       " {'runways': [2], 'code': ['TXK']},\n",
       " {'runways': [1], 'code': ['MYG']},\n",
       " {'runways': [2], 'code': ['RSH']},\n",
       " {'runways': [1], 'code': ['KAC']},\n",
       " {'code': ['CF']},\n",
       " {'runways': [1], 'code': ['ZNZ']},\n",
       " {'runways': [1], 'code': ['SHF']},\n",
       " {'runways': [1], 'code': ['DWC']},\n",
       " {'runways': [1], 'code': ['CHO']},\n",
       " {'runways': [1], 'code': ['RKT']},\n",
       " {'runways': [1], 'code': ['YCG']},\n",
       " {'runways': [1], 'code': ['VDS']},\n",
       " {'code': ['UA']},\n",
       " {'runways': [1], 'code': ['GNB']},\n",
       " {'runways': [1], 'code': ['PBL']},\n",
       " {'runways': [1], 'code': ['AHB']},\n",
       " {'runways': [1], 'code': ['MKQ']},\n",
       " {'runways': [2], 'code': ['PMO']},\n",
       " {'runways': [1], 'code': ['DIL']},\n",
       " {'runways': [1], 'code': ['LSP']},\n",
       " {'runways': [1], 'code': ['MAM']},\n",
       " {'runways': [5], 'code': ['MDW']},\n",
       " {'runways': [1], 'code': ['OGU']},\n",
       " {'runways': [1], 'code': ['XCH']},\n",
       " {'runways': [1], 'code': ['GLN']},\n",
       " {'runways': [1], 'code': ['MZO']},\n",
       " {'runways': [1], 'code': ['MGZ']},\n",
       " {'runways': [1], 'code': ['NRN']},\n",
       " {'runways': [1], 'code': ['MWX']},\n",
       " {'runways': [1], 'code': ['SJL']},\n",
       " {'runways': [1], 'code': ['HOD']},\n",
       " {'runways': [2], 'code': ['LBE']},\n",
       " {'runways': [2], 'code': ['PTH']},\n",
       " {'runways': [1], 'code': ['OIM']},\n",
       " {'runways': [1], 'code': ['SCE']},\n",
       " {'runways': [1], 'code': ['UYN']},\n",
       " {'runways': [1], 'code': ['FUG']},\n",
       " {'runways': [1], 'code': ['PQC']},\n",
       " {'runways': [1], 'code': ['SCQ']},\n",
       " {'runways': [2], 'code': ['MEB']},\n",
       " {'runways': [1], 'code': ['VVI']},\n",
       " {'runways': [2], 'code': ['YQR']},\n",
       " {'runways': [1], 'code': ['BEU']},\n",
       " {'runways': [1], 'code': ['DPL']},\n",
       " {'runways': [2], 'code': ['LAD']},\n",
       " {'runways': [1], 'code': ['WEF']},\n",
       " {'runways': [1], 'code': ['TUI']},\n",
       " {'runways': [1], 'code': ['MFM']},\n",
       " {'runways': [1], 'code': ['KFP']},\n",
       " {'runways': [2], 'code': ['OTP']},\n",
       " {'runways': [1], 'code': ['SSR']},\n",
       " {'runways': [2], 'code': ['GIG']},\n",
       " {'runways': [1], 'code': ['NOC']},\n",
       " {'runways': [1], 'code': ['HMB']},\n",
       " {'runways': [1], 'code': ['SCY']},\n",
       " {'runways': [1], 'code': ['TSN']},\n",
       " {'runways': [2], 'code': ['TLH']},\n",
       " {'runways': [2], 'code': ['REU']},\n",
       " {'runways': [1], 'code': ['ORZ']},\n",
       " {'runways': [2], 'code': ['HTA']},\n",
       " {'code': ['SR']},\n",
       " {'runways': [5], 'code': ['ATL']},\n",
       " {'runways': [1], 'code': ['MAG']},\n",
       " {'runways': [2], 'code': ['HVN']},\n",
       " {'runways': [2], 'code': ['EZE']},\n",
       " {'runways': [1], 'code': ['OLF']},\n",
       " {'runways': [1], 'code': ['TCG']},\n",
       " {'runways': [1], 'code': ['GYS']},\n",
       " {'code': ['LY']},\n",
       " {'runways': [2], 'code': ['NGS']},\n",
       " {'runways': [1], 'code': ['XIL']},\n",
       " {'runways': [1], 'code': ['RAK']},\n",
       " {'runways': [1], 'code': ['BJZ']},\n",
       " {'runways': [2], 'code': ['PNS']},\n",
       " {'runways': [2], 'code': ['GNV']},\n",
       " {'runways': [1], 'code': ['LAO']},\n",
       " {'runways': [1], 'code': ['YQD']},\n",
       " {'code': ['MT']},\n",
       " {'runways': [1], 'code': ['BJB']},\n",
       " {'runways': [1], 'code': ['BPL']},\n",
       " {'runways': [1], 'code': ['SOQ']},\n",
       " {'runways': [1], 'code': ['MDK']},\n",
       " {'runways': [1], 'code': ['NTG']},\n",
       " {'runways': [1], 'code': ['TIA']},\n",
       " {'runways': [1], 'code': ['EDO']},\n",
       " {'runways': [1], 'code': ['YCL']},\n",
       " {'runways': [2], 'code': ['BKK']},\n",
       " {'runways': [1], 'code': ['PBJ']},\n",
       " {'runways': [1], 'code': ['SFA']},\n",
       " {'runways': [1], 'code': ['HTT']},\n",
       " {'runways': [2], 'code': ['BRE']},\n",
       " {'runways': [1], 'code': ['YLC']},\n",
       " {'runways': [2], 'code': ['GWT']},\n",
       " {'runways': [1], 'code': ['STG']},\n",
       " {'runways': [1], 'code': ['KKJ']},\n",
       " {'runways': [2], 'code': ['YXJ']},\n",
       " {'runways': [1], 'code': ['ELL']},\n",
       " {'runways': [1], 'code': ['KWA']},\n",
       " {'runways': [1], 'code': ['SDP']},\n",
       " {'runways': [1], 'code': ['GOA']},\n",
       " {'runways': [1], 'code': ['HOV']},\n",
       " {'runways': [2], 'code': ['BNS']},\n",
       " {'runways': [1], 'code': ['OBO']},\n",
       " {'runways': [1], 'code': ['XQP']},\n",
       " {'runways': [1], 'code': ['ARC']},\n",
       " {'runways': [1], 'code': ['PBC']},\n",
       " {'runways': [1], 'code': ['SPN']},\n",
       " {'runways': [1], 'code': ['LPT']},\n",
       " {'runways': [1], 'code': ['KEW']},\n",
       " {'code': ['LV']},\n",
       " {'code': ['NZ']},\n",
       " {'runways': [1], 'code': ['NBO']},\n",
       " {'runways': [2], 'code': ['DMM']},\n",
       " {'runways': [1], 'code': ['DYU']},\n",
       " {'runways': [1], 'code': ['NDB']},\n",
       " {'runways': [1], 'code': ['LUW']},\n",
       " {'runways': [1], 'code': ['ASJ']},\n",
       " {'runways': [2], 'code': ['TBZ']},\n",
       " {'runways': [6], 'code': ['AMS']},\n",
       " {'runways': [1], 'code': ['LWN']},\n",
       " {'code': ['RE']},\n",
       " {'runways': [2], 'code': ['MLA']},\n",
       " {'runways': [2], 'code': ['MSU']},\n",
       " {'code': ['ML']},\n",
       " {'runways': [1], 'code': ['TGM']},\n",
       " {'code': ['DZ']},\n",
       " {'runways': [1], 'code': ['UBJ']},\n",
       " {'runways': [1], 'code': ['AEP']},\n",
       " {'runways': [1], 'code': ['NAW']},\n",
       " {'runways': [2], 'code': ['HID']},\n",
       " {'runways': [1], 'code': ['YVZ']},\n",
       " {'runways': [2], 'code': ['MOQ']},\n",
       " {'runways': [1], 'code': ['AXD']},\n",
       " {'runways': [1], 'code': ['LLW']},\n",
       " {'runways': [2], 'code': ['JAI']},\n",
       " {'runways': [1], 'code': ['KKR']},\n",
       " {'runways': [1], 'code': ['NNM']},\n",
       " {'runways': [1], 'code': ['WGP']},\n",
       " {'runways': [1], 'code': ['IQT']},\n",
       " {'runways': [2], 'code': ['MRZ']},\n",
       " {'runways': [1], 'code': ['VAS']},\n",
       " {'code': ['JP']},\n",
       " {'runways': [2], 'code': ['RNS']},\n",
       " {'runways': [1], 'code': ['GYE']},\n",
       " {'runways': [1], 'code': ['SVU']},\n",
       " {'runways': [1], 'code': ['SMI']},\n",
       " {'runways': [1], 'code': ['LAP']},\n",
       " {'runways': [1], 'code': ['YYD']},\n",
       " {'runways': [1], 'code': ['MYR']},\n",
       " {'runways': [1], 'code': ['TNO']},\n",
       " {'runways': [2], 'code': ['DNR']},\n",
       " {'runways': [2], 'code': ['UTT']},\n",
       " {'runways': [1], 'code': ['WAT']},\n",
       " {'runways': [2], 'code': ['CBH']},\n",
       " {'runways': [1], 'code': ['ELQ']},\n",
       " {'runways': [5], 'code': ['YYZ']},\n",
       " {'runways': [1], 'code': ['NYM']},\n",
       " {'runways': [1], 'code': ['AUC']},\n",
       " {'runways': [1], 'code': ['HEA']},\n",
       " {'runways': [1], 'code': ['BGR']},\n",
       " {'runways': [1], 'code': ['GMB']},\n",
       " {'runways': [1], 'code': ['CHQ']},\n",
       " {'runways': [1], 'code': ['REX']},\n",
       " {'runways': [1], 'code': ['AFL']},\n",
       " {'runways': [2], 'code': ['AFW']},\n",
       " {'runways': [1], 'code': ['CTA']},\n",
       " {'runways': [1], 'code': ['OER']},\n",
       " {'runways': [1], 'code': ['JHB']},\n",
       " {'runways': [2], 'code': ['KHV']},\n",
       " {'runways': [2], 'code': ['MNL']},\n",
       " {'runways': [1], 'code': ['LFQ']},\n",
       " {'runways': [1], 'code': ['VDH']},\n",
       " {'runways': [1], 'code': ['VRC']},\n",
       " {'runways': [2], 'code': ['CRK']},\n",
       " {'runways': [2], 'code': ['CGK']},\n",
       " {'runways': [1], 'code': ['CAW']},\n",
       " {'runways': [1], 'code': ['LIM']},\n",
       " {'runways': [1], 'code': ['YGZ']},\n",
       " {'runways': [1], 'code': ['SMS']},\n",
       " {'runways': [1], 'code': ['CFC']},\n",
       " {'runways': [1], 'code': ['POG']},\n",
       " {'runways': [2], 'code': ['AUS']},\n",
       " {'runways': [1], 'code': ['KAL']},\n",
       " {'runways': [2], 'code': ['BJI']},\n",
       " {'runways': [1], 'code': ['AAN']},\n",
       " {'runways': [2], 'code': ['SKG']},\n",
       " {'runways': [1], 'code': ['MLM']},\n",
       " {'runways': [1], 'code': ['TIJ']},\n",
       " {'runways': [2], 'code': ['MGM']},\n",
       " {'runways': [1], 'code': ['SKT']},\n",
       " {'runways': [2], 'code': ['NCE']},\n",
       " {'runways': [1], 'code': ['FYU']},\n",
       " {'runways': [1], 'code': ['KWN']},\n",
       " {'runways': [2], 'code': ['ROK']},\n",
       " {'runways': [2], 'code': ['DAD']},\n",
       " {'runways': [1], 'code': ['BNK']},\n",
       " {'code': ['BQ']},\n",
       " {'code': ['TH']},\n",
       " {'runways': [1], 'code': ['VQS']},\n",
       " {'runways': [1], 'code': ['KIN']},\n",
       " {'runways': [1], 'code': ['AGT']},\n",
       " {'runways': [1], 'code': ['NHV']},\n",
       " {'runways': [7], 'code': ['DFW']},\n",
       " {'runways': [1], 'code': ['GNU']},\n",
       " {'runways': [2], 'code': ['CPD']},\n",
       " {'runways': [1], 'code': ['KUH']},\n",
       " {'runways': [1], 'code': ['HOG']},\n",
       " {'runways': [1], 'code': ['ISE']},\n",
       " {'runways': [2], 'code': ['PXO']},\n",
       " {'runways': [2], 'code': ['OST']},\n",
       " {'runways': [2], 'code': ['YXT']},\n",
       " {'runways': [2], 'code': ['MHD']},\n",
       " {'runways': [1], 'code': ['RIZ']},\n",
       " {'runways': [1], 'code': ['NQY']},\n",
       " {'runways': [1], 'code': ['CGO']},\n",
       " {'runways': [1], 'code': ['SLQ']},\n",
       " {'runways': [1], 'code': ['ZUH']},\n",
       " {'runways': [1], 'code': ['KXU']},\n",
       " {'runways': [2], 'code': ['KTN']},\n",
       " {'runways': [2], 'code': ['BYN']},\n",
       " {'runways': [1], 'code': ['LNE']},\n",
       " {'runways': [1], 'code': ['KGG']},\n",
       " {'runways': [1], 'code': ['NAL']},\n",
       " {'runways': [2], 'code': ['YPJ']},\n",
       " {'code': ['VC']},\n",
       " {'code': ['NR']},\n",
       " {'runways': [2], 'code': ['FOE']},\n",
       " {'runways': [2], 'code': ['BUF']},\n",
       " {'runways': [1], 'code': ['BSA']},\n",
       " {'runways': [1], 'code': ['MNS']},\n",
       " {'code': ['MG']},\n",
       " {'runways': [2], 'code': ['TJM']},\n",
       " {'runways': [1], 'code': ['TQL']},\n",
       " {'runways': [1], 'code': ['SCW']},\n",
       " {'runways': [2], 'code': ['BFL']},\n",
       " {'code': ['VU']},\n",
       " {'runways': [1], 'code': ['MZG']},\n",
       " {'runways': [1], 'code': ['DRO']},\n",
       " {'runways': [1], 'code': ['BLB']},\n",
       " {'runways': [1], 'code': ['DAV']},\n",
       " {'runways': [2], 'code': ['IMT']},\n",
       " {'runways': [2], 'code': ['WDH']},\n",
       " {'runways': [1], 'code': ['KTL']},\n",
       " {'runways': [1], 'code': ['WAA']},\n",
       " {'runways': [1], 'code': ['NST']},\n",
       " {'runways': [1], 'code': ['RAB']},\n",
       " {'runways': [1], 'code': ['BME']},\n",
       " {'runways': [2], 'code': ['AHN']},\n",
       " {'runways': [2], 'code': ['ELG']},\n",
       " {'runways': [2], 'code': ['DKR']},\n",
       " {'runways': [1], 'code': ['RCY']},\n",
       " {'runways': [2], 'code': ['LYH']},\n",
       " {'runways': [2], 'code': ['YSJ']},\n",
       " {'runways': [1], 'code': ['TBN']},\n",
       " {'runways': [1], 'code': ['IAN']},\n",
       " {'runways': [1], 'code': ['GDE']},\n",
       " {'code': ['MK']},\n",
       " {'code': ['AU']},\n",
       " {'code': ['SM']},\n",
       " {'runways': [1], 'code': ['ATQ']},\n",
       " {'runways': [1], 'code': ['ITB']},\n",
       " {'runways': [2], 'code': ['HIB']},\n",
       " {'runways': [1], 'code': ['HSN']},\n",
       " {'runways': [1], 'code': ['CGR']},\n",
       " {'runways': [1], 'code': ['GCM']},\n",
       " {'runways': [1], 'code': ['DSN']},\n",
       " {'runways': [1], 'code': ['DLG']},\n",
       " {'runways': [1], 'code': ['HNS']},\n",
       " {'runways': [1], 'code': ['MLN']},\n",
       " {'runways': [1], 'code': ['ILO']},\n",
       " {'runways': [1], 'code': ['NGO']},\n",
       " {'runways': [1], 'code': ['LCA']},\n",
       " {'runways': [1], 'code': ['LRH']},\n",
       " {'runways': [1], 'code': ['TRN']},\n",
       " {'runways': [1], 'code': ['IPH']},\n",
       " {'code': ['IE']},\n",
       " {'runways': [1], 'code': ['BSD']},\n",
       " {'runways': [2], 'code': ['KSD']},\n",
       " {'runways': [1], 'code': ['XSB']},\n",
       " {'runways': [2], 'code': ['JTR']},\n",
       " {'runways': [1], 'code': ['PAS']},\n",
       " {'runways': [1], 'code': ['HIR']},\n",
       " {'runways': [1], 'code': ['IZA']},\n",
       " {'runways': [1], 'code': ['SJP']},\n",
       " {'runways': [1], 'code': ['KMS']},\n",
       " {'runways': [1], 'code': ['OLP']},\n",
       " {'runways': [1], 'code': ['THX']},\n",
       " {'runways': [1], 'code': ['NTQ']},\n",
       " {'runways': [1], 'code': ['TET']},\n",
       " {'runways': [1], 'code': ['BHX']},\n",
       " {'runways': [1], 'code': ['REN']},\n",
       " {'runways': [1], 'code': ['DCY']},\n",
       " {'runways': [2], 'code': ['LIH']},\n",
       " {'runways': [1], 'code': ['PFB']},\n",
       " {'runways': [2], 'code': ['EQS']},\n",
       " {'runways': [1], 'code': ['WLG']},\n",
       " {'runways': [1], 'code': ['TYF']},\n",
       " {'runways': [1], 'code': ['PKN']},\n",
       " {'runways': [1], 'code': ['ORI']},\n",
       " {'code': ['MV']},\n",
       " {'runways': [5], 'code': ['UFA']},\n",
       " {'runways': [1], 'code': ['XBE']},\n",
       " {'runways': [1], 'code': ['PHC']},\n",
       " {'code': ['PH']},\n",
       " {'runways': [2], 'code': ['SVI']},\n",
       " {'runways': [1], 'code': ['YCB']},\n",
       " {'runways': [1], 'code': ['DJB']},\n",
       " {'runways': [1], 'code': ['CEN']},\n",
       " {'runways': [2], 'code': ['GRI']},\n",
       " {'runways': [2], 'code': ['MHG']},\n",
       " {'runways': [1], 'code': ['ANU']},\n",
       " {'runways': [2], 'code': ['JMS']},\n",
       " {'runways': [1], 'code': ['TKK']},\n",
       " {'runways': [1], 'code': ['SZZ']},\n",
       " {'runways': [1], 'code': ['YIE']},\n",
       " {'runways': [1], 'code': ['JYV']},\n",
       " {'runways': [1], 'code': ['CIA']},\n",
       " {'runways': [1], 'code': ['HHH']},\n",
       " {'runways': [1], 'code': ['LUX']},\n",
       " {'runways': [1], 'code': ['TID']},\n",
       " {'code': ['PW']},\n",
       " {'runways': [1], 'code': ['AGF']},\n",
       " {'runways': [1], 'code': ['ULO']},\n",
       " {'runways': [1], 'code': ['CAL']},\n",
       " {'runways': [1], 'code': ['YCU']},\n",
       " {'runways': [1], 'code': ['BUN']},\n",
       " {'runways': [1], 'code': ['WUA']},\n",
       " {'runways': [1], 'code': ['RDN']},\n",
       " {'runways': [2], 'code': ['CVM']},\n",
       " {'runways': [2], 'code': ['IPL']},\n",
       " {'runways': [1], 'code': ['RHO']},\n",
       " {'runways': [2], 'code': ['KAN']},\n",
       " {'runways': [2], 'code': ['IWK']},\n",
       " {'runways': [1], 'code': ['TVU']},\n",
       " {'runways': [1], 'code': ['YAY']},\n",
       " {'runways': [1], 'code': ['CTC']},\n",
       " {'runways': [1], 'code': ['PNH']},\n",
       " {'runways': [1], 'code': ['GKK']},\n",
       " {'runways': [2], 'code': ['AGS']},\n",
       " {'runways': [1], 'code': ['SXP']},\n",
       " {'runways': [1], 'code': ['DRK']},\n",
       " {'code': ['SG']},\n",
       " {'code': ['PE']},\n",
       " {'runways': [1], 'code': ['KVA']},\n",
       " {'runways': [2], 'code': ['BSL']},\n",
       " {'runways': [1], 'code': ['KMG']},\n",
       " {'runways': [2], 'code': ['EAU']},\n",
       " {'code': ['MQ']},\n",
       " {'runways': [1], 'code': ['NVT']},\n",
       " {'runways': [2], 'code': ['SSH']},\n",
       " {'runways': [2], 'code': ['SBP']},\n",
       " {'runways': [1], 'code': ['ZUM']},\n",
       " {'runways': [1], 'code': ['BEG']},\n",
       " {'code': ['LR']},\n",
       " {'runways': [2], 'code': ['WYA']},\n",
       " {'runways': [2], 'code': ['RST']},\n",
       " {'runways': [1], 'code': ['UIO']},\n",
       " {'runways': [1], 'code': ['BON']},\n",
       " {'runways': [1], 'code': ['KSA']},\n",
       " {'runways': [2], 'code': ['FMN']},\n",
       " {'runways': [1], 'code': ['AIN']},\n",
       " {'runways': [1], 'code': ['TJU']},\n",
       " {'runways': [2], 'code': ['IDA']},\n",
       " {'runways': [2], 'code': ['WGA']},\n",
       " {'runways': [1], 'code': ['PAP']},\n",
       " {'runways': [1], 'code': ['TLM']},\n",
       " {'runways': [1], 'code': ['LTX']},\n",
       " {'runways': [2], 'code': ['DUB']},\n",
       " {'runways': [2], 'code': ['EWB']},\n",
       " {'runways': [2], 'code': ['TOL']},\n",
       " {'runways': [2], 'code': ['HRM']},\n",
       " {'code': ['AM']},\n",
       " {'runways': [1], 'code': ['TMJ']},\n",
       " {'runways': [1], 'code': ['HBX']},\n",
       " {'runways': [1], 'code': ['GOQ']},\n",
       " {'runways': [1], 'code': ['RBQ']},\n",
       " {'runways': [1], 'code': ['BLJ']},\n",
       " {'runways': [2], 'code': ['DEF']},\n",
       " {'runways': [1], 'code': ['AMD']},\n",
       " {'runways': [1], 'code': ['HPB']},\n",
       " {'runways': [1], 'code': ['FUN']},\n",
       " {'code': ['TL']},\n",
       " {'runways': [2], 'code': ['MCT']},\n",
       " {'runways': [1], 'code': ['IPA']},\n",
       " {'runways': [1], 'code': ['VXE']},\n",
       " {'runways': [2], 'code': ['CUC']},\n",
       " {'runways': [2], 'code': ['GUM']},\n",
       " {'runways': [2], 'code': ['YHD']},\n",
       " {'runways': [1], 'code': ['ROO']},\n",
       " {'code': ['AI']},\n",
       " {'runways': [1], 'code': ['RUS']},\n",
       " {'runways': [2], 'code': ['EOI']},\n",
       " {'runways': [1], 'code': ['CGB']},\n",
       " {'runways': [1], 'code': ['MDU']},\n",
       " {'runways': [1], 'code': ['STM']},\n",
       " {'runways': [2], 'code': ['AOO']},\n",
       " {'runways': [2], 'code': ['RCH']},\n",
       " {'runways': [1], 'code': ['GSP']},\n",
       " {'runways': [1], 'code': ['DIY']},\n",
       " {'runways': [2], 'code': ['YYG']},\n",
       " {'runways': [1], 'code': ['UCT']},\n",
       " {'runways': [1], 'code': ['CRD']},\n",
       " {'runways': [1], 'code': ['SKU']},\n",
       " {'runways': [1], 'code': ['MAS']},\n",
       " {'runways': [1], 'code': ['SVS']},\n",
       " {'runways': [1], 'code': ['SVK']},\n",
       " {'runways': [1], 'code': ['AOJ']},\n",
       " {'runways': [2], 'code': ['AKF']},\n",
       " {'runways': [1], 'code': ['MQN']},\n",
       " {'runways': [1], 'code': ['BPX']},\n",
       " {'runways': [1], 'code': ['HAQ']},\n",
       " {'runways': [1], 'code': ['GLT']},\n",
       " {'runways': [2], 'code': ['SHX']},\n",
       " {'runways': [1], 'code': ['SFT']},\n",
       " {'runways': [1], 'code': ['HAC']},\n",
       " {'runways': [1], 'code': ['SEN']},\n",
       " {'runways': [1], 'code': ['OKA']},\n",
       " {'runways': [1], 'code': ['JUH']},\n",
       " {'runways': [1], 'code': ['KIS']},\n",
       " {'runways': [1], 'code': ['CAB']},\n",
       " {'runways': [2], 'code': ['YYR']},\n",
       " {'runways': [2], 'code': ['YVP']},\n",
       " {'runways': [1], 'code': ['ZLT']},\n",
       " {'runways': [1], 'code': ['KYZ']},\n",
       " {'runways': [1], 'code': ['LJG']},\n",
       " {'runways': [1], 'code': ['POJ']},\n",
       " {'runways': [1], 'code': ['BTU']},\n",
       " {'runways': [1], 'code': ['LKG']},\n",
       " {'runways': [1], 'code': ['IXR']},\n",
       " {'runways': [1], 'code': ['KRY']},\n",
       " {'runways': [1], 'code': ['LBJ']},\n",
       " {'runways': [1], 'code': ['GWD']},\n",
       " {'runways': [1], 'code': ['USU']},\n",
       " {'runways': [2], 'code': ['SLA']},\n",
       " {'runways': [2], 'code': ['PVD']},\n",
       " {'runways': [2], 'code': ['TRC']},\n",
       " {'runways': [1], 'code': ['RAE']},\n",
       " {'runways': [1], 'code': ['HCJ']},\n",
       " {'runways': [1], 'code': ['EZS']},\n",
       " {'runways': [1], 'code': ['CVU']},\n",
       " {'runways': [2], 'code': ['TUO']},\n",
       " {'runways': [1], 'code': ['NAV']},\n",
       " {'runways': [1], 'code': ['DGT']},\n",
       " {'runways': [1], 'code': ['TTU']},\n",
       " {'runways': [1], 'code': ['HLD']},\n",
       " {'runways': [1], 'code': ['ATM']},\n",
       " {'runways': [1], 'code': ['UAQ']},\n",
       " {'runways': [2], 'code': ['KLR']},\n",
       " {'code': ['CI']},\n",
       " {'runways': [1], 'code': ['BWK']},\n",
       " {'runways': [1], 'code': ['CXJ']},\n",
       " {'runways': [1], 'code': ['ETH']},\n",
       " {'code': ['MA']},\n",
       " {'runways': [1], 'code': ['YNC']},\n",
       " {'runways': [2], 'code': ['NAJ']},\n",
       " {'runways': [1], 'code': ['TIZ']},\n",
       " {'runways': [1], 'code': ['YRT']},\n",
       " {'runways': [1], 'code': ['KDH']},\n",
       " {'runways': [2], 'code': ['EWN']},\n",
       " {'runways': [1], 'code': ['CXI']},\n",
       " {'code': ['MX']},\n",
       " {'runways': [2], 'code': ['SYY']},\n",
       " {'runways': [1], 'code': ['LMM']},\n",
       " {'runways': [1], 'code': ['TIM']},\n",
       " {'runways': [2], 'code': ['MYD']},\n",
       " {'code': ['AG']},\n",
       " {'runways': [1], 'code': ['TVY']},\n",
       " {'runways': [1], 'code': ['KXK']},\n",
       " {'runways': [2], 'code': ['BKQ']},\n",
       " {'runways': [1], 'code': ['PAT']},\n",
       " {'code': ['AS']},\n",
       " ...]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().and_(__.has('runways', P.neq(4)), __.has('runways', P.neq(3))).valueMap('code', 'runways').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## or()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Sydney Kingsford Smith', 'Hong Kong - Chek Lap Kok International Airport']"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().or_(__.has('code', 'SYD'), __.has('code', 'HKG')).values('desc').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The and(), or() operators can a lot of times be avoided using within() or without()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## gt()\n",
    "__Airports that have more than 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "6"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().has('runways', P.gt(5)).count().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## gte()\n",
    "__Airports that have 6 or more runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().has('runways', P.gte(6)).count().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## lt()\n",
    "__Airports that have less than 3 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3078"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().has('runways', P.lt(3)).count().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## lte()\n",
    "__Airports that have 2 or less runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().has('runways', P.lte(2)).count().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## inside()\n",
    "__Airports that have more than 2 but less than 6 runways__\n",
    "\n",
    "_There is an issue with this Python implementation of inside, 2 should not be inclusive_"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'runways': [5], 'code': ['NSN']},\n",
       " {'runways': [2], 'code': ['CIC']},\n",
       " {'runways': [2], 'code': ['SDU']},\n",
       " {'runways': [2], 'code': ['SOW']},\n",
       " {'runways': [2], 'code': ['ESB']},\n",
       " {'runways': [4], 'code': ['KKE']},\n",
       " {'runways': [4], 'code': ['JFK']},\n",
       " {'runways': [2], 'code': ['BUC']},\n",
       " {'runways': [2], 'code': ['UPG']},\n",
       " {'runways': [2], 'code': ['PER']},\n",
       " {'runways': [2], 'code': ['ASM']},\n",
       " {'runways': [2], 'code': ['HOT']},\n",
       " {'runways': [2], 'code': ['TLN']},\n",
       " {'runways': [2], 'code': ['NAG']},\n",
       " {'runways': [2], 'code': ['SLL']},\n",
       " {'runways': [2], 'code': ['FOD']},\n",
       " {'runways': [4], 'code': ['SFB']},\n",
       " {'runways': [2], 'code': ['OAG']},\n",
       " {'runways': [2], 'code': ['LRE']},\n",
       " {'runways': [2], 'code': ['DSM']},\n",
       " {'runways': [4], 'code': ['CVG']},\n",
       " {'runways': [2], 'code': ['PTU']},\n",
       " {'runways': [3], 'code': ['BRO']},\n",
       " {'runways': [2], 'code': ['FLO']},\n",
       " {'runways': [2], 'code': ['JNB']},\n",
       " {'runways': [2], 'code': ['SXF']},\n",
       " {'runways': [3], 'code': ['ILG']},\n",
       " {'runways': [2], 'code': ['HDS']},\n",
       " {'runways': [2], 'code': ['GKA']},\n",
       " {'runways': [2], 'code': ['NRT']},\n",
       " {'runways': [2], 'code': ['MSL']},\n",
       " {'runways': [2], 'code': ['JHW']},\n",
       " {'runways': [3], 'code': ['LGB']},\n",
       " {'runways': [2], 'code': ['KOE']},\n",
       " {'runways': [3], 'code': ['EWR']},\n",
       " {'runways': [2], 'code': ['JAN']},\n",
       " {'runways': [4], 'code': ['FAI']},\n",
       " {'runways': [2], 'code': ['BFS']},\n",
       " {'runways': [3], 'code': ['YYT']},\n",
       " {'runways': [2], 'code': ['MYA']},\n",
       " {'runways': [2], 'code': ['DVL']},\n",
       " {'runways': [3], 'code': ['ERZ']},\n",
       " {'runways': [4], 'code': ['IVC']},\n",
       " {'runways': [2], 'code': ['MMO']},\n",
       " {'runways': [2], 'code': ['BZO']},\n",
       " {'runways': [3], 'code': ['BHI']},\n",
       " {'runways': [2], 'code': ['LDY']},\n",
       " {'runways': [2], 'code': ['AGB']},\n",
       " {'runways': [2], 'code': ['MBA']},\n",
       " {'runways': [2], 'code': ['KAT']},\n",
       " {'runways': [3], 'code': ['TUL']},\n",
       " {'runways': [3], 'code': ['MJV']},\n",
       " {'runways': [2], 'code': ['PIH']},\n",
       " {'runways': [4], 'code': ['FRA']},\n",
       " {'runways': [2], 'code': ['DIK']},\n",
       " {'runways': [2], 'code': ['BDS']},\n",
       " {'runways': [2], 'code': ['ATC']},\n",
       " {'runways': [2], 'code': ['GST']},\n",
       " {'runways': [2], 'code': ['ALG']},\n",
       " {'runways': [3], 'code': ['HBE']},\n",
       " {'runways': [2], 'code': ['MZW']},\n",
       " {'runways': [2], 'code': ['GHA']},\n",
       " {'runways': [2], 'code': ['HVR']},\n",
       " {'runways': [2], 'code': ['UET']},\n",
       " {'runways': [3], 'code': ['BHE']},\n",
       " {'runways': [3], 'code': ['PKC']},\n",
       " {'runways': [2], 'code': ['ZAD']},\n",
       " {'runways': [2], 'code': ['HLA']},\n",
       " {'runways': [2], 'code': ['BVI']},\n",
       " {'runways': [2], 'code': ['MHK']},\n",
       " {'runways': [3], 'code': ['ROW']},\n",
       " {'runways': [2], 'code': ['MRY']},\n",
       " {'runways': [2], 'code': ['IFN']},\n",
       " {'runways': [3], 'code': ['TUS']},\n",
       " {'runways': [2], 'code': ['LPB']},\n",
       " {'runways': [2], 'code': ['BHM']},\n",
       " {'runways': [2], 'code': ['MID']},\n",
       " {'runways': [2], 'code': ['LFR']},\n",
       " {'runways': [3], 'code': ['SBN']},\n",
       " {'runways': [2], 'code': ['TGD']},\n",
       " {'runways': [2], 'code': ['OTZ']},\n",
       " {'runways': [2], 'code': ['MRS']},\n",
       " {'runways': [2], 'code': ['YKM']},\n",
       " {'runways': [2], 'code': ['CYS']},\n",
       " {'runways': [2], 'code': ['SJU']},\n",
       " {'runways': [5], 'code': ['GIS']},\n",
       " {'runways': [2], 'code': ['TOG']},\n",
       " {'runways': [2], 'code': ['FSM']},\n",
       " {'runways': [2], 'code': ['CED']},\n",
       " {'runways': [3], 'code': ['LST']},\n",
       " {'runways': [4], 'code': ['PIE']},\n",
       " {'runways': [2], 'code': ['SLK']},\n",
       " {'runways': [3], 'code': ['ABA']},\n",
       " {'runways': [3], 'code': ['BEY']},\n",
       " {'runways': [2], 'code': ['GCC']},\n",
       " {'runways': [2], 'code': ['MZR']},\n",
       " {'runways': [4], 'code': ['TMW']},\n",
       " {'runways': [2], 'code': ['MSO']},\n",
       " {'runways': [2], 'code': ['NYO']},\n",
       " {'runways': [2], 'code': ['GAL']},\n",
       " {'runways': [2], 'code': ['NAN']},\n",
       " {'runways': [3], 'code': ['OGD']},\n",
       " {'runways': [2], 'code': ['MCN']},\n",
       " {'runways': [4], 'code': ['VVO']},\n",
       " {'runways': [3], 'code': ['YZV']},\n",
       " {'runways': [3], 'code': ['UIN']},\n",
       " {'runways': [3], 'code': ['SEA']},\n",
       " {'runways': [3], 'code': ['BHB']},\n",
       " {'runways': [4], 'code': ['CMI']},\n",
       " {'runways': [2], 'code': ['SLM']},\n",
       " {'runways': [5], 'code': ['NPE']},\n",
       " {'runways': [2], 'code': ['TTN']},\n",
       " {'runways': [3], 'code': ['YHU']},\n",
       " {'runways': [2], 'code': ['YTH']},\n",
       " {'runways': [4], 'code': ['CPR']},\n",
       " {'runways': [2], 'code': ['LRT']},\n",
       " {'runways': [2], 'code': ['GCK']},\n",
       " {'runways': [3], 'code': ['HVD']},\n",
       " {'runways': [3], 'code': ['SBA']},\n",
       " {'runways': [2], 'code': ['YQL']},\n",
       " {'runways': [2], 'code': ['KDU']},\n",
       " {'runways': [2], 'code': ['ESC']},\n",
       " {'runways': [3], 'code': ['YZT']},\n",
       " {'runways': [2], 'code': ['MCX']},\n",
       " {'runways': [2], 'code': ['GMP']},\n",
       " {'runways': [2], 'code': ['YQQ']},\n",
       " {'runways': [2], 'code': ['PSA']},\n",
       " {'runways': [2], 'code': ['TNN']},\n",
       " {'runways': [2], 'code': ['IKA']},\n",
       " {'runways': [5], 'code': ['HLZ']},\n",
       " {'runways': [2], 'code': ['PGF']},\n",
       " {'runways': [2], 'code': ['BOM']},\n",
       " {'runways': [2], 'code': ['JAX']},\n",
       " {'runways': [2], 'code': ['VEL']},\n",
       " {'runways': [2], 'code': ['ABY']},\n",
       " {'runways': [3], 'code': ['TRE']},\n",
       " {'runways': [2], 'code': ['CDV']},\n",
       " {'runways': [2], 'code': ['LED']},\n",
       " {'runways': [2], 'code': ['ELU']},\n",
       " {'runways': [2], 'code': ['EBB']},\n",
       " {'runways': [2], 'code': ['GGW']},\n",
       " {'runways': [2], 'code': ['YAK']},\n",
       " {'runways': [2], 'code': ['YHZ']},\n",
       " {'runways': [2], 'code': ['PSP']},\n",
       " {'runways': [2], 'code': ['YBG']},\n",
       " {'runways': [2], 'code': ['CPT']},\n",
       " {'runways': [2], 'code': ['CHS']},\n",
       " {'runways': [4], 'code': ['GFK']},\n",
       " {'runways': [2], 'code': ['ORK']},\n",
       " {'runways': [2], 'code': ['VNX']},\n",
       " {'runways': [2], 'code': ['YTS']},\n",
       " {'runways': [2], 'code': ['SGF']},\n",
       " {'runways': [2], 'code': ['HGU']},\n",
       " {'runways': [3], 'code': ['ACK']},\n",
       " {'runways': [2], 'code': ['CGH']},\n",
       " {'runways': [2], 'code': ['TRI']},\n",
       " {'runways': [2], 'code': ['CJU']},\n",
       " {'runways': [2], 'code': ['AKL']},\n",
       " {'runways': [3], 'code': ['HER']},\n",
       " {'runways': [2], 'code': ['FAT']},\n",
       " {'runways': [3], 'code': ['ZRH']},\n",
       " {'runways': [2], 'code': ['MTJ']},\n",
       " {'runways': [3], 'code': ['SMA']},\n",
       " {'runways': [2], 'code': ['YQM']},\n",
       " {'runways': [3], 'code': ['ROC']},\n",
       " {'runways': [2], 'code': ['OSL']},\n",
       " {'runways': [2], 'code': ['THU']},\n",
       " {'runways': [2], 'code': ['MEX']},\n",
       " {'runways': [2], 'code': ['LTD']},\n",
       " {'runways': [3], 'code': ['MCI']},\n",
       " {'runways': [3], 'code': ['JST']},\n",
       " {'runways': [2], 'code': ['LYS']},\n",
       " {'runways': [3], 'code': ['PSC']},\n",
       " {'runways': [3], 'code': ['PUQ']},\n",
       " {'runways': [2], 'code': ['TXK']},\n",
       " {'runways': [2], 'code': ['RSH']},\n",
       " {'runways': [3], 'code': ['PPW']},\n",
       " {'runways': [3], 'code': ['HRL']},\n",
       " {'runways': [2], 'code': ['PMO']},\n",
       " {'runways': [5], 'code': ['MDW']},\n",
       " {'runways': [3], 'code': ['KNS']},\n",
       " {'runways': [2], 'code': ['LBE']},\n",
       " {'runways': [2], 'code': ['PTH']},\n",
       " {'runways': [2], 'code': ['MEB']},\n",
       " {'runways': [4], 'code': ['EBL']},\n",
       " {'runways': [2], 'code': ['YQR']},\n",
       " {'runways': [2], 'code': ['LAD']},\n",
       " {'runways': [3], 'code': ['TRD']},\n",
       " {'runways': [2], 'code': ['OTP']},\n",
       " {'runways': [2], 'code': ['GIG']},\n",
       " {'runways': [2], 'code': ['TLH']},\n",
       " {'runways': [2], 'code': ['REU']},\n",
       " {'runways': [2], 'code': ['HTA']},\n",
       " {'runways': [3], 'code': ['ASB']},\n",
       " {'runways': [5], 'code': ['ATL']},\n",
       " {'runways': [4], 'code': ['CLT']},\n",
       " {'runways': [2], 'code': ['HVN']},\n",
       " {'runways': [2], 'code': ['EZE']},\n",
       " {'runways': [3], 'code': ['BVA']},\n",
       " {'runways': [2], 'code': ['NGS']},\n",
       " {'runways': [2], 'code': ['PNS']},\n",
       " {'runways': [2], 'code': ['GNV']},\n",
       " {'runways': [2], 'code': ['BKK']},\n",
       " {'runways': [2], 'code': ['BRE']},\n",
       " {'runways': [3], 'code': ['RIC']},\n",
       " {'runways': [2], 'code': ['GWT']},\n",
       " {'runways': [2], 'code': ['YXJ']},\n",
       " {'runways': [2], 'code': ['BNS']},\n",
       " {'runways': [2], 'code': ['DMM']},\n",
       " {'runways': [2], 'code': ['TBZ']},\n",
       " {'runways': [2], 'code': ['MLA']},\n",
       " {'runways': [2], 'code': ['MSU']},\n",
       " {'runways': [3], 'code': ['FCO']},\n",
       " {'runways': [2], 'code': ['HID']},\n",
       " {'runways': [2], 'code': ['MOQ']},\n",
       " {'runways': [3], 'code': ['CHC']},\n",
       " {'runways': [2], 'code': ['JAI']},\n",
       " {'runways': [3], 'code': ['HUN']},\n",
       " {'runways': [3], 'code': ['TLV']},\n",
       " {'runways': [2], 'code': ['MRZ']},\n",
       " {'runways': [2], 'code': ['RNS']},\n",
       " {'runways': [2], 'code': ['DNR']},\n",
       " {'runways': [2], 'code': ['UTT']},\n",
       " {'runways': [2], 'code': ['CBH']},\n",
       " {'runways': [4], 'code': ['VCT']},\n",
       " {'runways': [5], 'code': ['YYZ']},\n",
       " {'runways': [2], 'code': ['AFW']},\n",
       " {'runways': [2], 'code': ['KHV']},\n",
       " {'runways': [2], 'code': ['MNL']},\n",
       " {'runways': [3], 'code': ['SPI']},\n",
       " {'runways': [2], 'code': ['CRK']},\n",
       " {'runways': [2], 'code': ['CGK']},\n",
       " {'runways': [2], 'code': ['AUS']},\n",
       " {'runways': [2], 'code': ['BJI']},\n",
       " {'runways': [2], 'code': ['SKG']},\n",
       " {'runways': [2], 'code': ['MGM']},\n",
       " {'runways': [2], 'code': ['NCE']},\n",
       " {'runways': [3], 'code': ['ELD']},\n",
       " {'runways': [2], 'code': ['ROK']},\n",
       " {'runways': [2], 'code': ['DAD']},\n",
       " {'runways': [3], 'code': ['YXX']},\n",
       " {'runways': [2], 'code': ['CPD']},\n",
       " {'runways': [2], 'code': ['PXO']},\n",
       " {'runways': [2], 'code': ['OST']},\n",
       " {'runways': [2], 'code': ['YXT']},\n",
       " {'runways': [2], 'code': ['MHD']},\n",
       " {'runways': [3], 'code': ['PGV']},\n",
       " {'runways': [2], 'code': ['KTN']},\n",
       " {'runways': [2], 'code': ['BYN']},\n",
       " {'runways': [4], 'code': ['SLC']},\n",
       " {'runways': [2], 'code': ['YPJ']},\n",
       " {'runways': [2], 'code': ['FOE']},\n",
       " {'runways': [2], 'code': ['BUF']},\n",
       " {'runways': [2], 'code': ['TJM']},\n",
       " {'runways': [2], 'code': ['BFL']},\n",
       " {'runways': [3], 'code': ['HOB']},\n",
       " {'runways': [2], 'code': ['IMT']},\n",
       " {'runways': [2], 'code': ['WDH']},\n",
       " {'runways': [2], 'code': ['AHN']},\n",
       " {'runways': [2], 'code': ['ELG']},\n",
       " {'runways': [2], 'code': ['DKR']},\n",
       " {'runways': [2], 'code': ['LYH']},\n",
       " {'runways': [2], 'code': ['YSJ']},\n",
       " {'runways': [2], 'code': ['HIB']},\n",
       " {'runways': [2], 'code': ['KSD']},\n",
       " {'runways': [2], 'code': ['JTR']},\n",
       " {'runways': [2], 'code': ['LIH']},\n",
       " {'runways': [3], 'code': ['BET']},\n",
       " {'runways': [2], 'code': ['EQS']},\n",
       " {'runways': [5], 'code': ['UFA']},\n",
       " {'runways': [2], 'code': ['SVI']},\n",
       " {'runways': [2], 'code': ['GRI']},\n",
       " {'runways': [2], 'code': ['MHG']},\n",
       " {'runways': [2], 'code': ['JMS']},\n",
       " {'runways': [3], 'code': ['JLN']},\n",
       " {'runways': [2], 'code': ['CVM']},\n",
       " {'runways': [2], 'code': ['IPL']},\n",
       " {'runways': [3], 'code': ['CLL']},\n",
       " {'runways': [2], 'code': ['KAN']},\n",
       " {'runways': [2], 'code': ['IWK']},\n",
       " {'runways': [3], 'code': ['YWG']},\n",
       " {'runways': [2], 'code': ['AGS']},\n",
       " {'runways': [2], 'code': ['BSL']},\n",
       " {'runways': [2], 'code': ['EAU']},\n",
       " {'runways': [3], 'code': ['BLK']},\n",
       " {'runways': [2], 'code': ['SSH']},\n",
       " {'runways': [2], 'code': ['SBP']},\n",
       " {'runways': [4], 'code': ['OAK']},\n",
       " {'runways': [2], 'code': ['WYA']},\n",
       " {'runways': [2], 'code': ['RST']},\n",
       " {'runways': [2], 'code': ['FMN']},\n",
       " {'runways': [2], 'code': ['IDA']},\n",
       " {'runways': [2], 'code': ['WGA']},\n",
       " {'runways': [2], 'code': ['DUB']},\n",
       " {'runways': [2], 'code': ['EWB']},\n",
       " {'runways': [2], 'code': ['TOL']},\n",
       " {'runways': [2], 'code': ['HRM']},\n",
       " {'runways': [3], 'code': ['SOY']},\n",
       " {'runways': [3], 'code': ['MVD']},\n",
       " {'runways': [2], 'code': ['DEF']},\n",
       " {'runways': [3], 'code': ['EVV']},\n",
       " {'runways': [2], 'code': ['MCT']},\n",
       " {'runways': [3], 'code': ['MVY']},\n",
       " {'runways': [2], 'code': ['CUC']},\n",
       " {'runways': [2], 'code': ['GUM']},\n",
       " {'runways': [2], 'code': ['YHD']},\n",
       " {'runways': [2], 'code': ['EOI']},\n",
       " {'runways': [2], 'code': ['AOO']},\n",
       " {'runways': [2], 'code': ['RCH']},\n",
       " {'runways': [2], 'code': ['YYG']},\n",
       " {'runways': [3], 'code': ['THR']},\n",
       " {'runways': [2], 'code': ['AKF']},\n",
       " {'runways': [2], 'code': ['SHX']},\n",
       " {'runways': [2], 'code': ['YYR']},\n",
       " {'runways': [3], 'code': ['BOI']},\n",
       " {'runways': [2], 'code': ['YVP']},\n",
       " {'runways': [3], 'code': ['IAG']},\n",
       " {'runways': [2], 'code': ['SLA']},\n",
       " {'runways': [2], 'code': ['PVD']},\n",
       " {'runways': [2], 'code': ['TRC']},\n",
       " {'runways': [2], 'code': ['TUO']},\n",
       " {'runways': [4], 'code': ['LAS']},\n",
       " {'runways': [2], 'code': ['KLR']},\n",
       " {'runways': [2], 'code': ['NAJ']},\n",
       " {'runways': [2], 'code': ['EWN']},\n",
       " {'runways': [2], 'code': ['SYY']},\n",
       " {'runways': [3], 'code': ['MAD']},\n",
       " {'runways': [2], 'code': ['MYD']},\n",
       " {'runways': [2], 'code': ['BKQ']},\n",
       " {'runways': [2], 'code': ['ADK']},\n",
       " {'runways': [3], 'code': ['EDI']},\n",
       " {'runways': [2], 'code': ['UIP']},\n",
       " {'runways': [2], 'code': ['ULN']},\n",
       " {'runways': [4], 'code': ['ILI']},\n",
       " {'runways': [2], 'code': ['MMX']},\n",
       " {'runways': [2], 'code': ['CCS']},\n",
       " {'runways': [2], 'code': ['KEJ']},\n",
       " {'runways': [2], 'code': ['ITH']},\n",
       " {'runways': [2], 'code': ['GLH']},\n",
       " {'runways': [2], 'code': ['VKO']},\n",
       " {'runways': [3], 'code': ['CGN']},\n",
       " {'runways': [2], 'code': ['PPP']},\n",
       " {'runways': [3], 'code': ['APF']},\n",
       " {'runways': [2], 'code': ['ACV']},\n",
       " {'runways': [2], 'code': ['MDT']},\n",
       " {'runways': [2], 'code': ['SYZ']},\n",
       " {'runways': [2], 'code': ['CTL']},\n",
       " {'runways': [2], 'code': ['VER']},\n",
       " {'runways': [2], 'code': ['BDB']},\n",
       " {'runways': [3], 'code': ['YOW']},\n",
       " {'runways': [2], 'code': ['CNS']},\n",
       " {'runways': [2], 'code': ['CBB']},\n",
       " {'runways': [2], 'code': ['NWI']},\n",
       " {'runways': [2], 'code': ['GEO']},\n",
       " {'runways': [2], 'code': ['YSB']},\n",
       " {'runways': [2], 'code': ['BUZ']},\n",
       " {'runways': [2], 'code': ['RUT']},\n",
       " {'runways': [4], 'code': ['ABQ']},\n",
       " {'runways': [3], 'code': ['SYD']},\n",
       " {'runways': [3], 'code': ['AZO']},\n",
       " {'runways': [2], 'code': ['TRO']},\n",
       " {'runways': [2], 'code': ['EKO']},\n",
       " {'runways': [2], 'code': ['ESL']},\n",
       " {'runways': [3], 'code': ['IXL']},\n",
       " {'runways': [3], 'code': ['TVC']},\n",
       " {'runways': [3], 'code': ['COS']},\n",
       " {'runways': [2], 'code': ['HYS']},\n",
       " {'runways': [3], 'code': ['UST']},\n",
       " {'runways': [2], 'code': ['ABR']},\n",
       " {'runways': [2], 'code': ['JKG']},\n",
       " {'runways': [2], 'code': ['CAE']},\n",
       " {'runways': [4], 'code': ['ZQN']},\n",
       " {'runways': [2], 'code': ['ACY']},\n",
       " {'runways': [4], 'code': ['HOU']},\n",
       " {'runways': [2], 'code': ['DBO']},\n",
       " {'runways': [2], 'code': ['DJG']},\n",
       " {'runways': [3], 'code': ['LCK']},\n",
       " {'runways': [2], 'code': ['SCU']},\n",
       " {'runways': [2], 'code': ['TYS']},\n",
       " {'runways': [2], 'code': ['CWB']},\n",
       " {'runways': [2], 'code': ['URO']},\n",
       " {'runways': [2], 'code': ['SLZ']},\n",
       " {'runways': [2], 'code': ['WMB']},\n",
       " {'runways': [2], 'code': ['RDD']},\n",
       " {'runways': [2], 'code': ['MBS']},\n",
       " {'runways': [2], 'code': ['YKA']},\n",
       " {'runways': [3], 'code': ['BRR']},\n",
       " {'runways': [2], 'code': ['GPT']},\n",
       " {'runways': [3], 'code': ['VOG']},\n",
       " {'runways': [2], 'code': ['SDJ']},\n",
       " {'runways': [2], 'code': ['IAM']},\n",
       " {'runways': [2], 'code': ['DXB']},\n",
       " {'runways': [3], 'code': ['ACI']},\n",
       " {'runways': [3], 'code': ['ANC']},\n",
       " {'runways': [2], 'code': ['CWA']},\n",
       " {'runways': [3], 'code': ['BMI']},\n",
       " {'runways': [3], 'code': ['TGZ']},\n",
       " {'runways': [2], 'code': ['PTY']},\n",
       " {'runways': [3], 'code': ['CLE']},\n",
       " {'runways': [4], 'code': ['SFO']},\n",
       " {'runways': [2], 'code': ['YAG']},\n",
       " {'runways': [2], 'code': ['YFC']},\n",
       " {'runways': [2], 'code': ['EMD']},\n",
       " {'runways': [2], 'code': ['PRG']},\n",
       " {'runways': [2], 'code': ['TUU']},\n",
       " {'runways': [3], 'code': ['CUU']},\n",
       " {'runways': [4], 'code': ['SPS']},\n",
       " {'runways': [2], 'code': ['ATW']},\n",
       " {'runways': [2], 'code': ['DIJ']},\n",
       " {'runways': [2], 'code': ['OLL']},\n",
       " {'runways': [3], 'code': ['DAB']},\n",
       " {'runways': [5], 'code': ['TRG']},\n",
       " {'runways': [2], 'code': ['WIL']},\n",
       " {'runways': [2], 'code': ['VLL']},\n",
       " {'runways': [2], 'code': ['IXA']},\n",
       " {'runways': [2], 'code': ['DOH']},\n",
       " {'runways': [2], 'code': ['CDC']},\n",
       " {'runways': [3], 'code': ['RHI']},\n",
       " {'runways': [2], 'code': ['LVI']},\n",
       " {'runways': [3], 'code': ['GRZ']},\n",
       " {'runways': [3], 'code': ['WHK']},\n",
       " {'runways': [2], 'code': ['PMI']},\n",
       " {'runways': [2], 'code': ['RMA']},\n",
       " {'runways': [2], 'code': ['KIM']},\n",
       " {'runways': [3], 'code': ['APA']},\n",
       " {'runways': [4], 'code': ['YUM']},\n",
       " {'runways': [2], 'code': ['MCY']},\n",
       " {'runways': [2], 'code': ['CDR']},\n",
       " {'runways': [2], 'code': ['MFE']},\n",
       " {'runways': [2], 'code': ['ORH']},\n",
       " {'runways': [2], 'code': ['BRI']},\n",
       " {'runways': [2], 'code': ['PKE']},\n",
       " {'runways': [2], 'code': ['CMN']},\n",
       " {'runways': [2], 'code': ['GZT']},\n",
       " {'runways': [2], 'code': ['ADD']},\n",
       " {'runways': [2], 'code': ['VPS']},\n",
       " {'runways': [2], 'code': ['OGG']},\n",
       " {'runways': [2], 'code': ['PKB']},\n",
       " {'runways': [2], 'code': ['INT']},\n",
       " {'runways': [3], 'code': ['PMR']},\n",
       " {'runways': [2], 'code': ['MED']},\n",
       " {'runways': [3], 'code': ['SJT']},\n",
       " {'runways': [2], 'code': ['GGG']},\n",
       " {'runways': [2], 'code': ['YXH']},\n",
       " {'runways': [2], 'code': ['TXL']},\n",
       " {'runways': [2], 'code': ['NCU']},\n",
       " {'runways': [2], 'code': ['ARM']},\n",
       " {'runways': [2], 'code': ['PMV']},\n",
       " {'runways': [2], 'code': ['BFF']},\n",
       " {'runways': [2], 'code': ['YLL']},\n",
       " {'runways': [3], 'code': ['YQX']},\n",
       " {'runways': [2], 'code': ['OGX']},\n",
       " {'runways': [2], 'code': ['LAR']},\n",
       " {'runways': [2], 'code': ['BHS']},\n",
       " {'runways': [2], 'code': ['ANE']},\n",
       " {'runways': [2], 'code': ['LHE']},\n",
       " {'runways': [3], 'code': ['WRY']},\n",
       " {'runways': [3], 'code': ['KGC']},\n",
       " {'runways': [2], 'code': ['MUC']},\n",
       " {'runways': [2], 'code': ['AMM']},\n",
       " {'runways': [2], 'code': ['MCW']},\n",
       " {'runways': [2], 'code': ['BTV']},\n",
       " {'runways': [2], 'code': ['MQL']},\n",
       " {'runways': [3], 'code': ['EUG']},\n",
       " {'runways': [2], 'code': ['YZY']},\n",
       " {'runways': [2], 'code': ['PKA']},\n",
       " {'runways': [2], 'code': ['NLA']},\n",
       " {'runways': [2], 'code': ['BND']},\n",
       " {'runways': [2], 'code': ['NAA']},\n",
       " {'runways': [2], 'code': ['VAK']},\n",
       " {'runways': [2], 'code': ['LGA']},\n",
       " {'runways': [2], 'code': ['ANI']},\n",
       " {'runways': [2], 'code': ['MSY']},\n",
       " {'runways': [2], 'code': ['VDA']},\n",
       " {'runways': [3], 'code': ['BTR']},\n",
       " {'runways': [2], 'code': ['PET']},\n",
       " {'runways': [2], 'code': ['ABL']},\n",
       " {'runways': [4], 'code': ['STL']},\n",
       " {'runways': [2], 'code': ['IXD']},\n",
       " {'runways': [2], 'code': ['TBU']},\n",
       " {'runways': [3], 'code': ['BCN']},\n",
       " {'runways': [2], 'code': ['BLZ']},\n",
       " {'runways': [2], 'code': ['SVX']},\n",
       " {'runways': [3], 'code': ['BWI']},\n",
       " {'runways': [2], 'code': ['ZCL']},\n",
       " {'runways': [2], 'code': ['POM']},\n",
       " {'runways': [2], 'code': ['TEE']},\n",
       " {'runways': [2], 'code': ['YQY']},\n",
       " {'runways': [2], 'code': ['NLK']},\n",
       " {'runways': [2], 'code': ['SOM']},\n",
       " {'runways': [2], 'code': ['BHQ']},\n",
       " {'runways': [2], 'code': ['PIR']},\n",
       " {'runways': [3], 'code': ['YXS']},\n",
       " {'runways': [3], 'code': ['TIU']},\n",
       " {'runways': [2], 'code': ['CLJ']},\n",
       " {'runways': [2], 'code': ['BOB']},\n",
       " {'runways': [2], 'code': ['FKL']},\n",
       " {'runways': [3], 'code': ['ICN']},\n",
       " {'runways': [2], 'code': ['DHN']},\n",
       " {'runways': [2], 'code': ['HME']},\n",
       " {'runways': [2], 'code': ['YQT']},\n",
       " {'runways': [2], 'code': ['MLG']},\n",
       " {'runways': [2], 'code': ['PPG']},\n",
       " {'runways': [2], 'code': ['ROA']},\n",
       " {'runways': [3], 'code': ['HEL']},\n",
       " {'runways': [3], 'code': ['PLZ']},\n",
       " {'runways': [5], 'code': ['IAH']},\n",
       " {'runways': [2], 'code': ['CIU']},\n",
       " {'runways': [3], 'code': ['BWU']},\n",
       " {'runways': [3], 'code': ['BZN']},\n",
       " {'runways': [2], 'code': ['ORU']},\n",
       " {'runways': [2], 'code': ['HIN']},\n",
       " {'runways': [2], 'code': ['BSB']},\n",
       " {'runways': [3], 'code': ['RDU']},\n",
       " {'runways': [3], 'code': ['HAJ']},\n",
       " {'runways': [2], 'code': ['HAN']},\n",
       " {'runways': [2], 'code': ['CFS']},\n",
       " {'runways': [2], 'code': ['TEB']},\n",
       " {'runways': [2], 'code': ['MEL']},\n",
       " {'runways': [3], 'code': ['PGD']},\n",
       " {'runways': [2], 'code': ['FNJ']},\n",
       " {'runways': [2], 'code': ['URG']},\n",
       " {'runways': [3], 'code': ['PHX']},\n",
       " {'runways': [2], 'code': ['UKK']},\n",
       " {'runways': [3], 'code': ['ODS']},\n",
       " {'runways': [2], 'code': ['APL']},\n",
       " {'runways': [3], 'code': ['ELM']},\n",
       " {'runways': [3], 'code': ['SYR']},\n",
       " {'runways': [2], 'code': ['FLS']},\n",
       " {'runways': [2], 'code': ['BPT']},\n",
       " {'runways': [3], 'code': ['ISC']},\n",
       " {'runways': [2], 'code': ['TLE']},\n",
       " {'runways': [3], 'code': ['DEL']},\n",
       " {'runways': [3], 'code': ['DAL']},\n",
       " {'runways': [2], 'code': ['SCN']},\n",
       " {'runways': [2], 'code': ['BJM']},\n",
       " {'runways': [2], 'code': ['KSM']},\n",
       " {'runways': [2], 'code': ['GEG']},\n",
       " {'runways': [2], 'code': ['KBP']},\n",
       " {'runways': [3], 'code': ['TAM']},\n",
       " {'runways': [3], 'code': ['ENA']},\n",
       " {'runways': [3], 'code': ['GET']},\n",
       " {'runways': [2], 'code': ['PNL']},\n",
       " {'runways': [2], 'code': ['MGW']},\n",
       " {'runways': [2], 'code': ['BES']},\n",
       " {'runways': [2], 'code': ['JOE']},\n",
       " {'runways': [2], 'code': ['NRK']},\n",
       " {'runways': [4], 'code': ['CDG']},\n",
       " {'runways': [2], 'code': ['LWS']},\n",
       " {'runways': [2], 'code': ['AUH']},\n",
       " {'runways': [2], 'code': ['ISA']},\n",
       " {'runways': [3], 'code': ['PEK']},\n",
       " {'runways': [4], 'code': ['PIT']},\n",
       " {'runways': [2], 'code': ['PQQ']},\n",
       " {'runways': [2], 'code': ['PIK']},\n",
       " {'runways': [2], 'code': ['HYA']},\n",
       " {'runways': [4], 'code': ['MIA']},\n",
       " {'runways': [3], 'code': ['SJC']},\n",
       " {'runways': [3], 'code': ['GSO']},\n",
       " {'runways': [2], 'code': ['GHT']},\n",
       " {'runways': [2], 'code': ['CRW']},\n",
       " {'runways': [2], 'code': ['YAM']},\n",
       " {'runways': [3], 'code': ['RKV']},\n",
       " {'runways': [2], 'code': ['COR']},\n",
       " {'runways': [2], 'code': ['ZAH']},\n",
       " {'runways': [2], 'code': ['SMF']},\n",
       " {'runways': [2], 'code': ['WIN']},\n",
       " {'runways': [2], 'code': ['RKD']},\n",
       " {'runways': [2], 'code': ['ELF']},\n",
       " {'runways': [3], 'code': ['YVR']},\n",
       " {'runways': [3], 'code': ['AYT']},\n",
       " {'runways': [2], 'code': ['TBS']},\n",
       " {'runways': [2], 'code': ['YGR']},\n",
       " {'runways': [2], 'code': ['VCE']},\n",
       " {'runways': [2], 'code': ['LGW']},\n",
       " {'runways': [2], 'code': ['VTZ']},\n",
       " {'runways': [2], 'code': ['PHE']},\n",
       " {'runways': [2], 'code': ['CFR']},\n",
       " {'runways': [3], 'code': ['BEW']},\n",
       " {'runways': [2], 'code': ['INH']},\n",
       " {'runways': [2], 'code': ['SCK']},\n",
       " {'runways': [2], 'code': ['LUD']},\n",
       " {'runways': [2], 'code': ['BTS']},\n",
       " {'runways': [4], 'code': ['MSP']},\n",
       " {'runways': [2], 'code': ['BIO']},\n",
       " {'runways': [2], 'code': ['TLS']},\n",
       " {'runways': [2], 'code': ['ULK']},\n",
       " {'runways': [2], 'code': ['PLN']},\n",
       " {'runways': [2], 'code': ['SLP']},\n",
       " {'runways': [3], 'code': ['LNK']},\n",
       " {'runways': [2], 'code': ['ASF']},\n",
       " {'runways': [2], 'code': ['DIU']},\n",
       " {'runways': [2], 'code': ['CZM']},\n",
       " {'runways': [3], 'code': ['NPL']},\n",
       " {'runways': [2], 'code': ['NAS']},\n",
       " {'runways': [2], 'code': ['YMO']},\n",
       " {'runways': [2], 'code': ['DPO']},\n",
       " {'runways': [3], 'code': ['PDX']},\n",
       " {'runways': [4], 'code': ['BNA']},\n",
       " {'runways': [3], 'code': ['FAR']},\n",
       " {'runways': [2], 'code': ['ULP']},\n",
       " {'runways': [4], 'code': ['MAF']},\n",
       " {'runways': [4], 'code': ['GOJ']},\n",
       " {'runways': [2], 'code': ['DUS']},\n",
       " {'runways': [2], 'code': ['TAE']},\n",
       " {'runways': [2], 'code': ['SHV']},\n",
       " {'runways': [2], 'code': ['VLI']},\n",
       " {'runways': [2], 'code': ['LOV']},\n",
       " {'runways': [2], 'code': ['PSY']},\n",
       " {'runways': [2], 'code': ['CCL']},\n",
       " {'runways': [2], 'code': ['OVB']},\n",
       " {'runways': [3], 'code': ['IGM']},\n",
       " {'runways': [3], 'code': ['LMT']},\n",
       " {'runways': [3], 'code': ['MLU']},\n",
       " {'runways': [3], 'code': ['NDY']},\n",
       " {'runways': [2], 'code': ['BGM']},\n",
       " {'runways': [2], 'code': ['MKK']},\n",
       " {'runways': [3], 'code': ['KUL']},\n",
       " {'runways': [2], 'code': ['YJT']},\n",
       " {'runways': [2], 'code': ['VLC']},\n",
       " {'runways': [2], 'code': ['NOV']},\n",
       " {'runways': [3], 'code': ['DME']},\n",
       " {'runways': [2], 'code': ['FAY']},\n",
       " {'runways': [2], 'code': ['MKG']},\n",
       " {'runways': [2], 'code': ['SWF']},\n",
       " {'runways': [3], 'code': ['TYR']},\n",
       " {'runways': [2], 'code': ['IRK']},\n",
       " {'runways': [2], 'code': ['OME']},\n",
       " {'runways': [2], 'code': ['YAA']},\n",
       " {'runways': [2], 'code': ['LCH']},\n",
       " {'runways': [2], 'code': ['MOB']},\n",
       " {'runways': [2], 'code': ['KER']},\n",
       " {'runways': [2], 'code': ['BEB']},\n",
       " {'runways': [3], 'code': ['VLD']},\n",
       " {'runways': [2], 'code': ['GIL']},\n",
       " {'runways': [3], 'code': ['OMA']},\n",
       " {'runways': [2], 'code': ['RKS']},\n",
       " {'runways': [3], 'code': ['LBB']},\n",
       " {'runways': [2], 'code': ['THG']},\n",
       " {'runways': [4], 'code': ['PHL']},\n",
       " {'runways': [2], 'code': ['LEJ']},\n",
       " {'runways': [2], 'code': ['JOG']},\n",
       " {'runways': [2], 'code': ['ABD']},\n",
       " {'runways': [2], 'code': ['BOG']},\n",
       " {'runways': [2], 'code': ['AEX']},\n",
       " {'runways': [2], 'code': ['BGY']},\n",
       " {'runways': [5], 'code': ['KRP']},\n",
       " {'runways': [2], 'code': ['HON']},\n",
       " {'runways': [2], 'code': ['DEB']},\n",
       " {'runways': [2], 'code': ['YYU']},\n",
       " {'runways': [2], 'code': ['KIJ']},\n",
       " {'runways': [3], 'code': ['YXY']},\n",
       " {'runways': [4], 'code': ['PUB']},\n",
       " {'runways': [2], 'code': ['EGN']},\n",
       " {'runways': [4], 'code': ['HND']},\n",
       " {'runways': [2], 'code': ['GYD']},\n",
       " {'runways': [2], 'code': ['PGA']},\n",
       " {'runways': [2], 'code': ['MYW']},\n",
       " {'runways': [2], 'code': ['PDP']},\n",
       " {'runways': [4], 'code': ['CNM']},\n",
       " {'runways': [2], 'code': ['MCG']},\n",
       " {'runways': [2], 'code': ['ADB']},\n",
       " {'runways': [2], 'code': ['SDY']},\n",
       " {'runways': [2], 'code': ['YXL']},\n",
       " {'runways': [2], 'code': ['YKS']},\n",
       " {'runways': [2], 'code': ['EGO']},\n",
       " {'runways': [3], 'code': ['JED']},\n",
       " {'runways': [2], 'code': ['MKY']},\n",
       " {'runways': [2], 'code': ['TNG']},\n",
       " {'runways': [2], 'code': ['BSG']},\n",
       " {'runways': [2], 'code': ['TAS']},\n",
       " {'runways': [3], 'code': ['AKN']},\n",
       " {'runways': [2], 'code': ['PTG']},\n",
       " {'runways': [2], 'code': ['WLK']},\n",
       " {'runways': [2], 'code': ['MAR']},\n",
       " {'runways': [2], 'code': ['CGI']},\n",
       " {'runways': [2], 'code': ['EPR']},\n",
       " {'runways': [3], 'code': ['PRC']},\n",
       " {'runways': [2], 'code': ['PUU']},\n",
       " {'runways': [2], 'code': ['PHF']},\n",
       " {'runways': [2], 'code': ['GFF']},\n",
       " {'runways': [3], 'code': ['IOM']},\n",
       " {'runways': [2], 'code': ['ACA']},\n",
       " {'runways': [2], 'code': ['LNZ']},\n",
       " {'runways': [2], 'code': ['YSM']},\n",
       " {'runways': [2], 'code': ['ALH']},\n",
       " {'runways': [4], 'code': ['ISP']},\n",
       " {'runways': [2], 'code': ['TIF']},\n",
       " {'runways': [3], 'code': ['SIN']},\n",
       " {'runways': [2], 'code': ['FNT']},\n",
       " {'runways': [2], 'code': ['VDM']},\n",
       " {'runways': [5], 'code': ['PPQ']},\n",
       " {'runways': [2], 'code': ['APN']},\n",
       " {'runways': [2], 'code': ['BFD']},\n",
       " {'runways': [2], 'code': ['HGR']},\n",
       " {'runways': [2], 'code': ['CRP']},\n",
       " {'runways': [2], 'code': ['KIX']},\n",
       " {'runways': [3], 'code': ['YNG']},\n",
       " {'runways': [2], 'code': ['AVP']},\n",
       " {'runways': [2], 'code': ['MSS']},\n",
       " {'runways': [2], 'code': ['CJS']},\n",
       " {'runways': [2], 'code': ['AGP']},\n",
       " {'runways': [2], 'code': ['IPT']},\n",
       " {'runways': [2], 'code': ['NBC']},\n",
       " {'runways': [2], 'code': ['MAH']},\n",
       " {'runways': [2], 'code': ['CUN']},\n",
       " {'runways': [3], 'code': ['PLO']},\n",
       " {'runways': [3], 'code': ['LIT']},\n",
       " {'runways': [2], 'code': ['LGG']},\n",
       " {'runways': [2], 'code': ['LEB']},\n",
       " {'runways': [2], 'code': ['BRL']},\n",
       " {'runways': [2], 'code': ['MHT']},\n",
       " {'runways': [2], 'code': ['ITO']},\n",
       " {'runways': [3], 'code': ['ARN']},\n",
       " {'runways': [2], 'code': ['MFR']},\n",
       " {'runways': [2], 'code': ['TMR']},\n",
       " {'runways': [2], 'code': ['DAM']},\n",
       " {'runways': [3], 'code': ['LSE']},\n",
       " {'runways': [2], 'code': ['SNA']},\n",
       " {'runways': [2], 'code': ['PNQ']},\n",
       " {'runways': [2], 'code': ['BBI']},\n",
       " {'runways': [2], 'code': ['TPE']},\n",
       " {'runways': [2], 'code': ['FLN']},\n",
       " {'runways': [2], 'code': ['GPA']},\n",
       " {'runways': [2], 'code': ['XTG']},\n",
       " {'runways': [3], 'code': ['MLI']},\n",
       " {'runways': [2], 'code': ['KMQ']},\n",
       " {'runways': [2], 'code': ['CMA']},\n",
       " {'runways': [2], 'code': ['KTS']},\n",
       " {'runways': [3], 'code': ['YUL']},\n",
       " {'runways': [3], 'code': ['SHR']},\n",
       " {'runways': [2], 'code': ['ZBR']},\n",
       " {'runways': [2], 'code': ['BEN']},\n",
       " {'runways': [2], 'code': ['JNU']},\n",
       " {'runways': [2], 'code': ['ATY']},\n",
       " {'runways': [2], 'code': ['AER']},\n",
       " {'runways': [4], 'code': ['OSW']},\n",
       " {'runways': [3], 'code': ['YBR']},\n",
       " {'runways': [2], 'code': ['LXA']},\n",
       " {'runways': [2], 'code': ['ADL']},\n",
       " {'runways': [2], 'code': ['GLA']},\n",
       " {'runways': [3], 'code': ['RAI']},\n",
       " {'runways': [3], 'code': ['VLY']},\n",
       " {'runways': [2], 'code': ['GUC']},\n",
       " {'runways': [2], 'code': ['KSF']},\n",
       " {'runways': [4], 'code': ['IAD']},\n",
       " {'runways': [2], 'code': ['YQG']},\n",
       " {'runways': [2], 'code': ['PVU']},\n",
       " {'runways': [2], 'code': ['YOL']},\n",
       " {'runways': [2], 'code': ['LPY']},\n",
       " {'runways': [3], 'code': ['UUD']},\n",
       " {'runways': [2], 'code': ['CZL']},\n",
       " {'runways': [2], 'code': ['RDM']},\n",
       " {'runways': [4], 'code': ['OKC']},\n",
       " {'runways': [2], 'code': ['WRE']},\n",
       " {'runways': [2], 'code': ['BNE']},\n",
       " {'runways': [2], 'code': ['EAR']},\n",
       " {'runways': [2], 'code': ['LPA']},\n",
       " {'runways': [2], 'code': ['POZ']},\n",
       " {'runways': [2], 'code': ['KHI']},\n",
       " {'runways': [2], 'code': ['KZN']},\n",
       " {'runways': [3], 'code': ['ELP']},\n",
       " {'runways': [3], 'code': ['ROV']},\n",
       " {'runways': [3], 'code': ['NIM']},\n",
       " {'runways': [2], 'code': ['GDL']},\n",
       " {'runways': [2], 'code': ['HUY']},\n",
       " {'runways': [2], 'code': ['CEC']},\n",
       " {'runways': [2], 'code': ['MPM']},\n",
       " {'runways': [2], 'code': ['KEF']},\n",
       " {'runways': [2], 'code': ['UEL']},\n",
       " {'runways': [2], 'code': ['DLH']},\n",
       " {'runways': [2], 'code': ['ELS']},\n",
       " {'runways': [2], 'code': ['AMA']},\n",
       " {'runways': [2], 'code': ['KIH']},\n",
       " {'runways': [2], 'code': ['DRW']},\n",
       " {'runways': [3], 'code': ['OMD']},\n",
       " {'runways': [2], 'code': ['EAT']},\n",
       " {'runways': [3], 'code': ['YYB']},\n",
       " {'runways': [2], 'code': ['SMX']},\n",
       " {'runways': [2], 'code': ['HDF']},\n",
       " {'runways': [3], 'code': ['AIA']},\n",
       " {'runways': [3], 'code': ['CAI']},\n",
       " {'runways': [2], 'code': ['LEN']},\n",
       " {'runways': [3], 'code': ['HLN']},\n",
       " {'runways': [3], 'code': ['YYJ']},\n",
       " {'runways': [2], 'code': ['RVT']},\n",
       " {'runways': [3], 'code': ['TOB']},\n",
       " {'runways': [2], 'code': ['YXE']},\n",
       " {'runways': [2], 'code': ['ACT']},\n",
       " {'runways': [3], 'code': ['BRN']},\n",
       " {'runways': [2], 'code': ['NRA']},\n",
       " {'runways': [3], 'code': ['OMS']},\n",
       " {'runways': [2], 'code': ['DDC']},\n",
       " {'runways': [2], 'code': ['IXE']},\n",
       " {'runways': [2], 'code': ['TIP']},\n",
       " {'runways': [2], 'code': ['YHM']},\n",
       " {'runways': [2], 'code': ['MOT']},\n",
       " {'runways': [2], 'code': ['BUD']},\n",
       " {'runways': [2], 'code': ['KIR']},\n",
       " {'runways': [2], 'code': ['MPN']},\n",
       " {'runways': [2], 'code': ['SGN']},\n",
       " {'runways': [2], 'code': ['FRW']},\n",
       " {'runways': [3], 'code': ['ABI']},\n",
       " {'runways': [2], 'code': ['CFE']},\n",
       " {'runways': [2], 'code': ['PNA']},\n",
       " {'runways': [2], 'code': ['WIC']},\n",
       " {'runways': [2], 'code': ['YKF']},\n",
       " {'runways': [2], 'code': ['BIS']},\n",
       " {'runways': [3], 'code': ['DCA']},\n",
       " {'runways': [2], 'code': ['OSD']},\n",
       " {'runways': [3], 'code': ['FSD']},\n",
       " {'runways': [2], 'code': ['VBY']},\n",
       " {'runways': [2], 'code': ['MEI']},\n",
       " {'runways': [2], 'code': ['DMK']},\n",
       " {'runways': [2], 'code': ['BUQ']},\n",
       " {'runways': [3], 'code': ['ADQ']},\n",
       " {'runways': [2], 'code': ['ORF']},\n",
       " {'runways': [2], 'code': ['JGA']},\n",
       " {'runways': [2], 'code': ['BVE']},\n",
       " {'runways': [3], 'code': ['LAU']},\n",
       " {'runways': [2], 'code': ['CBR']},\n",
       " {'runways': [2], 'code': ['CMH']},\n",
       " {'runways': [2], 'code': ['OTH']},\n",
       " {'runways': [2], 'code': ['POR']},\n",
       " {'runways': [2], 'code': ['SIP']},\n",
       " {'runways': [2], 'code': ['XTO']},\n",
       " {'runways': [2], 'code': ['PAH']},\n",
       " {'runways': [2], 'code': ['AGR']},\n",
       " {'runways': [2], 'code': ['SRX']},\n",
       " {'runways': [4], 'code': ['SLN']},\n",
       " {'runways': [3], 'code': ['ORY']},\n",
       " {'runways': [4], 'code': ['HNL']},\n",
       " {'runways': [2], 'code': ['SHM']},\n",
       " {'runways': [2], 'code': ['MWA']},\n",
       " {'runways': [2], 'code': ['RIW']},\n",
       " {'runways': [2], 'code': ['WSN']},\n",
       " {'runways': [2], 'code': ['MOD']},\n",
       " {'runways': [2], 'code': ['BWT']},\n",
       " {'runways': [2], 'code': ['LIN']},\n",
       " {'runways': [3], 'code': ['BIL']},\n",
       " {'runways': [2], 'code': ['BUR']},\n",
       " {'runways': [2], 'code': ['KGI']},\n",
       " {'runways': [2], 'code': ['POL']},\n",
       " {'runways': [3], 'code': ['LOK']},\n",
       " {'runways': [2], 'code': ['URE']},\n",
       " {'runways': [3], 'code': ['TPA']},\n",
       " {'runways': [2], 'code': ['HMO']},\n",
       " {'runways': [3], 'code': ['PDT']},\n",
       " {'runways': [2], 'code': ['CID']},\n",
       " {'runways': [2], 'code': ['STC']},\n",
       " {'runways': [2], 'code': ['ERI']},\n",
       " {'runways': [2], 'code': ['ALS']},\n",
       " {'runways': [2], 'code': ['RJK']},\n",
       " {'runways': [2], 'code': ['SVO']},\n",
       " {'runways': [2], 'code': ['ALB']},\n",
       " {'runways': [2], 'code': ['HSV']},\n",
       " {'runways': [2], 'code': ['YHY']},\n",
       " {'runways': [2], 'code': ['CJJ']},\n",
       " {'runways': [2], 'code': ['FLL']},\n",
       " {'runways': [2], 'code': ['CNJ']},\n",
       " {'runways': [2], 'code': ['LHR']},\n",
       " {'runways': [2], 'code': ['TSV']},\n",
       " {'runways': [3], 'code': ['MLB']},\n",
       " {'runways': [2], 'code': ['KRR']},\n",
       " {'runways': [3], 'code': ['GLO']},\n",
       " {'runways': [3], 'code': ['IST']},\n",
       " {'runways': [3], 'code': ['VRB']},\n",
       " {'runways': [2], 'code': ['GJT']},\n",
       " {'runways': [2], 'code': ['ABE']},\n",
       " {'runways': [3], 'code': ['MCK']},\n",
       " {'runways': [3], 'code': ['SDF']},\n",
       " {'runways': [2], 'code': ['ISN']},\n",
       " {'runways': [3], 'code': ['TBB']},\n",
       " {'runways': [2], 'code': ['ITM']},\n",
       " {'runways': [2], 'code': ['CAN']},\n",
       " {'runways': [4], 'code': ['BRD']},\n",
       " {'runways': [3], 'code': ['FWA']},\n",
       " {'runways': [2], 'code': ['BOD']},\n",
       " {'runways': [3], 'code': ['LUK']},\n",
       " {'runways': [3], 'code': ['CAK']},\n",
       " {'runways': [2], 'code': ['AAE']},\n",
       " {'runways': [4], 'code': ['LEQ']},\n",
       " {'runways': [2], 'code': ['MPL']},\n",
       " {'runways': [2], 'code': ['COU']},\n",
       " {'runways': [2], 'code': ['HTS']},\n",
       " {'runways': [2], 'code': ['KWJ']},\n",
       " {'runways': [2], 'code': ['EXT']},\n",
       " {'runways': [2], 'code': ['AAL']},\n",
       " {'runways': [2], 'code': ['IVL']},\n",
       " {'runways': [2], 'code': ['HPN']},\n",
       " {'runways': [2], 'code': ['ZAZ']},\n",
       " {'runways': [2], 'code': ['GVA']},\n",
       " {'runways': [2], 'code': ['AGH']},\n",
       " {'runways': [3], 'code': ['AZA']},\n",
       " {'runways': [3], 'code': ['PBI']},\n",
       " {'runways': [2], 'code': ['PVG']},\n",
       " {'runways': [2], 'code': ['YZF']},\n",
       " {'runways': [2], 'code': ['LIL']},\n",
       " {'runways': [2], 'code': ['MZL']},\n",
       " {'runways': [3], 'code': ['CVN']},\n",
       " {'runways': [2], 'code': ['LBF']},\n",
       " {'runways': [2], 'code': ['KUF']},\n",
       " {'runways': [2], 'code': ['BAH']},\n",
       " {'runways': [2], 'code': ['MAN']},\n",
       " {'runways': [3], 'code': ['BDL']},\n",
       " {'runways': [2], 'code': ['YQF']},\n",
       " {'runways': [2], 'code': ['AIT']},\n",
       " {'runways': [3], 'code': ['MSN']},\n",
       " {'runways': [3], 'code': ['KOI']},\n",
       " {'runways': [2], 'code': ['PUS']},\n",
       " {'runways': [2], 'code': ['SXM']},\n",
       " {'runways': [2], 'code': ['UTN']},\n",
       " {'runways': [3], 'code': ['ROT']},\n",
       " {'runways': [2], 'code': ['SBY']},\n",
       " {'runways': [2], 'code': ['UNK']},\n",
       " {'runways': [2], 'code': ['BHO']},\n",
       " {'runways': [2], 'code': ['TWF']},\n",
       " {'runways': [2], 'code': ['PTJ']},\n",
       " {'runways': [2], 'code': ['EGX']},\n",
       " {'runways': [2], 'code': ['LNS']},\n",
       " {'runways': [2], 'code': ['PQI']},\n",
       " {'runways': [2], 'code': ['EGE']},\n",
       " {'runways': [2], 'code': ['LCJ']},\n",
       " {'runways': [2], 'code': ['STS']},\n",
       " {'runways': [2], 'code': ['KLU']},\n",
       " {'runways': [2], 'code': ['IXM']},\n",
       " {'runways': [2], 'code': ['DPS']},\n",
       " {'runways': [3], 'code': ['DEC']},\n",
       " {'runways': [4], 'code': ['MCO']},\n",
       " {'runways': [2], 'code': ['YEG']},\n",
       " {'runways': [2], 'code': ['CCU']},\n",
       " {'runways': [2], 'code': ['AAR']},\n",
       " {'runways': [2], 'code': ['CTS']},\n",
       " {'runways': [3], 'code': ['BTM']},\n",
       " {'runways': [3], 'code': ['ICT']},\n",
       " {'runways': [3], 'code': ['GTF']},\n",
       " {'runways': [2], 'code': ['WAW']},\n",
       " {'runways': [2], 'code': ['SLW']},\n",
       " {'runways': [2], 'code': ['RAP']},\n",
       " {'runways': [2], 'code': ['SID']},\n",
       " {'runways': [2], 'code': ['RUH']},\n",
       " {'runways': [3], 'code': ['SAT']},\n",
       " {'runways': [2], 'code': ['KYA']},\n",
       " {'runways': [2], 'code': ['YXU']},\n",
       " {'runways': [2], 'code': ['RUN']},\n",
       " {'runways': [3], 'code': ['GRB']},\n",
       " {'runways': [4], 'code': ['ABZ']},\n",
       " {'runways': [2], 'code': ['BFN']},\n",
       " {'runways': [3], 'code': ['YYE']},\n",
       " {'runways': [2], 'code': ['HAM']},\n",
       " {'runways': [3], 'code': ['LAN']},\n",
       " {'runways': [2], 'code': ['SVG']},\n",
       " {'runways': [3], 'code': ['LFT']},\n",
       " {'runways': [2], 'code': ['BSC']},\n",
       " {'runways': [2], 'code': ['OUA']},\n",
       " {'runways': [2], 'code': ['ASP']},\n",
       " {'runways': [2], 'code': ['DBQ']},\n",
       " {'runways': [2], 'code': ['ERC']},\n",
       " {'runways': [2], 'code': ['CSY']},\n",
       " {'runways': [3], 'code': ['CPH']},\n",
       " {'runways': [2], 'code': ['MKL']},\n",
       " {'runways': [2], 'code': ['OWB']},\n",
       " {'runways': [3], 'code': ['WRL']},\n",
       " {'runways': [2], 'code': ['BLA']},\n",
       " {'runways': [2], 'code': ['GDV']},\n",
       " {'runways': [2], 'code': ['CDB']},\n",
       " {'runways': [2], 'code': ['TWB']},\n",
       " {'runways': [2], 'code': ['KUO']},\n",
       " {'runways': [2], 'code': ['ANX']},\n",
       " {'runways': [2], 'code': ['ILY']},\n",
       " {'runways': [2], 'code': ['HKG']},\n",
       " {'runways': [4], 'code': ['LAX']},\n",
       " {'runways': [3], 'code': ['GRR']},\n",
       " {'runways': [3], 'code': ['SAF']},\n",
       " {'runways': [2], 'code': ['RIA']},\n",
       " {'runways': [3], 'code': ['DAY']},\n",
       " {'runways': [2], 'code': ['HET']},\n",
       " {'runways': [2], 'code': ['LUN']},\n",
       " {'runways': [2], 'code': ['MAA']},\n",
       " {'runways': [2], 'code': ['TVF']},\n",
       " {'runways': [2], 'code': ['SCL']},\n",
       " {'runways': [2], 'code': ['TRZ']},\n",
       " {'runways': [2], 'code': ['JBR']},\n",
       " {'runways': [2], 'code': ['DAR']},\n",
       " {'runways': [3], 'code': ['IND']},\n",
       " {'runways': [2], 'code': ['ONG']},\n",
       " {'runways': [2], 'code': ['RZE']},\n",
       " {'runways': [2], 'code': ['MMU']},\n",
       " {'runways': [3], 'code': ['RNO']},\n",
       " {'runways': [2], 'code': ['SUX']},\n",
       " {'runways': [2], 'code': ['YQU']},\n",
       " {'runways': [2], 'code': ['BCI']},\n",
       " {'runways': [2], 'code': ['HKK']},\n",
       " {'runways': [2], 'code': ['KOK']},\n",
       " {'runways': [3], 'code': ['MGB']},\n",
       " {'runways': [2], 'code': ['MBL']},\n",
       " {'runways': [2], 'code': ['IGA']},\n",
       " {'runways': [3], 'code': ['NRL']},\n",
       " {'runways': [2], 'code': ['ONT']},\n",
       " {'runways': [3], 'code': ['SWO']},\n",
       " ...]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    " g.V().has('runways', P.inside(2, 6)).valueMap('code', 'runways').fold().next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1052"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().has('runways', P.inside(2, 6)).count().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## outside()\n",
    "__Airports that have less than 3 or more than 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3084"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "y1 = g.V().has('airport', 'runways', P.outside(3, 5)).count().next()\n",
    "y1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## within()\n",
    "__Airports that have 3 or more but 5 or less runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "# x3 = g.V().has('runways', P.within(3..5)).count().next()\n",
    "# assert x1 == x3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Airports with 3, 4 or 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "290"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x4 = g.V().has('runways', P.within([3,4,5])).count().next()\n",
    "# assert x3 == x4\n",
    "x4"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## without()\n",
    "__Airports that have less than 3 or more than 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "# x5 = g.V().has('runways', P.without(3..5)).count().next()\n",
    "# assert x2 == x5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Airports that do not have 3, 4 or 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "y2 = g.V().has('airport', 'runways', P.without([3,4,5])).count().next()\n",
    "assert y1 == y2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## between()\n",
    "__Airports that have 3 or more but less than 6 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "x6 = g.V().has('runways', P.between(3, 6)).count().next()\n",
    "assert x4 == x6"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Has vertex ID within Sydney's and Hong Kong's__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['SYD', 'HKG']"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasId(P.within([sydneyVertexId, hkVertexId])).values('code').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Airports in NSW that do not have the city \"Sydney\"__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Orange',\n",
       " 'Moruya',\n",
       " 'Merimbula',\n",
       " 'Tamworth',\n",
       " 'Moree',\n",
       " 'Ballina',\n",
       " 'Wagga Wagga',\n",
       " 'Taree',\n",
       " 'Williamtown',\n",
       " 'Dubbo',\n",
       " 'Parkes',\n",
       " 'Grafton',\n",
       " 'Armidale',\n",
       " 'Bathurst',\n",
       " 'Narrabri',\n",
       " 'Broken Hill',\n",
       " 'Coffs Harbour',\n",
       " 'Port Macquarie',\n",
       " 'Griffith',\n",
       " 'Lord Howe Island',\n",
       " 'Narrandera',\n",
       " 'Albury',\n",
       " 'Lismore',\n",
       " 'Gold Coast']"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('airport','region','AU-NSW').has('city', P.neq('Sydney')).values('city').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Path of flights from Hong Kong to Sydney which have 1 stop in Australia__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['HKG', 'BNE', 'SYD'],\n",
       " ['HKG', 'ADL', 'SYD'],\n",
       " ['HKG', 'MEL', 'SYD'],\n",
       " ['HKG', 'PER', 'SYD'],\n",
       " ['HKG', 'CNS', 'SYD']]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('airport','code','HKG').out().has('country', P.within('AU')).out().has('code','SYD').path().by('code').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Path of flights from Hong Kong to Sydney which do not have 1 stop in Australia, Japan or China__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['HK', 'US', 'AU'],\n",
       " ['HK', 'US', 'AU'],\n",
       " ['HK', 'CA', 'AU'],\n",
       " ['HK', 'MY', 'AU'],\n",
       " ['HK', 'QA', 'AU'],\n",
       " ['HK', 'ZA', 'AU'],\n",
       " ['HK', 'PH', 'AU'],\n",
       " ['HK', 'AE', 'AU'],\n",
       " ['HK', 'NZ', 'AU'],\n",
       " ['HK', 'TW', 'AU'],\n",
       " ['HK', 'TH', 'AU'],\n",
       " ['HK', 'VN', 'AU'],\n",
       " ['HK', 'US', 'AU'],\n",
       " ['HK', 'SG', 'AU'],\n",
       " ['HK', 'IN', 'AU'],\n",
       " ['HK', 'KR', 'AU'],\n",
       " ['HK', 'AE', 'AU'],\n",
       " ['HK', 'ID', 'AU'],\n",
       " ['HK', 'ID', 'AU'],\n",
       " ['HK', 'FJ', 'AU'],\n",
       " ['HK', 'TH', 'AU'],\n",
       " ['HK', 'PG', 'AU'],\n",
       " ['HK', 'VN', 'AU']]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('airport','code','HKG').out().has('country', P.without(['AU', 'JP', 'CN'])).out().has('code','SYD').path().by('country').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Between can also be used to simulate \"starts with\"__\n",
    "\n",
    "All airports that have a city name starting with \"Dal\" or \"Dam\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Dalat', 'Dallas', 'Dalcahue', 'Dalaman', 'Dalian', 'Dalanzadgad']"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('city', P.between('Dal', 'Dam')).values('city').dedup().fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Trick to find strings that begin with a single character (S)__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['SDU',\n",
       " 'SOW',\n",
       " 'SGD',\n",
       " 'SLL',\n",
       " 'SFB',\n",
       " 'SZG',\n",
       " 'SPR',\n",
       " 'SXF',\n",
       " 'SOU',\n",
       " 'SMK',\n",
       " 'SDQ',\n",
       " 'SXI',\n",
       " 'SML',\n",
       " 'SZY',\n",
       " 'SBN',\n",
       " 'SPD',\n",
       " 'SVL',\n",
       " 'SJU',\n",
       " 'SLK',\n",
       " 'SHC',\n",
       " 'SVQ',\n",
       " 'STT',\n",
       " 'SEA',\n",
       " 'SFG',\n",
       " 'SLM',\n",
       " 'SAH',\n",
       " 'SSG',\n",
       " 'SBA',\n",
       " 'SDR',\n",
       " 'SUJ',\n",
       " 'SVD',\n",
       " 'SHE',\n",
       " 'SXR',\n",
       " 'STI',\n",
       " 'SPU',\n",
       " 'SGF',\n",
       " 'SHW',\n",
       " 'SJE',\n",
       " 'SCV',\n",
       " 'SMA',\n",
       " 'SYO',\n",
       " 'SKO',\n",
       " 'SHF',\n",
       " 'SJL',\n",
       " 'SCE',\n",
       " 'SCQ',\n",
       " 'SSR',\n",
       " 'SCY',\n",
       " 'SOQ',\n",
       " 'SFA',\n",
       " 'STG',\n",
       " 'SDP',\n",
       " 'SPN',\n",
       " 'SVU',\n",
       " 'SMI',\n",
       " 'SPI',\n",
       " 'SMS',\n",
       " 'SKG',\n",
       " 'SKT',\n",
       " 'SLQ',\n",
       " 'SLC',\n",
       " 'SCW',\n",
       " 'SJP',\n",
       " 'SVI',\n",
       " 'SZZ',\n",
       " 'SXP',\n",
       " 'SSH',\n",
       " 'SBP',\n",
       " 'SOY',\n",
       " 'STM',\n",
       " 'SKU',\n",
       " 'SVS',\n",
       " 'SVK',\n",
       " 'SHX',\n",
       " 'SFT',\n",
       " 'SEN',\n",
       " 'SLA',\n",
       " 'SYY',\n",
       " 'SDD',\n",
       " 'SYZ',\n",
       " 'SJI',\n",
       " 'SDL',\n",
       " 'SYD',\n",
       " 'SQS',\n",
       " 'SRE',\n",
       " 'SVA',\n",
       " 'SCU',\n",
       " 'SFN',\n",
       " 'SHG',\n",
       " 'SLZ',\n",
       " 'SDJ',\n",
       " 'SDG',\n",
       " 'SFO',\n",
       " 'SDN',\n",
       " 'SPS',\n",
       " 'SGO',\n",
       " 'SHB',\n",
       " 'STN',\n",
       " 'SJO',\n",
       " 'SNV',\n",
       " 'SRZ',\n",
       " 'SUB',\n",
       " 'SZF',\n",
       " 'SKP',\n",
       " 'SXB',\n",
       " 'SJT',\n",
       " 'SDE',\n",
       " 'SUF',\n",
       " 'SKK',\n",
       " 'SBZ',\n",
       " 'SYQ',\n",
       " 'SEZ',\n",
       " 'SRG',\n",
       " 'STL',\n",
       " 'SYX',\n",
       " 'SGY',\n",
       " 'SPP',\n",
       " 'SVX',\n",
       " 'SOM',\n",
       " 'SNE',\n",
       " 'SHH',\n",
       " 'SOF',\n",
       " 'SGC',\n",
       " 'SJK',\n",
       " 'SGU',\n",
       " 'SLY',\n",
       " 'SYR',\n",
       " 'SCN',\n",
       " 'SUV',\n",
       " 'SJC',\n",
       " 'SAB',\n",
       " 'STR',\n",
       " 'SJZ',\n",
       " 'SMF',\n",
       " 'SHJ',\n",
       " 'STW',\n",
       " 'SCK',\n",
       " 'SHP',\n",
       " 'SLP',\n",
       " 'SKN',\n",
       " 'SHV',\n",
       " 'SUG',\n",
       " 'SWF',\n",
       " 'SOC',\n",
       " 'SWJ',\n",
       " 'SOJ',\n",
       " 'SCZ',\n",
       " 'SVB',\n",
       " 'SLH',\n",
       " 'SDY',\n",
       " 'SVP',\n",
       " 'STX',\n",
       " 'SIN',\n",
       " 'SNU',\n",
       " 'SJW',\n",
       " 'SNA',\n",
       " 'SHR',\n",
       " 'SSJ',\n",
       " 'SZA',\n",
       " 'SKZ',\n",
       " 'SMX',\n",
       " 'SFL',\n",
       " 'SAW',\n",
       " 'SVZ',\n",
       " 'SCT',\n",
       " 'SRA',\n",
       " 'SBH',\n",
       " 'SGN',\n",
       " 'SUN',\n",
       " 'SWA',\n",
       " 'SHL',\n",
       " 'SKD',\n",
       " 'SKB',\n",
       " 'SLX',\n",
       " 'SHA',\n",
       " 'SIP',\n",
       " 'SMR',\n",
       " 'SRX',\n",
       " 'SCC',\n",
       " 'SLN',\n",
       " 'SHM',\n",
       " 'SNP',\n",
       " 'SIT',\n",
       " 'STD',\n",
       " 'STC',\n",
       " 'STV',\n",
       " 'SKX',\n",
       " 'SVO',\n",
       " 'SNO',\n",
       " 'SPC',\n",
       " 'SQJ',\n",
       " 'SDF',\n",
       " 'SRP',\n",
       " 'SRY',\n",
       " 'SHD',\n",
       " 'SDK',\n",
       " 'SSY',\n",
       " 'SYM',\n",
       " 'SZB',\n",
       " 'SAP',\n",
       " 'SXM',\n",
       " 'SBY',\n",
       " 'SXK',\n",
       " 'SNW',\n",
       " 'STS',\n",
       " 'SZX',\n",
       " 'SKE',\n",
       " 'SDV',\n",
       " 'SLW',\n",
       " 'SID',\n",
       " 'SFH',\n",
       " 'SJD',\n",
       " 'SAT',\n",
       " 'SBW',\n",
       " 'SLI',\n",
       " 'SZE',\n",
       " 'SVG',\n",
       " 'SFJ',\n",
       " 'SOG',\n",
       " 'SJJ',\n",
       " 'SLU',\n",
       " 'SAF',\n",
       " 'SCL',\n",
       " 'SUX',\n",
       " 'SAN',\n",
       " 'SWO',\n",
       " 'SVC',\n",
       " 'SON',\n",
       " 'SNN',\n",
       " 'SRQ',\n",
       " 'SAL',\n",
       " 'SUK',\n",
       " 'SVJ',\n",
       " 'SAV',\n",
       " 'SZI',\n",
       " 'SCO',\n",
       " 'SSA',\n",
       " 'SCM']"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('airport','code',P.between('S','Sa')).values('code').fold().next()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
