{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 10. Predicates\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import P\n",
    "from loader import __\n",
    "from loader import hkVertexId\n",
    "from loader import sydneyVertexId"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## eq()\n",
    "__Airports that have 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Paraparaumu Airport',\n",
       " 'Tauranga Airport',\n",
       " 'Toronto Pearson International Airport',\n",
       " 'Hamilton International Airport',\n",
       " 'Shannon Airport',\n",
       " 'George Bush Intercontinental',\n",
       " 'Hartsfield - Jackson Atlanta International Airport',\n",
       " 'Ufa International Airport',\n",
       " 'Napier Airport',\n",
       " 'General Mitchell International Airport',\n",
       " 'Gisborne Airport',\n",
       " 'Karup Airport',\n",
       " 'Chicago Midway International Airport',\n",
       " 'Nelson Airport']"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('runways', P.eq(5)).values('desc').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## neq()\n",
    "__Airports that do not have 4 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Verona Villafranca Airport',\n",
       " 'Pico Airport',\n",
       " 'East Texas Regional Airport',\n",
       " 'Gothenburg City Airport',\n",
       " 'Raleigh-Durham',\n",
       " 'Tbilisi International Airport',\n",
       " 'Rarotonga International Airport',\n",
       " 'Bhutan',\n",
       " 'Aurangabad Airport',\n",
       " 'Lipetsk Airport',\n",
       " 'Vnukovo International Airport',\n",
       " 'Robert (Bob) Curtis Memorial Airport',\n",
       " 'Gyumri Shirak Airport',\n",
       " 'Aksu Airport',\n",
       " 'Lima, Jorge Chavez International Airport',\n",
       " 'Dawei Airport',\n",
       " 'Luxor International Airport',\n",
       " 'Ranong Airport',\n",
       " 'General Ignacio P. Garcia International Airport',\n",
       " 'Rock Sound Airport',\n",
       " 'Alexander the Great International Airport',\n",
       " 'El Plumerillo Airport',\n",
       " 'Raiatea Airport',\n",
       " 'Owensboro Daviess County Airport',\n",
       " 'Ulan-Ude Airport (Mukhino)',\n",
       " 'Syracuse Hancock International Airport',\n",
       " 'Lokichoggio Airport',\n",
       " 'Jessore Airport',\n",
       " 'Show Low Regional Airport',\n",
       " 'Mauritania',\n",
       " 'Fort Nelson Airport',\n",
       " 'Republic of Korea',\n",
       " 'Providenciales Airport',\n",
       " 'Dunedin Airport',\n",
       " 'Bojnord Airport',\n",
       " 'Bosnia and Herzegovina',\n",
       " 'Macaé Airport',\n",
       " 'Warsaw Chopin Airport',\n",
       " 'Nusatupe Airport',\n",
       " 'Silvio Pettirossi International Airport',\n",
       " 'Al Massira Airport',\n",
       " 'Saudi Arabia',\n",
       " 'Sary-Arka Airport',\n",
       " 'Anshun Huangguoshu Airport',\n",
       " 'Jersey Airport',\n",
       " 'Moscow, Sheremetyevo International Airport',\n",
       " 'Zunyi Xinzhou Airport',\n",
       " 'Ngari Gunsa Airport',\n",
       " 'San Luis County Regional Airport',\n",
       " 'Mitiaro Island Airport',\n",
       " 'Virgin Gorda Airport',\n",
       " 'Moscow, Domodedovo International Airport',\n",
       " 'Cozumel International Airport',\n",
       " 'Moenjodaro Airport',\n",
       " 'Four Corners Regional Airport',\n",
       " 'Hawarden Airport',\n",
       " 'Dangriga Airport',\n",
       " 'Karlstad Airport',\n",
       " 'Southwest Georgia Regional Airport',\n",
       " 'Aswan International Airport',\n",
       " 'Caye Caulker Airport',\n",
       " 'Munich International Airport',\n",
       " 'Valdez Pioneer Field',\n",
       " 'Falcone–Borsellino Airport',\n",
       " 'Margate Airport',\n",
       " 'Campbell River Airport',\n",
       " 'Ronneby Airport',\n",
       " 'Lille-Lesquin Airport',\n",
       " 'Makemo Airport',\n",
       " 'Imphal Airport',\n",
       " 'Lintsang Airfield',\n",
       " 'Menara Airport',\n",
       " 'Dien Bien Phu Airport',\n",
       " 'Erie International Tom Ridge Field',\n",
       " 'Gannan Xiahe Airport',\n",
       " 'Senadora Eunice Micheles Airport',\n",
       " 'Gabon',\n",
       " 'Chita-Kadala Airport',\n",
       " 'Del Bajio International Airport',\n",
       " 'New Orleans L. Armstrong',\n",
       " 'Dr. Antonio Nicolás Briceño Airport',\n",
       " 'Gillette Campbell County Airport',\n",
       " 'Brno-Tuřany Airport',\n",
       " 'Springfield Branson National Airport',\n",
       " 'Sochi International Airport',\n",
       " 'RAF Ascension Island',\n",
       " 'Dachuan Airport',\n",
       " 'Ataq Airport',\n",
       " 'Ji-Paraná Airport',\n",
       " 'Barkley Regional Airport',\n",
       " 'Almirante Marco Andres Zar Airport',\n",
       " 'Gallatin Field',\n",
       " 'Australia',\n",
       " 'Cape Dorset Airport',\n",
       " 'Mountain Village Airport',\n",
       " 'Liping Airport',\n",
       " 'Loreto International Airport',\n",
       " 'Vanimo Airport',\n",
       " 'Kaitaia Airport',\n",
       " 'Armenia',\n",
       " 'Gainesville Regional Airport',\n",
       " 'Coral Harbour Airport',\n",
       " 'Lomé-Tokoin Airport',\n",
       " 'Addis Ababa Bole International Airport',\n",
       " 'Momote Airport',\n",
       " 'Cascavel Airport',\n",
       " 'Mackay Airport',\n",
       " 'Abakan Airport',\n",
       " 'Ngjiva Pereira Airport',\n",
       " 'Piedras Negras International Airport',\n",
       " 'Wallis and Futuna Islands',\n",
       " 'Cheikh Larbi Tébessi Airport',\n",
       " 'Cuba',\n",
       " 'Fort Smith Airport',\n",
       " 'British Virgin Islands',\n",
       " 'Hubli Airport',\n",
       " 'Kazi Nazrul Islam Airport',\n",
       " 'Svolvær Helle Airport',\n",
       " 'Tunxi International Airport',\n",
       " 'Zhanjiang Airport',\n",
       " 'North Ronaldsay Airport',\n",
       " 'Tubuai Airport',\n",
       " 'Turku Airport',\n",
       " 'Batticaloa Airport',\n",
       " 'Reggio Calabria Airport',\n",
       " 'Toulon-Hyères Airport',\n",
       " 'Philibert Tsiranana (Amborovy) Airport',\n",
       " 'Banja Luka International Airport',\n",
       " 'Pilot Point Airport',\n",
       " 'Yemen',\n",
       " 'Punta Gorda Airport',\n",
       " 'Norway',\n",
       " 'U-Tapao International Airport',\n",
       " 'Rzeszów-Jasionka Airport',\n",
       " 'Sudbury Airport',\n",
       " 'Ouzinkie Airport',\n",
       " 'Chernivtsi International Airport',\n",
       " 'Reno Taoe International Airport',\n",
       " 'Siwo Airport',\n",
       " 'Datong Airport',\n",
       " 'Baltimore/Washington International Airport',\n",
       " 'Minatitlán/Coatzacoalcos National Airport',\n",
       " 'Tengchong Tuofeng Airport',\n",
       " 'Gerrard Smith International Airport',\n",
       " 'Mataveri Airport',\n",
       " 'Cacoal Airport',\n",
       " 'Aktion National Airport',\n",
       " 'George Airport',\n",
       " 'Lappeenranta Airport',\n",
       " 'Brigadeiro Lysias Rodrigues Airport',\n",
       " 'São Gabriel da Cachoeira Airport',\n",
       " 'Kavieng Airport',\n",
       " 'General Juan N Alvarez International Airport',\n",
       " 'Kangra Airport',\n",
       " 'Scott AFB/Midamerica Airport',\n",
       " 'Resistencia International Airport',\n",
       " 'Melbourne International Airport',\n",
       " 'Lungi International Airport',\n",
       " 'Busselton Regional Airport',\n",
       " 'Il Caravaggio International Airport',\n",
       " 'Khoram Abad Airport',\n",
       " 'Abdul Rachman Saleh Airport',\n",
       " 'La Grande Rivière Airport',\n",
       " 'Araguaína Airport',\n",
       " 'Amado Nervo National Airport',\n",
       " 'Ralph M Calhoun Memorial Airport',\n",
       " 'Tenerife South Airport',\n",
       " 'Eglin Air Force Base',\n",
       " 'Hasanuddin International Airport',\n",
       " 'Sendai Airport',\n",
       " 'Mora Airport',\n",
       " 'Bol Airport',\n",
       " 'Palmerston North Airport',\n",
       " 'Arrachart Airport',\n",
       " 'Gällivare Airport',\n",
       " 'Kangirsuk Airport',\n",
       " 'Centennial Airport',\n",
       " 'Adana Airport',\n",
       " 'Peru',\n",
       " 'Nakhon Si Thammarat Airport',\n",
       " \"Fua'amotu International Airport\",\n",
       " 'Edward Bodden Airfield',\n",
       " 'Guam',\n",
       " 'Phoenix-Mesa-Gateway Airport',\n",
       " 'Geneina Airport',\n",
       " 'Juan Gualberto Gomez International Airport',\n",
       " 'Port Macquarie Airport',\n",
       " 'Lincoln Airport',\n",
       " 'Yellowstone Regional Airport',\n",
       " 'Lancaster Airport',\n",
       " 'Savannakhet Airport',\n",
       " 'Hengyang Airport',\n",
       " 'Sara Airport',\n",
       " 'Saipan International Airport',\n",
       " 'Hilo International Airport',\n",
       " 'Cayenne-Rochambeau Airport',\n",
       " 'Virgin Islands (US)',\n",
       " 'Brunei International Airport',\n",
       " 'Rwanda',\n",
       " 'Jining Qufu Airport',\n",
       " 'Raivavae Airport',\n",
       " 'Bubung Airport',\n",
       " 'Narsarsuaq Airport',\n",
       " 'Sitka Rocky Gutierrez Airport',\n",
       " 'Tokua Airport',\n",
       " 'Sultan Mahmud Badaruddin Ii Airport',\n",
       " 'Mehamn Airport',\n",
       " 'Maturín Airport',\n",
       " 'Yeager Airport',\n",
       " 'Hamburg Airport',\n",
       " 'Huntsville International Carl T Jones Field',\n",
       " 'Gothenburg-Landvetter Airport',\n",
       " 'Santa Rosa Airport',\n",
       " 'Liupanshui Yuezhao Airport',\n",
       " 'Jyvaskyla Airport',\n",
       " 'Mukah Airport',\n",
       " 'Prof. Eribelto Manoel Reino State Airport',\n",
       " 'Switzerland',\n",
       " 'Rurutu Airport',\n",
       " 'Malaga Airport',\n",
       " 'São Jorge Airport',\n",
       " 'Mariscal Lamar Airport',\n",
       " 'Gaziantep International Airport',\n",
       " 'Sundsvall-Härnösand Airport',\n",
       " 'Soekarno-Hatta International Airport',\n",
       " 'Leh Kushok Bakula Rimpochee Airport',\n",
       " 'Thailand',\n",
       " 'Bintulu Airport',\n",
       " 'Belgorod International Airport',\n",
       " 'New Zealand',\n",
       " 'Wiley Post Will Rogers Memorial Airport',\n",
       " 'Alula Aba Nega Airport',\n",
       " 'Mexico',\n",
       " 'Stord Airport',\n",
       " 'Kalamazoo Battle Creek International Airport',\n",
       " 'Billund Airport',\n",
       " 'Bastia-Poretta Airport',\n",
       " 'Ganja Airport',\n",
       " 'Kuqa Airport',\n",
       " 'Béziers-Vias Airport',\n",
       " 'Mardin Airport',\n",
       " 'Ravensthorpe Airport',\n",
       " 'London Airport',\n",
       " 'Kristianstad Airport',\n",
       " 'Mali',\n",
       " 'Gafsa Ksar International Airport',\n",
       " 'Rota International Airport',\n",
       " 'Honduras',\n",
       " 'Abeid Amani Karume International Airport',\n",
       " 'Rovaniemi Airport',\n",
       " 'Al Ahsa Airport',\n",
       " 'Toledo Express Airport',\n",
       " 'Marcos A. Gelabert International Airport',\n",
       " 'Tuluksak Airport',\n",
       " 'Roberts International Airport',\n",
       " 'São Pedro Airport',\n",
       " 'Pemba Airport',\n",
       " 'Kuai, Lihue Airport',\n",
       " 'Milan, Malpensa International Airport',\n",
       " 'Yellowknife Airport',\n",
       " 'Lankaran International Airport',\n",
       " 'Estonia',\n",
       " 'Southeast Iowa Regional Airport',\n",
       " 'Colombia',\n",
       " 'Sultan Khairun Babullah Airport',\n",
       " 'Penang International Airport',\n",
       " 'Kitakyūshū Airport',\n",
       " 'Joensuu Airport',\n",
       " 'Almirante Padilla Airport',\n",
       " 'Paraparaumu Airport',\n",
       " 'Persian Gulf International Airport',\n",
       " 'Ernesto Cortissoz International Airport',\n",
       " 'Kithira Airport',\n",
       " 'Gjoa Haven Airport',\n",
       " 'Afghanistan',\n",
       " 'Tauranga Airport',\n",
       " 'Nuku Hiva Airport',\n",
       " 'La Tabatière Airport',\n",
       " 'Val de Cans/Júlio Cezar Ribeiro International Airport',\n",
       " 'Tunoshna Airport',\n",
       " 'Vero Beach Municipal Airport',\n",
       " 'Odate Noshiro Airport',\n",
       " 'Salekhard Airport',\n",
       " 'Dong Hoi Airport',\n",
       " 'Fujairah International Airport',\n",
       " 'Santo Ângelo Airport',\n",
       " 'Bharatpur Airport',\n",
       " 'Ballera Airport',\n",
       " 'Venice, Treviso-Sant Angelo Airport',\n",
       " 'Quetta International Airport',\n",
       " 'Guilin Liangjiang International Airport',\n",
       " 'Iloilo International Airport',\n",
       " \"Bangui M'Poko International Airport\",\n",
       " 'Murmansk Airport',\n",
       " 'Lanzarote Airport',\n",
       " 'Juba International Airport',\n",
       " 'Mostar International Airport',\n",
       " 'Hangzhou Xiaoshan International Airport',\n",
       " 'Harstad/Narvik Airport, Evenes',\n",
       " 'Argentina',\n",
       " 'Brønnøysund Airport',\n",
       " 'Mid Ohio Valley Regional Airport',\n",
       " 'Senou Airport',\n",
       " 'Denver International Airport',\n",
       " 'Bahir Dar Airport',\n",
       " 'Kinmen Airport',\n",
       " 'Moro Airport',\n",
       " 'Prince Rupert Airport',\n",
       " 'Chingozi Airport',\n",
       " 'Pago Pago International Airport',\n",
       " 'Quzhou Airport',\n",
       " 'Toronto Pearson International Airport',\n",
       " 'Trabzon International Airport',\n",
       " 'Tin City Long Range Radar Station Airport',\n",
       " 'Yangon International Airport',\n",
       " 'Luderitz Airport',\n",
       " 'El Caraño Airport',\n",
       " 'Ogle Airport',\n",
       " 'Cluj-Napoca International Airport',\n",
       " 'Sogndal Airport',\n",
       " 'Kotlik Airport',\n",
       " 'Moses Kilangin Airport',\n",
       " 'Cocos (Keeling) Islands',\n",
       " 'Lanzhou Zhongchuan Airport',\n",
       " 'Kiritimati (Christmas Island) - Cassidy International Airport',\n",
       " 'Wolter Monginsidi Airport',\n",
       " 'Macau International Airport',\n",
       " 'Jersey',\n",
       " 'Ipota Airport',\n",
       " 'Congonhas Airport',\n",
       " 'Del Caribe Santiago Mariño International Airport',\n",
       " 'Osh Airport',\n",
       " \"Bao'anying Airport\",\n",
       " 'Hamilton International Airport',\n",
       " 'Oshima Airport',\n",
       " 'Dothan Regional Airport',\n",
       " 'Ayers Rock Connellan Airport',\n",
       " 'Presidente João Suassuna Airport',\n",
       " 'Monaco',\n",
       " 'Regional de Maringá - Sílvio Nane Junior Airport',\n",
       " 'Al-Jawf Domestic Airport',\n",
       " 'Richmond Airport',\n",
       " 'Cheddi Jagan International Airport',\n",
       " 'Batman Airport',\n",
       " 'Guernsey',\n",
       " 'Licenciado Manuel Crescencio Rejon Int Airport',\n",
       " 'Pichoy Airport',\n",
       " \"L'Espérance Airport\",\n",
       " 'Mogador Airport',\n",
       " 'Gode Airport',\n",
       " 'Xiangfan Airport',\n",
       " 'Bremen Airport',\n",
       " 'Jorge E. Gonzalez Torres Airport',\n",
       " 'Kirovsk-Apatity Airport',\n",
       " 'Entebbe International Airport',\n",
       " 'Prague, Ruzyne International Airport',\n",
       " 'Zenata – Messali El Hadj Airport',\n",
       " 'Presidente Prudente Airport',\n",
       " 'Mandalay International Airport',\n",
       " 'South Bend Regional Airport',\n",
       " 'Belgaum Airport',\n",
       " 'Guadeloupe',\n",
       " 'Gimpo International Airport',\n",
       " 'Chu Lai International Airport',\n",
       " 'Bolzano Airport',\n",
       " 'Douala International Airport',\n",
       " 'Kuching International Airport',\n",
       " 'Stagen Airport',\n",
       " 'Zakynthos, Dionysios Solomos Airport',\n",
       " 'Hoonah Airport',\n",
       " 'Barcelos Airport',\n",
       " 'Chisasibi Airport',\n",
       " 'Nuremberg Airport',\n",
       " 'Point Salines International Airport',\n",
       " 'Newquay Cornwall Airport',\n",
       " 'Monte Dourado Airport',\n",
       " 'Weifang Airport',\n",
       " 'Florø Airport',\n",
       " 'Udon Thani Airport',\n",
       " 'Abilene Regional Airport',\n",
       " 'Kaltag Airport',\n",
       " 'Figari Sud-Corse Airport',\n",
       " 'Paphos International Airport',\n",
       " 'Plácido de Castro Airport',\n",
       " 'Page Municipal Airport',\n",
       " 'Owen Roberts International Airport',\n",
       " 'Ikaria Airport',\n",
       " 'Akureyri Airport',\n",
       " 'Akron Canton Regional Airport',\n",
       " 'Miyako Airport',\n",
       " 'Lycksele Airport',\n",
       " 'Erfurt Airport',\n",
       " 'Arnold Palmer Regional Airport',\n",
       " 'Aneityum Airport',\n",
       " 'Texarkana Regional Webb Field',\n",
       " 'Burketown Airport',\n",
       " 'Xieng Khouang Airport',\n",
       " 'Bournemouth Airport',\n",
       " 'Swaziland',\n",
       " 'Windsor Airport',\n",
       " 'Itaituba Airport',\n",
       " 'Rhodes, Diagoras Airport',\n",
       " 'Toamasina Airport',\n",
       " 'Northeast Florida Regional Airport',\n",
       " 'Bauru - Arealva Airport',\n",
       " 'Brisbane West Wellcamp Airport',\n",
       " 'Achmad Yani Airport',\n",
       " 'Nepalgunj Airport',\n",
       " 'Fascene Airport',\n",
       " 'Porbandar Airport',\n",
       " 'Edinburgh Airport',\n",
       " 'Faisalabad International Airport',\n",
       " 'Copernicus Wroclaw Airport',\n",
       " 'San Sebastian Airport',\n",
       " 'Jerez Airport',\n",
       " 'Amsterdam Airport Schiphol',\n",
       " 'Garden City Regional Airport',\n",
       " 'Coronel Artilleria Victor Larrea Airport',\n",
       " 'Guinea',\n",
       " 'Yakutat Airport',\n",
       " 'Iskandar Airport',\n",
       " 'Juan Pablo Pérez Alfonso Airport',\n",
       " 'Delta County Airport',\n",
       " 'Shannon Airport',\n",
       " 'Beira Airport',\n",
       " 'Gonder Airport',\n",
       " 'Grand Canyon National Park Airport',\n",
       " 'Lismore Airport',\n",
       " 'Loei Airport',\n",
       " 'Majeed Bin Abdulaziz Airport',\n",
       " 'Tegucigalpa, Toncontin International Airport',\n",
       " 'Maui, Kahului Airport',\n",
       " 'Stornoway Airport',\n",
       " 'La Nubia Airport',\n",
       " 'Durango La Plata County Airport',\n",
       " 'Flinders Island Airport',\n",
       " 'Calvi-Sainte-Catherine Airport',\n",
       " 'Astypalaia Airport',\n",
       " 'Clovis Municipal Airport',\n",
       " 'Capitan Nicolas Rojas Airport',\n",
       " 'Betoambari Airport',\n",
       " 'Dera Ghazi Khan Airport',\n",
       " 'Colombo, Bandaranaike International Airport',\n",
       " 'Astana International Airport',\n",
       " 'Malatya Erhaç Airport',\n",
       " 'Wagga Wagga City Airport',\n",
       " 'Terrace Airport',\n",
       " 'Marshall Islands',\n",
       " 'Limbang Airport',\n",
       " 'Capital City Airport',\n",
       " 'Chuathbaluk Airport',\n",
       " 'Choibalsan Airport',\n",
       " 'Roshchino International Airport',\n",
       " 'Girua Airport',\n",
       " 'Shreveport Regional Airport',\n",
       " 'Kansas City International Airport',\n",
       " 'Mayaguana Airport',\n",
       " 'Varna Airport',\n",
       " 'Port Bouet Airport',\n",
       " 'Dongshan Airport',\n",
       " 'Pinto Martins International Airport',\n",
       " 'Seattle-Tacoma',\n",
       " 'Boryspil International Airport',\n",
       " 'Jizan Regional Airport',\n",
       " 'South Africa',\n",
       " 'General Roberto Fierro Villalobos International Airport',\n",
       " 'Rotuma Airport',\n",
       " 'Ben Schoeman Airport',\n",
       " 'Darwin International Airport',\n",
       " 'Norsup Airport',\n",
       " 'Piedmont Triad International Airport',\n",
       " 'Clyde River Airport',\n",
       " 'Hermanos Serdán International Airport',\n",
       " 'Alpena County Regional Airport',\n",
       " 'Brigadier Antonio Parodi Airport',\n",
       " 'Moruya Airport',\n",
       " 'Puerto Escondido International Airport',\n",
       " 'Saarbrücken Airport',\n",
       " 'Deadhorse Airport',\n",
       " 'Zemunik Airport',\n",
       " 'Playa De Oro International Airport',\n",
       " 'Yampa Valley Airport',\n",
       " 'Fort Severn Airport',\n",
       " 'Bonaire - Sint Eustatius and Saba',\n",
       " 'Albury Airport',\n",
       " 'Mongolia',\n",
       " 'Moomba Airport',\n",
       " 'Waynesville-St. Robert Regional Forney field',\n",
       " 'Castres-Mazamet Airport',\n",
       " 'Bearskin Lake Airport',\n",
       " 'Bandara International Lombok Airport',\n",
       " 'Aruba, Queen Beatrix International Airport',\n",
       " 'Nikolai Airport',\n",
       " 'El Paso International Airport',\n",
       " 'Lilongwe International Airport',\n",
       " 'Naha Airport',\n",
       " 'St Pierre Airport',\n",
       " 'Wuhai Airport',\n",
       " 'Usinsk Airport',\n",
       " 'Yakutsk Airport',\n",
       " 'Dole-Tavaux Airport',\n",
       " 'Pattimura Airport, Ambon',\n",
       " 'Yulin Airport',\n",
       " 'Gustavo Vargas Airport',\n",
       " 'Mannheim-City Airport',\n",
       " 'Ulanhot Airport',\n",
       " 'Tokachi-Obihiro Airport',\n",
       " 'Montrose Regional Airport',\n",
       " 'Menorca Airport',\n",
       " 'Houghton County Memorial Airport',\n",
       " 'Surgut Airport',\n",
       " 'Thessaloniki Macedonia International Airport',\n",
       " 'Husein Sastranegara International Airport',\n",
       " 'Spain',\n",
       " 'Milos Airport',\n",
       " 'Charleville Airport',\n",
       " 'Peshawar International Airport',\n",
       " 'Golog Maqin Airport',\n",
       " 'Glasgow Prestwick Airport',\n",
       " 'Rock Springs Sweetwater County Airport',\n",
       " 'Point Lay LRRS Airport',\n",
       " 'Saurimo Airport',\n",
       " 'Cincinnati Municipal Airport Lunken Field',\n",
       " 'Healy River Airport',\n",
       " 'Mangalore International Airport',\n",
       " 'Horn Island Airport',\n",
       " 'Southwest Florida International Airport',\n",
       " 'Greenland',\n",
       " 'Portland International Jetport Airport',\n",
       " 'Kuwait',\n",
       " 'Lorient South Brittany (Bretagne Sud) Airport',\n",
       " 'Kastoria National Airport',\n",
       " 'Asaba International Airport',\n",
       " 'Karlsruhe Baden-Baden Airport',\n",
       " 'Taree Airport',\n",
       " 'Calbayog Airport',\n",
       " 'Gelendzhik Airport',\n",
       " 'Sir Seretse Khama International Airport',\n",
       " 'Telluride Regional Airport',\n",
       " 'Luoyang Airport',\n",
       " 'Oulu Airport',\n",
       " 'Dortmund Airport',\n",
       " 'Ürümqi Diwopu International Airport',\n",
       " 'Mörön Airport',\n",
       " 'Evansville Regional Airport',\n",
       " 'Chambéry-Savoie Airport',\n",
       " 'Mianyang Airport',\n",
       " 'Lengpui Airport',\n",
       " 'Clermont-Ferrand Auvergne Airport',\n",
       " 'Mytilene International Airport',\n",
       " 'Lynchburg Regional Preston Glenn Field',\n",
       " 'Kédougou Airport',\n",
       " 'Noyabrsk Airport',\n",
       " 'Delma Island',\n",
       " 'Cumaná (Antonio José de Sucre) Airport',\n",
       " 'Kagoshima Airport',\n",
       " 'Natashquan Airport',\n",
       " 'Syros Airport',\n",
       " 'Jonesboro Municipal Airport',\n",
       " 'Kashgar Airport',\n",
       " 'Sam Ratulangi Airport',\n",
       " 'Makung Airport',\n",
       " 'Palanga International Airport',\n",
       " 'Fredericton Airport',\n",
       " 'Cabo Frio Airport',\n",
       " 'Puerto Vallarta, Licenciado Gustavo Diaz Ordaz International Airport',\n",
       " 'Kingston Norman Rogers Airport',\n",
       " 'Wynyard Airport',\n",
       " 'Seymour Airport',\n",
       " 'Ain Arnat Airport',\n",
       " 'Kiunga Airport',\n",
       " 'Bogashevo Airport',\n",
       " 'Las Américas International Airport',\n",
       " 'Dundee Airport',\n",
       " 'Changzhoudao Airport',\n",
       " 'Taiyuan Wusu Airport',\n",
       " 'Bali - Ngurah Rai International Airport',\n",
       " 'Suvarnabhumi Bangkok International Airport',\n",
       " 'Francisco B. Reyes Airport',\n",
       " 'Kingston, Norman Manley International Airport',\n",
       " 'Antigua and Barbuda',\n",
       " 'Greenville Spartanburg International Airport',\n",
       " 'Senegal',\n",
       " 'New Plymouth Airport',\n",
       " 'Tri Cities Regional Tn Va Airport',\n",
       " 'Ho Chi Minh City, Tan Son Nhat International Airport',\n",
       " 'Jamestown Regional Airport',\n",
       " 'Sharurah Airport',\n",
       " 'Sihanoukville International Airport',\n",
       " 'Lahad Datu Airport',\n",
       " 'Vijayawada Airport',\n",
       " 'Merimbula Airport',\n",
       " 'Glasgow International Airport',\n",
       " 'Flagstaff Pulliam Airport',\n",
       " 'El Salvador International Airport',\n",
       " 'Arcata Airport',\n",
       " 'Yibin Caiba Airport',\n",
       " 'Hall Beach Airport',\n",
       " 'Biarritz-Anglet-Bayonne Airport',\n",
       " 'Chania International Airport',\n",
       " 'Jorge Newbery Airpark',\n",
       " 'Kuito Airport',\n",
       " 'Port Hardy Airport',\n",
       " 'Laughlin Bullhead International Airport',\n",
       " 'La Florida Airport',\n",
       " 'V.C. Bird International Airport',\n",
       " 'Cocos (Keeling) Islands Airport',\n",
       " 'Silver Creek Airport',\n",
       " 'Bakalalan Airport',\n",
       " 'LTS Pulau Redang Airport',\n",
       " 'Churchill Falls Airport',\n",
       " 'Cortez Municipal Airport',\n",
       " 'Mulu Airport',\n",
       " 'Schefferville Airport',\n",
       " 'Mid Delta Regional Airport',\n",
       " 'Nea Anchialos Airport',\n",
       " 'Penticton Airport',\n",
       " 'Okha Airport',\n",
       " 'Alicante International Airport',\n",
       " 'Turin Airport',\n",
       " 'Sheridan County Airport',\n",
       " 'Merced Regional Macready Field',\n",
       " 'Babo Airport',\n",
       " 'Suceava Stefan cel Mare Airport',\n",
       " 'Charlotte County Airport',\n",
       " 'Erzurum International Airport',\n",
       " 'Kodiak Airport',\n",
       " 'Sandy Lake Airport',\n",
       " 'Gu-Lian Airport',\n",
       " 'Transilvania Târgu Mureş International Airport',\n",
       " 'United Kingdom',\n",
       " 'Herat Airport',\n",
       " 'Tikehau Airport',\n",
       " 'Newark, Liberty',\n",
       " 'Beaver Airport',\n",
       " 'Dong Tac Airport',\n",
       " 'Tanzania',\n",
       " 'Birch Creek Airport',\n",
       " 'Quinhagak Airport',\n",
       " 'Miri Airport',\n",
       " 'El Tajín National Airport',\n",
       " 'Mozambique',\n",
       " 'Osijek Airport',\n",
       " 'Araçatuba Airport',\n",
       " 'Rapid City Regional Airport',\n",
       " 'Omsk Central Airport',\n",
       " 'Montréal / Saint-Hubert Airport',\n",
       " 'Bayannur Tianjitai Airport',\n",
       " 'Leros Airport',\n",
       " 'Kamloops Airport',\n",
       " 'Nauru International Airport',\n",
       " 'St George Airport',\n",
       " 'Massena International Richards Field',\n",
       " 'Vernal Regional Airport',\n",
       " 'Kursk East Airport',\n",
       " 'Nîmes-Arles-Camargue Airport',\n",
       " 'Norfolk Island International Airport',\n",
       " 'Dryden Regional Airport',\n",
       " 'Montpellier-Méditerranée Airport',\n",
       " 'Kamembe Airport',\n",
       " 'Kalibo International Airport',\n",
       " 'Xuzhou Guanyin Airport',\n",
       " 'Gazipaşa Airport',\n",
       " 'Kapuskasing Airport',\n",
       " 'Alta Airport',\n",
       " 'Buenos Aires, Ministro Pistarini International Airport',\n",
       " 'Norwich International Airport',\n",
       " 'Eilat Airport',\n",
       " 'Vitebsk East Airport',\n",
       " 'Uzhhorod International Airport',\n",
       " 'Sapporo, New Chitose Airport',\n",
       " 'General Manuel Carlos Piar International Airport',\n",
       " 'Providence, Theodore Francis Green State Airport',\n",
       " 'Atlantic City International Airport',\n",
       " 'Aalborg Airport',\n",
       " 'Tawau Airport',\n",
       " 'Klamath Falls Airport',\n",
       " 'Namangan Airport',\n",
       " 'Lourdes de Blanc Sablon Airport',\n",
       " 'Central Nebraska Regional Airport',\n",
       " 'Kulob Airport',\n",
       " 'Kangiqsujuaq (Wakeham Bay) Airport',\n",
       " 'Mtwara Airport',\n",
       " 'Rabil Airport',\n",
       " 'Nis Constantine the Great Airport',\n",
       " 'Querétaro Intercontinental Airport',\n",
       " 'Rach Gia Airport',\n",
       " 'Vanguardia Airport',\n",
       " 'Manley Hot Springs Airport',\n",
       " 'Sanya Phoenix International Airport',\n",
       " 'Friedrichshafen Airport',\n",
       " 'Don Miguel Hidalgo Y Costilla International Airport',\n",
       " 'Aerotortuguero Airport',\n",
       " 'Norman Y. Mineta San Jose International Airport',\n",
       " 'Jamnagar Airport',\n",
       " 'Hilton Head Airport',\n",
       " 'Congo',\n",
       " 'Tuvalu',\n",
       " 'Aurillac Airport',\n",
       " 'Fort Chipewyan Airport',\n",
       " 'Pdte. Carlos Ibañez del Campo Airport',\n",
       " 'Biskra Airport',\n",
       " 'Mallam Aminu International Airport',\n",
       " 'American Samoa',\n",
       " 'Colonel Hill Airport',\n",
       " 'Khovd Airport',\n",
       " 'Kiev Zhuliany International Airport',\n",
       " 'Antonio Roldan Betancourt Airport',\n",
       " 'Fukushima Airport',\n",
       " 'Walaha Airport',\n",
       " 'Watertown Regional Airport',\n",
       " 'Lajes Field',\n",
       " 'Barquisimeto International Airport',\n",
       " 'Miho Yonago Airport',\n",
       " 'Holy Cross Airport',\n",
       " 'Angoulême-Brie-Champniers Airport',\n",
       " \"Dillon's Bay Airport\",\n",
       " 'Melangguane Airport',\n",
       " 'Egypt',\n",
       " 'Mecheria Airport',\n",
       " 'City of Derry Airport',\n",
       " 'Vilhena Airport',\n",
       " 'Pampulha - Carlos Drummond de Andrade Airport',\n",
       " 'Visby Airport',\n",
       " 'Kandahar Airport',\n",
       " 'Bundaberg Airport',\n",
       " 'Havre City County Airport',\n",
       " 'Begishevo Airport',\n",
       " 'Goloson International Airport',\n",
       " 'Sayun International Airport',\n",
       " 'Capitan Oriel Lea Plaza Airport',\n",
       " 'Nosara Airport',\n",
       " 'Aruba',\n",
       " 'St George Municipal Airport',\n",
       " 'Lakeba Island Airport',\n",
       " 'Kalskag Airport',\n",
       " 'Liberia',\n",
       " 'St. Anthony Airport',\n",
       " 'Manchester Airport',\n",
       " 'Lafayette Regional Airport',\n",
       " 'Macau',\n",
       " 'St Augustin Airport',\n",
       " 'Batumi International Airport',\n",
       " 'Anguilla',\n",
       " 'Port Vila Bauerfield Airport',\n",
       " 'Ndola Airport',\n",
       " 'Hugo Cantergiani Regional Airport',\n",
       " 'Oranjemund Airport',\n",
       " 'Nigeria',\n",
       " 'Asahikawa Airport',\n",
       " 'Hat Yai International Airport',\n",
       " 'Ciudad del Carmen International Airport',\n",
       " 'Shennongjia Hongping Airport',\n",
       " 'Abbotsford Airport',\n",
       " 'Bert Mooney Airport',\n",
       " 'Qatar',\n",
       " 'Mercedita Airport',\n",
       " 'Syrian Arab Republic',\n",
       " 'Tekirdağ Çorlu Airport',\n",
       " 'Umeå Airport',\n",
       " 'Norfolk Island',\n",
       " 'Kivalina Airport',\n",
       " 'High Level Airport',\n",
       " 'Bathurst Airport',\n",
       " 'Meadows Field',\n",
       " 'Mo i Rana Airport, Røssvoll',\n",
       " 'Khrabrovo Airport',\n",
       " 'Tête-à-la-Baleine Airport',\n",
       " 'Solovki Airport',\n",
       " 'Fergana International Airport',\n",
       " 'Kufra Airport',\n",
       " 'Shanghai - Pudong International Airport',\n",
       " 'Mbeya Airport',\n",
       " 'Preguiça Airport',\n",
       " 'Dandong Airport',\n",
       " 'Rubem Berta Airport',\n",
       " 'Ithaca Tompkins Regional Airport',\n",
       " 'Southampton Airport',\n",
       " 'Roswell International Air Center Airport',\n",
       " 'Karlovy Vary International Airport',\n",
       " 'Annaba Airport',\n",
       " 'Trieste–Friuli Venezia Giulia Airport',\n",
       " 'Muhammad Salahuddin Airport',\n",
       " 'Madagascar',\n",
       " 'General Mariano Escobedo International Airport',\n",
       " 'Doha, Hamad International Airport',\n",
       " 'Rigolet Airport',\n",
       " 'Simao Airport',\n",
       " 'Suavanao Airport',\n",
       " 'Grenoble Alpes-Isère Airport',\n",
       " 'Foshan Shadi Airport',\n",
       " 'Kumejima Airport',\n",
       " 'Sunyani Airport',\n",
       " 'Myeik Airport',\n",
       " 'Araracuara Airport',\n",
       " 'Uyuni Airport',\n",
       " 'Grenada',\n",
       " 'Bario Airport',\n",
       " 'Lianyungang Airport',\n",
       " 'Islas Malvinas Airport',\n",
       " 'Fort Smith Regional Airport',\n",
       " 'Sept-Îles Airport',\n",
       " 'Luxembourg',\n",
       " 'Livingstone Airport',\n",
       " 'Olgii Mongolei Airport',\n",
       " 'Ruby Airport',\n",
       " 'Thompson Airport',\n",
       " 'Ogden Hinckley Airport',\n",
       " 'Tambolaka Airport',\n",
       " 'Luang Phabang International Airport',\n",
       " 'Guararapes - Gilberto Freyre International Airport',\n",
       " 'Tonga',\n",
       " 'Missoula International Airport',\n",
       " 'Kemerovo Airport',\n",
       " 'McGrath Airport',\n",
       " 'South Caicos Airport',\n",
       " 'Riverton Regional Airport',\n",
       " 'Charles M. Schulz Sonoma County Airport',\n",
       " 'Cerro Moreno Airport',\n",
       " 'Learmonth Airport',\n",
       " 'Benin',\n",
       " 'Altay Air Base',\n",
       " 'Heringsdorf Airport',\n",
       " 'Gabès Matmata International Airport',\n",
       " 'Takapoto Airport',\n",
       " 'Imperial County Airport',\n",
       " 'Quepos Managua Airport',\n",
       " 'Imam Khomeini International Airport',\n",
       " 'Bacolod-Silay City International Airport',\n",
       " 'Sultan Aji Muhamad Sulaiman Airport',\n",
       " 'Naypyidaw Airport',\n",
       " 'Mbandaka Airport',\n",
       " 'Reykjavik Airport',\n",
       " 'Westerland Sylt Airport',\n",
       " 'Pickle Lake Airport',\n",
       " 'Savoonga Airport',\n",
       " 'Barbados',\n",
       " 'Venustiano Carranza International Airport',\n",
       " 'Richmond International Airport',\n",
       " 'Juan Mendoza Airport',\n",
       " 'Pisa International Airport',\n",
       " 'North America',\n",
       " 'Polyarny Airport',\n",
       " 'Sri Guru Ram Dass Jee International Airport',\n",
       " 'K. D. Matanzima Airport',\n",
       " 'Julius Nyerere International Airport',\n",
       " 'Yacuiba Airport',\n",
       " \"Perugia San Francesco d'Assisi – Umbria International Airport\",\n",
       " 'Bob Baker Memorial Airport',\n",
       " 'Asheville Regional Airport',\n",
       " 'Ciudad Obregón International Airport',\n",
       " 'Normanton Airport',\n",
       " 'Palmar Sur Airport',\n",
       " 'Dr. Babasaheb Ambedkar International Airport',\n",
       " 'Gamal Abdel Nasser Airport',\n",
       " 'Mocopulli Airport',\n",
       " 'Mundo Maya International Airport',\n",
       " 'Lonorore Airport',\n",
       " 'Tivat Airport',\n",
       " 'Shetland Islands, Fair Isle Airport',\n",
       " 'Östersund Airport',\n",
       " 'In Salah Airport',\n",
       " 'Yining Airport',\n",
       " 'Graz Airport',\n",
       " 'Narvik Framnes Airport',\n",
       " 'General Rodolfo Sánchez Taboada International Airport',\n",
       " 'Fort Simpson Airport',\n",
       " 'Shonai Airport',\n",
       " 'Faro Airport',\n",
       " 'Belgrade Nikola Tesla Airport',\n",
       " 'Gwadar International Airport',\n",
       " 'Jimma Airport',\n",
       " 'Ordu Giresun Airport',\n",
       " 'El Loa Airport',\n",
       " 'Zona da Mata Regional Airport',\n",
       " 'Belgium',\n",
       " 'Buluh Tumbang (H A S Hanandjoeddin) Airport',\n",
       " 'Guinea-Bissau',\n",
       " 'Lamezia Terme Airport',\n",
       " 'Ulsan Airport',\n",
       " 'Diori Hamani International Airport',\n",
       " 'Tautii Magheraus Airport',\n",
       " 'Nejran Airport',\n",
       " 'Tuntutuliak Airport',\n",
       " 'Baker Lake Airport',\n",
       " 'Kangerlussuaq Airport',\n",
       " 'Tallinn Airport',\n",
       " 'Smithers Airport',\n",
       " 'Chokurdakh Airport',\n",
       " 'San Javier Airport',\n",
       " 'Cataratas Del Iguazú International Airport',\n",
       " 'Nanchong Airport',\n",
       " 'Ua Pou Airport',\n",
       " 'Velikiy Ustyug Airport',\n",
       " 'Palenque International Airport',\n",
       " 'Røst Airport',\n",
       " 'Dominican Republic',\n",
       " 'Bou Chekif Airport',\n",
       " 'Palma De Mallorca Airport',\n",
       " 'Vilankulo Airport',\n",
       " \"Xi'an Xianyang International Airport\",\n",
       " 'Spriggs Payne Airport',\n",
       " 'Shaikh Zaid Airport',\n",
       " 'Ancona Falconara Airport',\n",
       " 'Barra Airport',\n",
       " 'Central Illinois Regional Airport at Bloomington-Normal',\n",
       " 'Decatur Airport',\n",
       " 'Circle City /New/ Airport',\n",
       " 'Libya',\n",
       " 'Chacalluta Airport',\n",
       " 'Bodø Airport',\n",
       " 'Nemiscau Airport',\n",
       " 'Arctic Village Airport',\n",
       " 'Turkey',\n",
       " 'Chinchilla Airport',\n",
       " 'Skardu Airport',\n",
       " 'Luang Namtha Airport',\n",
       " 'Cleveland, Hopkins International Airport',\n",
       " 'Marseille Provence Airport',\n",
       " \"Shenzhen Bao'an International Airport\",\n",
       " 'Kipnuk Airport',\n",
       " 'Dodge City Regional Airport',\n",
       " 'Bolshoye Savino Airport',\n",
       " 'Wilmington International Airport',\n",
       " 'Rick Husband Amarillo International Airport',\n",
       " 'Hanzhong Airport',\n",
       " 'Handan Airport',\n",
       " 'Sunan Shuofang International Airport',\n",
       " 'Madurai Airport',\n",
       " 'Cologne Bonn Airport',\n",
       " 'Lal Bahadur Shastri Airport',\n",
       " 'Vilhelmina Airport',\n",
       " 'Bamaga Injinoo Airport',\n",
       " 'Whale Cove Airport',\n",
       " 'Odessa International Airport',\n",
       " 'Amami Airport',\n",
       " 'Red Deer Regional Airport',\n",
       " 'Barcelona International Airport',\n",
       " 'Jinzhou Airport',\n",
       " 'Priština International Airport',\n",
       " 'Aden Adde International Airport',\n",
       " 'Pocatello Regional Airport',\n",
       " 'Hierro Airport',\n",
       " 'Chippewa County International Airport',\n",
       " 'Pitcairn',\n",
       " 'Sadiq Abubakar III International Airport',\n",
       " 'Jolo Airport',\n",
       " 'John Murtha Johnstown Cambria County Airport',\n",
       " 'Finland',\n",
       " 'Takotna Airport',\n",
       " 'Rafael Hernandez Airport',\n",
       " 'Mexico City, Licenciado Benito Juarez International Airport',\n",
       " 'Birjand Airport',\n",
       " 'Yancheng Airport',\n",
       " 'Kasos Airport',\n",
       " 'Rabat-Salé Airport',\n",
       " 'Indianapolis International Airport',\n",
       " 'Comoros',\n",
       " 'Johan Adolf Pengel International Airport',\n",
       " 'Hay River / Merlyn Carter Airport',\n",
       " 'Fort Frances Municipal Airport',\n",
       " 'Nanyang Airport',\n",
       " 'Biju Patnaik Airport',\n",
       " 'Linate Airport',\n",
       " 'Sao Paulo, Guarulhos - Governador Andras Franco Montoro International Airport',\n",
       " 'La Chinita International Airport',\n",
       " \"N'Djamena International Airport\",\n",
       " 'Wenshan Puzhehei Airport',\n",
       " 'Pormpuraaw Airport',\n",
       " 'Karluk Airport',\n",
       " 'Xoxocotlán International Airport',\n",
       " 'Zhuhai Airport',\n",
       " 'Timor-Leste',\n",
       " 'Parkes Airport',\n",
       " 'Guangyuan Airport',\n",
       " 'Coffs Harbour Airport',\n",
       " 'Cibao International Airport',\n",
       " \"Hassi R'Mel Airport\",\n",
       " 'Southwest Oregon Regional Airport',\n",
       " 'Tokyo Narita',\n",
       " 'Santander Airport',\n",
       " 'Dibrugarh Airport',\n",
       " 'Fort Albany Airport',\n",
       " 'Aarhus Airport',\n",
       " 'Pierre Regional Airport',\n",
       " 'Winton Airport',\n",
       " 'Joplin Regional Airport',\n",
       " 'Curacao',\n",
       " 'Brussels Airport',\n",
       " 'Narrandera Airport',\n",
       " 'Ørsta-Volda Airport, Hovden',\n",
       " 'Vagar Airport',\n",
       " 'Qaarsut Airport',\n",
       " 'Antonio B. Won Pat International Airport',\n",
       " 'Las Termas Airport',\n",
       " 'Palonegro Airport',\n",
       " 'Agra Airport',\n",
       " 'Hana Airport',\n",
       " 'Anglesey Airport',\n",
       " 'Hao Airport',\n",
       " ...]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().has('runways', P.neq(4)).count().next()\n",
    "g.V().has('runways', P.neq(4)).values('desc').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## not()\n",
    "__Can also achieve the same thing__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().not_(__.values('runways').is_(4)).count().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## and()\n",
    "__To add another condition__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'runways': [1], 'code': ['VRN']},\n",
       " {'runways': [1], 'code': ['PIX']},\n",
       " {'runways': [2], 'code': ['GGG']},\n",
       " {'runways': [2], 'code': ['GSE']},\n",
       " {'runways': [2], 'code': ['TBS']},\n",
       " {'runways': [1], 'code': ['RAR']},\n",
       " {'code': ['BT']},\n",
       " {'runways': [1], 'code': ['IXU']},\n",
       " {'runways': [1], 'code': ['LPK']},\n",
       " {'runways': [2], 'code': ['VKO']},\n",
       " {'runways': [1], 'code': ['ORV']},\n",
       " {'runways': [1], 'code': ['LWN']},\n",
       " {'runways': [1], 'code': ['AKU']},\n",
       " {'runways': [1], 'code': ['LIM']},\n",
       " {'runways': [1], 'code': ['TVY']},\n",
       " {'runways': [1], 'code': ['LXR']},\n",
       " {'runways': [1], 'code': ['UNN']},\n",
       " {'runways': [2], 'code': ['HMO']},\n",
       " {'runways': [1], 'code': ['RSD']},\n",
       " {'runways': [1], 'code': ['KVA']},\n",
       " {'runways': [1], 'code': ['MDZ']},\n",
       " {'runways': [1], 'code': ['RFP']},\n",
       " {'runways': [2], 'code': ['OWB']},\n",
       " {'runways': [1], 'code': ['LKG']},\n",
       " {'runways': [1], 'code': ['JSR']},\n",
       " {'runways': [2], 'code': ['SOW']},\n",
       " {'code': ['MR']},\n",
       " {'code': ['KR']},\n",
       " {'runways': [1], 'code': ['PLS']},\n",
       " {'runways': [1], 'code': ['DUD']},\n",
       " {'runways': [1], 'code': ['BJB']},\n",
       " {'code': ['BA']},\n",
       " {'runways': [1], 'code': ['MEA']},\n",
       " {'runways': [2], 'code': ['WAW']},\n",
       " {'runways': [1], 'code': ['GZO']},\n",
       " {'runways': [1], 'code': ['ASU']},\n",
       " {'runways': [1], 'code': ['AGA']},\n",
       " {'code': ['SA']},\n",
       " {'runways': [1], 'code': ['KGF']},\n",
       " {'runways': [1], 'code': ['AVA']},\n",
       " {'runways': [1], 'code': ['JER']},\n",
       " {'runways': [2], 'code': ['SVO']},\n",
       " {'runways': [1], 'code': ['ZYI']},\n",
       " {'runways': [1], 'code': ['NGQ']},\n",
       " {'runways': [2], 'code': ['SBP']},\n",
       " {'runways': [1], 'code': ['MOI']},\n",
       " {'runways': [1], 'code': ['VIJ']},\n",
       " {'runways': [2], 'code': ['CZM']},\n",
       " {'runways': [1], 'code': ['MJD']},\n",
       " {'runways': [2], 'code': ['FMN']},\n",
       " {'runways': [1], 'code': ['CEG']},\n",
       " {'runways': [1], 'code': ['DGA']},\n",
       " {'runways': [2], 'code': ['KSD']},\n",
       " {'runways': [2], 'code': ['ABY']},\n",
       " {'runways': [1], 'code': ['ASW']},\n",
       " {'runways': [1], 'code': ['CUK']},\n",
       " {'runways': [2], 'code': ['MUC']},\n",
       " {'runways': [1], 'code': ['VDZ']},\n",
       " {'runways': [2], 'code': ['PMO']},\n",
       " {'runways': [1], 'code': ['MGH']},\n",
       " {'runways': [1], 'code': ['YBL']},\n",
       " {'runways': [1], 'code': ['RNB']},\n",
       " {'runways': [2], 'code': ['LIL']},\n",
       " {'runways': [1], 'code': ['MKP']},\n",
       " {'runways': [1], 'code': ['IMF']},\n",
       " {'runways': [1], 'code': ['LNJ']},\n",
       " {'runways': [1], 'code': ['RAK']},\n",
       " {'runways': [1], 'code': ['DIN']},\n",
       " {'runways': [2], 'code': ['ERI']},\n",
       " {'runways': [1], 'code': ['GXH']},\n",
       " {'runways': [1], 'code': ['OLC']},\n",
       " {'code': ['GA']},\n",
       " {'runways': [2], 'code': ['HTA']},\n",
       " {'runways': [1], 'code': ['BJX']},\n",
       " {'runways': [2], 'code': ['MSY']},\n",
       " {'runways': [1], 'code': ['VLV']},\n",
       " {'runways': [2], 'code': ['GCC']},\n",
       " {'runways': [1], 'code': ['BRQ']},\n",
       " {'runways': [2], 'code': ['SGF']},\n",
       " {'runways': [2], 'code': ['AER']},\n",
       " {'runways': [1], 'code': ['ASI']},\n",
       " {'runways': [1], 'code': ['DAX']},\n",
       " {'runways': [1], 'code': ['AXK']},\n",
       " {'runways': [1], 'code': ['JPR']},\n",
       " {'runways': [2], 'code': ['PAH']},\n",
       " {'runways': [1], 'code': ['REL']},\n",
       " {'code': ['AU']},\n",
       " {'runways': [1], 'code': ['YTE']},\n",
       " {'runways': [1], 'code': ['MOU']},\n",
       " {'runways': [1], 'code': ['HZH']},\n",
       " {'runways': [1], 'code': ['LTO']},\n",
       " {'runways': [1], 'code': ['VAI']},\n",
       " {'runways': [2], 'code': ['KAT']},\n",
       " {'code': ['AM']},\n",
       " {'runways': [2], 'code': ['GNV']},\n",
       " {'runways': [1], 'code': ['YZS']},\n",
       " {'runways': [1], 'code': ['LFW']},\n",
       " {'runways': [2], 'code': ['ADD']},\n",
       " {'runways': [1], 'code': ['MAS']},\n",
       " {'runways': [1], 'code': ['CAC']},\n",
       " {'runways': [2], 'code': ['MKY']},\n",
       " {'runways': [1], 'code': ['VPE']},\n",
       " {'runways': [1], 'code': ['PDS']},\n",
       " {'code': ['WF']},\n",
       " {'runways': [2], 'code': ['TEE']},\n",
       " {'code': ['CU']},\n",
       " {'runways': [2], 'code': ['YSM']},\n",
       " {'code': ['VG']},\n",
       " {'runways': [1], 'code': ['HBX']},\n",
       " {'runways': [1], 'code': ['RDP']},\n",
       " {'runways': [1], 'code': ['SVJ']},\n",
       " {'runways': [1], 'code': ['TXN']},\n",
       " {'runways': [1], 'code': ['ZHA']},\n",
       " {'runways': [1], 'code': ['TUB']},\n",
       " {'runways': [1], 'code': ['TKU']},\n",
       " {'runways': [1], 'code': ['BTC']},\n",
       " {'runways': [2], 'code': ['REG']},\n",
       " {'runways': [2], 'code': ['TLN']},\n",
       " {'runways': [1], 'code': ['MJN']},\n",
       " {'runways': [1], 'code': ['BNX']},\n",
       " {'runways': [1], 'code': ['PIP']},\n",
       " {'code': ['YE']},\n",
       " {'runways': [1], 'code': ['PND']},\n",
       " {'code': ['NO']},\n",
       " {'runways': [1], 'code': ['UTP']},\n",
       " {'runways': [2], 'code': ['RZE']},\n",
       " {'runways': [2], 'code': ['YSB']},\n",
       " {'runways': [1], 'code': ['KOZ']},\n",
       " {'runways': [1], 'code': ['CWC']},\n",
       " {'runways': [1], 'code': ['EAE']},\n",
       " {'runways': [1], 'code': ['DAT']},\n",
       " {'runways': [1], 'code': ['MTT']},\n",
       " {'runways': [1], 'code': ['TCZ']},\n",
       " {'runways': [1], 'code': ['CYB']},\n",
       " {'runways': [1], 'code': ['IPC']},\n",
       " {'runways': [1], 'code': ['OAL']},\n",
       " {'runways': [1], 'code': ['PVK']},\n",
       " {'runways': [1], 'code': ['GRJ']},\n",
       " {'runways': [1], 'code': ['LPP']},\n",
       " {'runways': [1], 'code': ['PMW']},\n",
       " {'runways': [1], 'code': ['SJL']},\n",
       " {'runways': [1], 'code': ['KVG']},\n",
       " {'runways': [2], 'code': ['ACA']},\n",
       " {'runways': [1], 'code': ['DHM']},\n",
       " {'runways': [2], 'code': ['BLV']},\n",
       " {'runways': [1], 'code': ['RES']},\n",
       " {'runways': [1], 'code': ['FNA']},\n",
       " {'runways': [1], 'code': ['BQB']},\n",
       " {'runways': [2], 'code': ['BGY']},\n",
       " {'runways': [1], 'code': ['KHD']},\n",
       " {'runways': [2], 'code': ['MLG']},\n",
       " {'runways': [1], 'code': ['YGL']},\n",
       " {'runways': [1], 'code': ['AUX']},\n",
       " {'runways': [1], 'code': ['TPQ']},\n",
       " {'runways': [1], 'code': ['TAL']},\n",
       " {'runways': [1], 'code': ['TFS']},\n",
       " {'runways': [2], 'code': ['VPS']},\n",
       " {'runways': [2], 'code': ['UPG']},\n",
       " {'runways': [2], 'code': ['SDJ']},\n",
       " {'runways': [1], 'code': ['MXX']},\n",
       " {'runways': [1], 'code': ['BWK']},\n",
       " {'runways': [1], 'code': ['DIE']},\n",
       " {'runways': [1], 'code': ['GEV']},\n",
       " {'runways': [1], 'code': ['YKG']},\n",
       " {'runways': [1], 'code': ['ADA']},\n",
       " {'code': ['PE']},\n",
       " {'runways': [1], 'code': ['NST']},\n",
       " {'runways': [2], 'code': ['TBU']},\n",
       " {'runways': [1], 'code': ['LYB']},\n",
       " {'code': ['GU']},\n",
       " {'runways': [2], 'code': ['EGN']},\n",
       " {'runways': [1], 'code': ['VRA']},\n",
       " {'runways': [2], 'code': ['PQQ']},\n",
       " {'runways': [1], 'code': ['COD']},\n",
       " {'runways': [2], 'code': ['LNS']},\n",
       " {'runways': [1], 'code': ['ZVK']},\n",
       " {'runways': [1], 'code': ['HNY']},\n",
       " {'runways': [1], 'code': ['SSR']},\n",
       " {'runways': [1], 'code': ['SPN']},\n",
       " {'runways': [2], 'code': ['ITO']},\n",
       " {'runways': [1], 'code': ['CAY']},\n",
       " {'code': ['VI']},\n",
       " {'runways': [1], 'code': ['BWN']},\n",
       " {'code': ['RW']},\n",
       " {'runways': [1], 'code': ['JNG']},\n",
       " {'runways': [1], 'code': ['RVV']},\n",
       " {'runways': [1], 'code': ['LUW']},\n",
       " {'runways': [1], 'code': ['UAK']},\n",
       " {'runways': [1], 'code': ['SIT']},\n",
       " {'runways': [1], 'code': ['RAB']},\n",
       " {'runways': [1], 'code': ['PLM']},\n",
       " {'runways': [1], 'code': ['MEH']},\n",
       " {'runways': [1], 'code': ['MUN']},\n",
       " {'runways': [2], 'code': ['CRW']},\n",
       " {'runways': [2], 'code': ['HAM']},\n",
       " {'runways': [2], 'code': ['HSV']},\n",
       " {'runways': [1], 'code': ['GOT']},\n",
       " {'runways': [1], 'code': ['RSA']},\n",
       " {'runways': [1], 'code': ['LPF']},\n",
       " {'runways': [1], 'code': ['JYV']},\n",
       " {'runways': [1], 'code': ['MKM']},\n",
       " {'runways': [1], 'code': ['SJP']},\n",
       " {'code': ['CH']},\n",
       " {'runways': [1], 'code': ['RUR']},\n",
       " {'runways': [2], 'code': ['AGP']},\n",
       " {'runways': [1], 'code': ['SJZ']},\n",
       " {'runways': [1], 'code': ['CUE']},\n",
       " {'runways': [2], 'code': ['GZT']},\n",
       " {'runways': [1], 'code': ['SDL']},\n",
       " {'runways': [2], 'code': ['CGK']},\n",
       " {'code': ['TH']},\n",
       " {'runways': [1], 'code': ['BTU']},\n",
       " {'runways': [2], 'code': ['EGO']},\n",
       " {'code': ['NZ']},\n",
       " {'runways': [1], 'code': ['BRW']},\n",
       " {'runways': [1], 'code': ['MQX']},\n",
       " {'code': ['MX']},\n",
       " {'runways': [1], 'code': ['SRP']},\n",
       " {'runways': [1], 'code': ['BLL']},\n",
       " {'runways': [1], 'code': ['BIA']},\n",
       " {'runways': [1], 'code': ['KVD']},\n",
       " {'runways': [1], 'code': ['KCA']},\n",
       " {'runways': [1], 'code': ['BZR']},\n",
       " {'runways': [1], 'code': ['MQM']},\n",
       " {'runways': [2], 'code': ['RVT']},\n",
       " {'runways': [2], 'code': ['YXU']},\n",
       " {'runways': [1], 'code': ['KID']},\n",
       " {'code': ['ML']},\n",
       " {'runways': [1], 'code': ['GAF']},\n",
       " {'runways': [1], 'code': ['ROP']},\n",
       " {'code': ['HN']},\n",
       " {'runways': [1], 'code': ['ZNZ']},\n",
       " {'runways': [1], 'code': ['RVN']},\n",
       " {'runways': [1], 'code': ['HOF']},\n",
       " {'runways': [2], 'code': ['TOL']},\n",
       " {'runways': [1], 'code': ['PAC']},\n",
       " {'runways': [1], 'code': ['TLT']},\n",
       " {'runways': [1], 'code': ['ROB']},\n",
       " {'runways': [1], 'code': ['VXE']},\n",
       " {'runways': [2], 'code': ['POL']},\n",
       " {'runways': [2], 'code': ['LIH']},\n",
       " {'runways': [2], 'code': ['MXP']},\n",
       " {'runways': [2], 'code': ['YZF']},\n",
       " {'runways': [1], 'code': ['LLK']},\n",
       " {'code': ['EE']},\n",
       " {'runways': [2], 'code': ['BRL']},\n",
       " {'code': ['CO']},\n",
       " {'runways': [1], 'code': ['TTE']},\n",
       " {'runways': [1], 'code': ['PEN']},\n",
       " {'runways': [1], 'code': ['KKJ']},\n",
       " {'runways': [2], 'code': ['JOE']},\n",
       " {'runways': [2], 'code': ['RCH']},\n",
       " {'runways': [5], 'code': ['PPQ']},\n",
       " {'runways': [1], 'code': ['PGU']},\n",
       " {'runways': [1], 'code': ['BAQ']},\n",
       " {'runways': [1], 'code': ['KIT']},\n",
       " {'runways': [1], 'code': ['YHK']},\n",
       " {'code': ['AF']},\n",
       " {'runways': [5], 'code': ['TRG']},\n",
       " {'runways': [1], 'code': ['NHV']},\n",
       " {'runways': [1], 'code': ['ZLT']},\n",
       " {'runways': [2], 'code': ['BEL']},\n",
       " {'runways': [1], 'code': ['IAR']},\n",
       " {'runways': [1], 'code': ['ONJ']},\n",
       " {'runways': [1], 'code': ['SLY']},\n",
       " {'runways': [1], 'code': ['VDH']},\n",
       " {'runways': [1], 'code': ['FJR']},\n",
       " {'runways': [1], 'code': ['GEL']},\n",
       " {'runways': [1], 'code': ['BHR']},\n",
       " {'runways': [1], 'code': ['BBL']},\n",
       " {'runways': [1], 'code': ['TSF']},\n",
       " {'runways': [2], 'code': ['UET']},\n",
       " {'runways': [1], 'code': ['KWL']},\n",
       " {'runways': [1], 'code': ['ILO']},\n",
       " {'runways': [1], 'code': ['BGF']},\n",
       " {'runways': [1], 'code': ['MMK']},\n",
       " {'runways': [1], 'code': ['ACE']},\n",
       " {'runways': [1], 'code': ['JUB']},\n",
       " {'runways': [1], 'code': ['OMO']},\n",
       " {'runways': [1], 'code': ['HGH']},\n",
       " {'runways': [1], 'code': ['EVE']},\n",
       " {'code': ['AR']},\n",
       " {'runways': [1], 'code': ['BNN']},\n",
       " {'runways': [2], 'code': ['PKB']},\n",
       " {'runways': [1], 'code': ['BKO']},\n",
       " {'runways': [6], 'code': ['DEN']},\n",
       " {'runways': [1], 'code': ['BJR']},\n",
       " {'runways': [1], 'code': ['KNH']},\n",
       " {'runways': [1], 'code': ['MXH']},\n",
       " {'runways': [1], 'code': ['YPR']},\n",
       " {'runways': [1], 'code': ['TET']},\n",
       " {'runways': [2], 'code': ['PPG']},\n",
       " {'runways': [1], 'code': ['JUZ']},\n",
       " {'runways': [5], 'code': ['YYZ']},\n",
       " {'runways': [1], 'code': ['TZX']},\n",
       " {'runways': [1], 'code': ['TNC']},\n",
       " {'runways': [1], 'code': ['RGN']},\n",
       " {'runways': [2], 'code': ['LUD']},\n",
       " {'runways': [1], 'code': ['UIB']},\n",
       " {'runways': [1], 'code': ['OGL']},\n",
       " {'runways': [2], 'code': ['CLJ']},\n",
       " {'runways': [1], 'code': ['SOG']},\n",
       " {'runways': [1], 'code': ['KOT']},\n",
       " {'runways': [1], 'code': ['TIM']},\n",
       " {'code': ['CC']},\n",
       " {'runways': [1], 'code': ['LHW']},\n",
       " {'runways': [1], 'code': ['CXI']},\n",
       " {'runways': [1], 'code': ['KDI']},\n",
       " {'runways': [1], 'code': ['MFM']},\n",
       " {'code': ['JE']},\n",
       " {'runways': [1], 'code': ['IPA']},\n",
       " {'runways': [2], 'code': ['CGH']},\n",
       " {'runways': [2], 'code': ['PMV']},\n",
       " {'runways': [1], 'code': ['OSS']},\n",
       " {'runways': [1], 'code': ['PZI']},\n",
       " {'runways': [5], 'code': ['HLZ']},\n",
       " {'runways': [1], 'code': ['OIM']},\n",
       " {'runways': [2], 'code': ['DHN']},\n",
       " {'runways': [1], 'code': ['AYQ']},\n",
       " {'runways': [1], 'code': ['CPV']},\n",
       " {'code': ['MC']},\n",
       " {'runways': [1], 'code': ['MGF']},\n",
       " {'runways': [1], 'code': ['AJF']},\n",
       " {'runways': [1], 'code': ['RCM']},\n",
       " {'runways': [2], 'code': ['GEO']},\n",
       " {'runways': [1], 'code': ['BAL']},\n",
       " {'code': ['GG']},\n",
       " {'runways': [2], 'code': ['MID']},\n",
       " {'runways': [1], 'code': ['ZAL']},\n",
       " {'runways': [1], 'code': ['SFG']},\n",
       " {'runways': [1], 'code': ['ESU']},\n",
       " {'runways': [1], 'code': ['GDE']},\n",
       " {'runways': [1], 'code': ['XFN']},\n",
       " {'runways': [2], 'code': ['BRE']},\n",
       " {'runways': [1], 'code': ['SJE']},\n",
       " {'runways': [1], 'code': ['KVK']},\n",
       " {'runways': [2], 'code': ['EBB']},\n",
       " {'runways': [2], 'code': ['PRG']},\n",
       " {'runways': [1], 'code': ['TLM']},\n",
       " {'runways': [1], 'code': ['PPB']},\n",
       " {'runways': [1], 'code': ['MDL']},\n",
       " {'runways': [1], 'code': ['IXG']},\n",
       " {'code': ['GP']},\n",
       " {'runways': [2], 'code': ['GMP']},\n",
       " {'runways': [1], 'code': ['VCL']},\n",
       " {'runways': [2], 'code': ['BZO']},\n",
       " {'runways': [1], 'code': ['DLA']},\n",
       " {'runways': [1], 'code': ['KCH']},\n",
       " {'runways': [1], 'code': ['KBU']},\n",
       " {'runways': [1], 'code': ['ZTH']},\n",
       " {'runways': [1], 'code': ['HNH']},\n",
       " {'runways': [1], 'code': ['BAZ']},\n",
       " {'runways': [1], 'code': ['YKU']},\n",
       " {'runways': [1], 'code': ['NUE']},\n",
       " {'runways': [1], 'code': ['GND']},\n",
       " {'runways': [1], 'code': ['NQY']},\n",
       " {'runways': [1], 'code': ['MEU']},\n",
       " {'runways': [1], 'code': ['WEF']},\n",
       " {'runways': [1], 'code': ['FRO']},\n",
       " {'runways': [1], 'code': ['UTH']},\n",
       " {'runways': [1], 'code': ['KAL']},\n",
       " {'runways': [1], 'code': ['FSC']},\n",
       " {'runways': [1], 'code': ['PFO']},\n",
       " {'runways': [1], 'code': ['RBR']},\n",
       " {'runways': [2], 'code': ['PGA']},\n",
       " {'runways': [1], 'code': ['GCM']},\n",
       " {'runways': [1], 'code': ['JIK']},\n",
       " {'runways': [1], 'code': ['AEY']},\n",
       " {'runways': [1], 'code': ['MMY']},\n",
       " {'runways': [1], 'code': ['LYC']},\n",
       " {'runways': [1], 'code': ['ERF']},\n",
       " {'runways': [2], 'code': ['LBE']},\n",
       " {'runways': [1], 'code': ['AUY']},\n",
       " {'runways': [2], 'code': ['TXK']},\n",
       " {'runways': [2], 'code': ['BUC']},\n",
       " {'runways': [1], 'code': ['XKH']},\n",
       " {'runways': [1], 'code': ['BOH']},\n",
       " {'code': ['SZ']},\n",
       " {'runways': [2], 'code': ['YQG']},\n",
       " {'runways': [1], 'code': ['ITB']},\n",
       " {'runways': [1], 'code': ['RHO']},\n",
       " {'runways': [1], 'code': ['TMM']},\n",
       " {'runways': [1], 'code': ['JTC']},\n",
       " {'runways': [1], 'code': ['WTB']},\n",
       " {'runways': [1], 'code': ['SRG']},\n",
       " {'runways': [1], 'code': ['KEP']},\n",
       " {'runways': [1], 'code': ['NOS']},\n",
       " {'runways': [1], 'code': ['PBD']},\n",
       " {'runways': [1], 'code': ['LYP']},\n",
       " {'runways': [1], 'code': ['WRO']},\n",
       " {'runways': [1], 'code': ['EAS']},\n",
       " {'runways': [1], 'code': ['XRY']},\n",
       " {'runways': [6], 'code': ['AMS']},\n",
       " {'runways': [2], 'code': ['GCK']},\n",
       " {'runways': [1], 'code': ['ETR']},\n",
       " {'code': ['GN']},\n",
       " {'runways': [2], 'code': ['YAK']},\n",
       " {'runways': [1], 'code': ['PKN']},\n",
       " {'runways': [1], 'code': ['VIG']},\n",
       " {'runways': [2], 'code': ['ESC']},\n",
       " {'runways': [5], 'code': ['SNN']},\n",
       " {'runways': [1], 'code': ['GDQ']},\n",
       " {'runways': [1], 'code': ['GCN']},\n",
       " {'runways': [1], 'code': ['LSY']},\n",
       " {'runways': [1], 'code': ['LOE']},\n",
       " {'runways': [1], 'code': ['ULH']},\n",
       " {'runways': [1], 'code': ['TGU']},\n",
       " {'runways': [2], 'code': ['OGG']},\n",
       " {'runways': [2], 'code': ['SYY']},\n",
       " {'runways': [2], 'code': ['MZL']},\n",
       " {'runways': [1], 'code': ['DRO']},\n",
       " {'runways': [2], 'code': ['FLS']},\n",
       " {'runways': [1], 'code': ['CLY']},\n",
       " {'runways': [1], 'code': ['JTY']},\n",
       " {'runways': [1], 'code': ['POI']},\n",
       " {'runways': [1], 'code': ['BUW']},\n",
       " {'runways': [1], 'code': ['DEA']},\n",
       " {'runways': [1], 'code': ['CMB']},\n",
       " {'runways': [1], 'code': ['TSE']},\n",
       " {'runways': [1], 'code': ['MLX']},\n",
       " {'runways': [2], 'code': ['WGA']},\n",
       " {'runways': [2], 'code': ['YXT']},\n",
       " {'code': ['MH']},\n",
       " {'runways': [1], 'code': ['LMN']},\n",
       " {'runways': [1], 'code': ['CHU']},\n",
       " {'runways': [1], 'code': ['COQ']},\n",
       " {'runways': [2], 'code': ['TJM']},\n",
       " {'runways': [1], 'code': ['PNP']},\n",
       " {'runways': [2], 'code': ['SHV']},\n",
       " {'runways': [1], 'code': ['MYG']},\n",
       " {'runways': [1], 'code': ['VAR']},\n",
       " {'runways': [1], 'code': ['ABJ']},\n",
       " {'runways': [1], 'code': ['HLD']},\n",
       " {'runways': [1], 'code': ['FOR']},\n",
       " {'runways': [2], 'code': ['KBP']},\n",
       " {'runways': [1], 'code': ['GIZ']},\n",
       " {'code': ['ZA']},\n",
       " {'runways': [1], 'code': ['RTA']},\n",
       " {'runways': [2], 'code': ['ELS']},\n",
       " {'runways': [2], 'code': ['DRW']},\n",
       " {'runways': [1], 'code': ['NUS']},\n",
       " {'runways': [1], 'code': ['YCY']},\n",
       " {'runways': [1], 'code': ['PBC']},\n",
       " {'runways': [2], 'code': ['APN']},\n",
       " {'runways': [2], 'code': ['EQS']},\n",
       " {'runways': [2], 'code': ['MYA']},\n",
       " {'runways': [1], 'code': ['PXM']},\n",
       " {'runways': [2], 'code': ['SCN']},\n",
       " {'runways': [1], 'code': ['SCC']},\n",
       " {'runways': [2], 'code': ['ZAD']},\n",
       " {'runways': [1], 'code': ['ZLO']},\n",
       " {'runways': [1], 'code': ['HDN']},\n",
       " {'runways': [1], 'code': ['YER']},\n",
       " {'code': ['BQ']},\n",
       " {'runways': [1], 'code': ['ABX']},\n",
       " {'code': ['MN']},\n",
       " {'runways': [1], 'code': ['MOO']},\n",
       " {'runways': [1], 'code': ['TBN']},\n",
       " {'runways': [1], 'code': ['DCM']},\n",
       " {'runways': [1], 'code': ['XBE']},\n",
       " {'runways': [1], 'code': ['LOP']},\n",
       " {'runways': [1], 'code': ['AUA']},\n",
       " {'runways': [1], 'code': ['NIB']},\n",
       " {'runways': [1], 'code': ['LLW']},\n",
       " {'runways': [1], 'code': ['OKA']},\n",
       " {'runways': [1], 'code': ['FSP']},\n",
       " {'runways': [1], 'code': ['WUA']},\n",
       " {'runways': [1], 'code': ['USK']},\n",
       " {'runways': [2], 'code': ['YKS']},\n",
       " {'runways': [1], 'code': ['DLE']},\n",
       " {'runways': [1], 'code': ['AMQ']},\n",
       " {'runways': [1], 'code': ['UYN']},\n",
       " {'runways': [1], 'code': ['TME']},\n",
       " {'runways': [2], 'code': ['MHG']},\n",
       " {'runways': [1], 'code': ['HLH']},\n",
       " {'runways': [1], 'code': ['OBO']},\n",
       " {'runways': [2], 'code': ['MTJ']},\n",
       " {'runways': [2], 'code': ['MAH']},\n",
       " {'runways': [2], 'code': ['CMX']},\n",
       " {'runways': [1], 'code': ['SGC']},\n",
       " {'runways': [2], 'code': ['SKG']},\n",
       " {'runways': [1], 'code': ['BDO']},\n",
       " {'code': ['ES']},\n",
       " {'runways': [1], 'code': ['MLO']},\n",
       " {'runways': [2], 'code': ['CTL']},\n",
       " {'runways': [1], 'code': ['PEW']},\n",
       " {'runways': [1], 'code': ['GMQ']},\n",
       " {'runways': [2], 'code': ['PIK']},\n",
       " {'runways': [2], 'code': ['RKS']},\n",
       " {'runways': [1], 'code': ['PIZ']},\n",
       " {'runways': [1], 'code': ['VHC']},\n",
       " {'runways': [1], 'code': ['HKB']},\n",
       " {'runways': [2], 'code': ['IXE']},\n",
       " {'runways': [2], 'code': ['HID']},\n",
       " {'runways': [1], 'code': ['RSW']},\n",
       " {'code': ['GL']},\n",
       " {'runways': [2], 'code': ['PWM']},\n",
       " {'code': ['KW']},\n",
       " {'runways': [2], 'code': ['LRT']},\n",
       " {'runways': [1], 'code': ['KSO']},\n",
       " {'runways': [1], 'code': ['ABB']},\n",
       " {'runways': [1], 'code': ['FKB']},\n",
       " {'runways': [2], 'code': ['TRO']},\n",
       " {'runways': [1], 'code': ['CYP']},\n",
       " {'runways': [1], 'code': ['GDZ']},\n",
       " {'runways': [1], 'code': ['GBE']},\n",
       " {'runways': [1], 'code': ['TEX']},\n",
       " {'runways': [1], 'code': ['LYA']},\n",
       " {'runways': [1], 'code': ['OUL']},\n",
       " {'runways': [1], 'code': ['DTM']},\n",
       " {'runways': [1], 'code': ['URC']},\n",
       " {'runways': [1], 'code': ['MXV']},\n",
       " {'runways': [1], 'code': ['CMF']},\n",
       " {'runways': [1], 'code': ['MIG']},\n",
       " {'runways': [1], 'code': ['AJL']},\n",
       " {'runways': [2], 'code': ['CFE']},\n",
       " {'runways': [1], 'code': ['MJT']},\n",
       " {'runways': [2], 'code': ['LYH']},\n",
       " {'runways': [1], 'code': ['KGG']},\n",
       " {'runways': [1], 'code': ['NOJ']},\n",
       " {'runways': [1], 'code': ['ZDY']},\n",
       " {'runways': [1], 'code': ['CUM']},\n",
       " {'runways': [1], 'code': ['KOJ']},\n",
       " {'runways': [1], 'code': ['YNA']},\n",
       " {'runways': [1], 'code': ['JSY']},\n",
       " {'runways': [2], 'code': ['JBR']},\n",
       " {'runways': [1], 'code': ['KHG']},\n",
       " {'runways': [1], 'code': ['MDC']},\n",
       " {'runways': [1], 'code': ['MZG']},\n",
       " {'runways': [1], 'code': ['PLQ']},\n",
       " {'runways': [2], 'code': ['YFC']},\n",
       " {'runways': [1], 'code': ['CFB']},\n",
       " {'runways': [1], 'code': ['PVR']},\n",
       " {'runways': [2], 'code': ['YGK']},\n",
       " {'runways': [2], 'code': ['BWT']},\n",
       " {'runways': [1], 'code': ['GPS']},\n",
       " {'runways': [1], 'code': ['QSF']},\n",
       " {'runways': [1], 'code': ['UNG']},\n",
       " {'runways': [1], 'code': ['TOF']},\n",
       " {'runways': [1], 'code': ['SDQ']},\n",
       " {'runways': [1], 'code': ['DND']},\n",
       " {'runways': [1], 'code': ['WUZ']},\n",
       " {'runways': [1], 'code': ['TYN']},\n",
       " {'runways': [2], 'code': ['DPS']},\n",
       " {'runways': [2], 'code': ['BKK']},\n",
       " {'runways': [1], 'code': ['USU']},\n",
       " {'runways': [1], 'code': ['KIN']},\n",
       " {'code': ['AG']},\n",
       " {'runways': [1], 'code': ['GSP']},\n",
       " {'code': ['SN']},\n",
       " {'runways': [2], 'code': ['TRI']},\n",
       " {'runways': [2], 'code': ['SGN']},\n",
       " {'runways': [2], 'code': ['JMS']},\n",
       " {'runways': [1], 'code': ['SHW']},\n",
       " {'runways': [1], 'code': ['KOS']},\n",
       " {'runways': [1], 'code': ['LDU']},\n",
       " {'runways': [1], 'code': ['VGA']},\n",
       " {'runways': [1], 'code': ['MIM']},\n",
       " {'runways': [2], 'code': ['GLA']},\n",
       " {'runways': [1], 'code': ['FLG']},\n",
       " {'runways': [2], 'code': ['SAL']},\n",
       " {'runways': [2], 'code': ['ACV']},\n",
       " {'runways': [1], 'code': ['YBP']},\n",
       " {'runways': [1], 'code': ['YUX']},\n",
       " {'runways': [1], 'code': ['BIQ']},\n",
       " {'runways': [1], 'code': ['CHQ']},\n",
       " {'runways': [1], 'code': ['AEP']},\n",
       " {'runways': [1], 'code': ['SVP']},\n",
       " {'runways': [1], 'code': ['IFP']},\n",
       " {'runways': [1], 'code': ['TCO']},\n",
       " {'runways': [1], 'code': ['ANU']},\n",
       " {'runways': [1], 'code': ['CCK']},\n",
       " {'runways': [1], 'code': ['SVK']},\n",
       " {'runways': [1], 'code': ['BKM']},\n",
       " {'runways': [1], 'code': ['RDN']},\n",
       " {'runways': [1], 'code': ['ZUM']},\n",
       " {'runways': [1], 'code': ['CEZ']},\n",
       " {'runways': [1], 'code': ['MZV']},\n",
       " {'runways': [1], 'code': ['YKL']},\n",
       " {'runways': [2], 'code': ['GLH']},\n",
       " {'runways': [1], 'code': ['VOL']},\n",
       " {'runways': [1], 'code': ['YYF']},\n",
       " {'runways': [1], 'code': ['OHH']},\n",
       " {'runways': [1], 'code': ['ALC']},\n",
       " {'runways': [1], 'code': ['TRN']},\n",
       " {'runways': [1], 'code': ['MCE']},\n",
       " {'runways': [1], 'code': ['BXB']},\n",
       " {'runways': [1], 'code': ['SCV']},\n",
       " {'runways': [1], 'code': ['ZSJ']},\n",
       " {'runways': [1], 'code': ['OHE']},\n",
       " {'runways': [1], 'code': ['TGM']},\n",
       " {'code': ['UK']},\n",
       " {'runways': [1], 'code': ['HEA']},\n",
       " {'runways': [1], 'code': ['TIH']},\n",
       " {'runways': [1], 'code': ['WBQ']},\n",
       " {'code': ['TZ']},\n",
       " {'runways': [1], 'code': ['KBC']},\n",
       " {'runways': [1], 'code': ['KWN']},\n",
       " {'runways': [1], 'code': ['MYY']},\n",
       " {'runways': [1], 'code': ['PAZ']},\n",
       " {'code': ['MZ']},\n",
       " {'runways': [1], 'code': ['OSI']},\n",
       " {'runways': [1], 'code': ['ARU']},\n",
       " {'runways': [2], 'code': ['RAP']},\n",
       " {'runways': [1], 'code': ['RLK']},\n",
       " {'runways': [1], 'code': ['LRS']},\n",
       " {'runways': [2], 'code': ['YKA']},\n",
       " {'runways': [1], 'code': ['INU']},\n",
       " {'runways': [1], 'code': ['SGO']},\n",
       " {'runways': [2], 'code': ['MSS']},\n",
       " {'runways': [2], 'code': ['VEL']},\n",
       " {'runways': [1], 'code': ['URS']},\n",
       " {'runways': [1], 'code': ['FNI']},\n",
       " {'runways': [2], 'code': ['NLK']},\n",
       " {'runways': [2], 'code': ['YHD']},\n",
       " {'runways': [2], 'code': ['MPL']},\n",
       " {'runways': [1], 'code': ['KME']},\n",
       " {'runways': [1], 'code': ['KLO']},\n",
       " {'runways': [1], 'code': ['XUZ']},\n",
       " {'runways': [1], 'code': ['GZP']},\n",
       " {'runways': [2], 'code': ['YYU']},\n",
       " {'runways': [1], 'code': ['ALF']},\n",
       " {'runways': [2], 'code': ['EZE']},\n",
       " {'runways': [2], 'code': ['NWI']},\n",
       " {'runways': [1], 'code': ['ETH']},\n",
       " {'runways': [1], 'code': ['VTB']},\n",
       " {'runways': [1], 'code': ['UDJ']},\n",
       " {'runways': [2], 'code': ['CTS']},\n",
       " {'runways': [1], 'code': ['PZO']},\n",
       " {'runways': [2], 'code': ['PVD']},\n",
       " {'runways': [2], 'code': ['ACY']},\n",
       " {'runways': [2], 'code': ['AAL']},\n",
       " {'runways': [1], 'code': ['TWU']},\n",
       " {'runways': [1], 'code': ['NMA']},\n",
       " {'runways': [1], 'code': ['YBX']},\n",
       " {'runways': [2], 'code': ['GRI']},\n",
       " {'runways': [1], 'code': ['TJU']},\n",
       " {'runways': [1], 'code': ['YWB']},\n",
       " {'runways': [2], 'code': ['MYW']},\n",
       " {'runways': [1], 'code': ['BVC']},\n",
       " {'runways': [1], 'code': ['INI']},\n",
       " {'runways': [1], 'code': ['QRO']},\n",
       " {'runways': [1], 'code': ['VKG']},\n",
       " {'runways': [1], 'code': ['VVC']},\n",
       " {'runways': [1], 'code': ['MLY']},\n",
       " {'runways': [1], 'code': ['SYX']},\n",
       " {'runways': [1], 'code': ['FDH']},\n",
       " {'runways': [2], 'code': ['GDL']},\n",
       " {'runways': [1], 'code': ['TTQ']},\n",
       " {'runways': [2], 'code': ['JGA']},\n",
       " {'runways': [1], 'code': ['HHH']},\n",
       " {'code': ['CG']},\n",
       " {'code': ['TV']},\n",
       " {'runways': [1], 'code': ['AUR']},\n",
       " {'runways': [1], 'code': ['YPY']},\n",
       " {'runways': [1], 'code': ['BSK']},\n",
       " {'runways': [2], 'code': ['KAN']},\n",
       " {'code': ['AS']},\n",
       " {'runways': [1], 'code': ['CRI']},\n",
       " {'runways': [1], 'code': ['IEV']},\n",
       " {'runways': [1], 'code': ['APO']},\n",
       " {'runways': [1], 'code': ['FKS']},\n",
       " {'runways': [1], 'code': ['WLH']},\n",
       " {'runways': [2], 'code': ['ATY']},\n",
       " {'runways': [1], 'code': ['TER']},\n",
       " {'runways': [1], 'code': ['BRM']},\n",
       " {'runways': [1], 'code': ['YGJ']},\n",
       " {'runways': [1], 'code': ['HCR']},\n",
       " {'runways': [1], 'code': ['ANG']},\n",
       " {'runways': [1], 'code': ['DLY']},\n",
       " {'runways': [1], 'code': ['MNA']},\n",
       " {'code': ['EG']},\n",
       " {'runways': [2], 'code': ['MZW']},\n",
       " {'runways': [2], 'code': ['LDY']},\n",
       " {'runways': [1], 'code': ['BVH']},\n",
       " {'runways': [1], 'code': ['PLU']},\n",
       " {'runways': [2], 'code': ['VBY']},\n",
       " {'runways': [1], 'code': ['KDH']},\n",
       " {'runways': [2], 'code': ['BDB']},\n",
       " {'runways': [2], 'code': ['HVR']},\n",
       " {'runways': [2], 'code': ['NBC']},\n",
       " {'runways': [1], 'code': ['LCE']},\n",
       " {'runways': [1], 'code': ['GXF']},\n",
       " {'runways': [1], 'code': ['TJA']},\n",
       " {'runways': [1], 'code': ['NOB']},\n",
       " {'code': ['AW']},\n",
       " {'runways': [1], 'code': ['SGU']},\n",
       " {'runways': [1], 'code': ['LKB']},\n",
       " {'runways': [1], 'code': ['KLG']},\n",
       " {'code': ['LR']},\n",
       " {'runways': [1], 'code': ['YAY']},\n",
       " {'runways': [2], 'code': ['MAN']},\n",
       " {'code': ['MO']},\n",
       " {'runways': [1], 'code': ['YIF']},\n",
       " {'runways': [1], 'code': ['BUS']},\n",
       " {'code': ['AI']},\n",
       " {'runways': [2], 'code': ['VLI']},\n",
       " {'runways': [2], 'code': ['NLA']},\n",
       " {'runways': [1], 'code': ['CXJ']},\n",
       " {'code': ['NG']},\n",
       " {'runways': [1], 'code': ['AKJ']},\n",
       " {'runways': [1], 'code': ['HDY']},\n",
       " {'runways': [1], 'code': ['CME']},\n",
       " {'runways': [1], 'code': ['HPG']},\n",
       " {'code': ['QA']},\n",
       " {'runways': [1], 'code': ['PSE']},\n",
       " {'code': ['SY']},\n",
       " {'runways': [1], 'code': ['TEQ']},\n",
       " {'runways': [1], 'code': ['UME']},\n",
       " {'code': ['NF']},\n",
       " {'runways': [1], 'code': ['KVL']},\n",
       " {'runways': [1], 'code': ['YOJ']},\n",
       " {'runways': [1], 'code': ['ZBF']},\n",
       " {'runways': [2], 'code': ['BFL']},\n",
       " {'runways': [1], 'code': ['MQN']},\n",
       " {'runways': [1], 'code': ['KGD']},\n",
       " {'runways': [1], 'code': ['ZTB']},\n",
       " {'runways': [1], 'code': ['CSH']},\n",
       " {'runways': [1], 'code': ['FEG']},\n",
       " {'runways': [2], 'code': ['AKF']},\n",
       " {'runways': [2], 'code': ['PVG']},\n",
       " {'runways': [1], 'code': ['MBI']},\n",
       " {'runways': [1], 'code': ['SNE']},\n",
       " {'runways': [1], 'code': ['DDG']},\n",
       " {'runways': [2], 'code': ['URG']},\n",
       " {'runways': [2], 'code': ['ITH']},\n",
       " {'runways': [1], 'code': ['SOU']},\n",
       " {'runways': [1], 'code': ['KLV']},\n",
       " {'runways': [2], 'code': ['AAE']},\n",
       " {'runways': [1], 'code': ['TRS']},\n",
       " {'runways': [1], 'code': ['BMU']},\n",
       " {'code': ['MG']},\n",
       " {'runways': [1], 'code': ['MTY']},\n",
       " {'runways': [2], 'code': ['DOH']},\n",
       " {'runways': [1], 'code': ['YRG']},\n",
       " {'runways': [1], 'code': ['SYM']},\n",
       " {'runways': [1], 'code': ['VAO']},\n",
       " {'runways': [1], 'code': ['GNB']},\n",
       " {'runways': [1], 'code': ['FUO']},\n",
       " {'runways': [1], 'code': ['UEO']},\n",
       " {'runways': [1], 'code': ['NYI']},\n",
       " {'runways': [1], 'code': ['MGZ']},\n",
       " {'runways': [1], 'code': ['ACR']},\n",
       " {'runways': [1], 'code': ['UYU']},\n",
       " {'code': ['GD']},\n",
       " {'runways': [1], 'code': ['BBN']},\n",
       " {'runways': [1], 'code': ['LYG']},\n",
       " {'runways': [1], 'code': ['ROS']},\n",
       " {'runways': [2], 'code': ['FSM']},\n",
       " {'code': ['LU']},\n",
       " {'runways': [2], 'code': ['LVI']},\n",
       " {'runways': [1], 'code': ['ULG']},\n",
       " {'runways': [1], 'code': ['RBY']},\n",
       " {'runways': [2], 'code': ['YTH']},\n",
       " {'runways': [1], 'code': ['TMC']},\n",
       " {'runways': [1], 'code': ['LPQ']},\n",
       " {'runways': [1], 'code': ['REC']},\n",
       " {'code': ['TO']},\n",
       " {'runways': [2], 'code': ['MSO']},\n",
       " {'runways': [2], 'code': ['KEJ']},\n",
       " {'runways': [2], 'code': ['MCG']},\n",
       " {'runways': [1], 'code': ['XSC']},\n",
       " {'runways': [2], 'code': ['RIW']},\n",
       " {'runways': [2], 'code': ['STS']},\n",
       " {'runways': [1], 'code': ['ANF']},\n",
       " {'runways': [1], 'code': ['LEA']},\n",
       " {'code': ['BJ']},\n",
       " {'runways': [1], 'code': ['AAT']},\n",
       " {'runways': [2], 'code': ['HDF']},\n",
       " {'runways': [1], 'code': ['GAE']},\n",
       " {'runways': [1], 'code': ['TKP']},\n",
       " {'runways': [2], 'code': ['IPL']},\n",
       " {'runways': [1], 'code': ['XQP']},\n",
       " {'runways': [2], 'code': ['IKA']},\n",
       " {'runways': [1], 'code': ['BCD']},\n",
       " {'runways': [1], 'code': ['BPN']},\n",
       " {'runways': [1], 'code': ['NYT']},\n",
       " {'runways': [1], 'code': ['MDK']},\n",
       " {'runways': [2], 'code': ['GWT']},\n",
       " {'runways': [1], 'code': ['YPL']},\n",
       " {'runways': [1], 'code': ['SVA']},\n",
       " {'code': ['BB']},\n",
       " {'runways': [2], 'code': ['LOV']},\n",
       " {'runways': [2], 'code': ['ORU']},\n",
       " {'runways': [2], 'code': ['PSA']},\n",
       " {'code': ['NA']},\n",
       " {'runways': [1], 'code': ['PYJ']},\n",
       " {'runways': [1], 'code': ['ATQ']},\n",
       " {'runways': [2], 'code': ['UTT']},\n",
       " {'runways': [2], 'code': ['DAR']},\n",
       " {'runways': [1], 'code': ['BYC']},\n",
       " {'runways': [1], 'code': ['PEG']},\n",
       " {'runways': [1], 'code': ['IAN']},\n",
       " {'runways': [1], 'code': ['AVL']},\n",
       " {'runways': [1], 'code': ['CEN']},\n",
       " {'runways': [1], 'code': ['NTN']},\n",
       " {'runways': [1], 'code': ['PMZ']},\n",
       " {'runways': [2], 'code': ['NAG']},\n",
       " {'runways': [1], 'code': ['MHC']},\n",
       " {'runways': [1], 'code': ['FRS']},\n",
       " {'runways': [1], 'code': ['LNE']},\n",
       " {'runways': [1], 'code': ['TIV']},\n",
       " {'runways': [1], 'code': ['FIE']},\n",
       " {'runways': [2], 'code': ['OSD']},\n",
       " {'runways': [1], 'code': ['INZ']},\n",
       " {'runways': [1], 'code': ['YIN']},\n",
       " {'runways': [1], 'code': ['NVK']},\n",
       " {'runways': [1], 'code': ['MXL']},\n",
       " {'runways': [1], 'code': ['YFS']},\n",
       " {'runways': [1], 'code': ['SYO']},\n",
       " {'runways': [1], 'code': ['FAO']},\n",
       " {'runways': [1], 'code': ['BEG']},\n",
       " {'runways': [1], 'code': ['GWD']},\n",
       " {'runways': [1], 'code': ['JIM']},\n",
       " {'runways': [1], 'code': ['OGU']},\n",
       " {'runways': [1], 'code': ['CJC']},\n",
       " {'runways': [1], 'code': ['IZA']},\n",
       " {'code': ['BE']},\n",
       " {'runways': [1], 'code': ['TJQ']},\n",
       " {'code': ['GW']},\n",
       " {'runways': [1], 'code': ['SUF']},\n",
       " {'runways': [1], 'code': ['USN']},\n",
       " {'runways': [1], 'code': ['BAY']},\n",
       " {'runways': [1], 'code': ['EAM']},\n",
       " {'runways': [1], 'code': ['WTL']},\n",
       " {'runways': [1], 'code': ['YBK']},\n",
       " {'runways': [1], 'code': ['SFJ']},\n",
       " {'runways': [1], 'code': ['TLL']},\n",
       " {'runways': [1], 'code': ['YYD']},\n",
       " {'runways': [1], 'code': ['CKH']},\n",
       " {'runways': [1], 'code': ['IGR']},\n",
       " {'runways': [1], 'code': ['NAO']},\n",
       " {'runways': [1], 'code': ['UAP']},\n",
       " {'runways': [1], 'code': ['VUS']},\n",
       " {'runways': [1], 'code': ['PQM']},\n",
       " {'runways': [1], 'code': ['RET']},\n",
       " {'code': ['DO']},\n",
       " {'runways': [1], 'code': ['TID']},\n",
       " {'runways': [2], 'code': ['PMI']},\n",
       " {'runways': [2], 'code': ['VNX']},\n",
       " {'runways': [1], 'code': ['XIY']},\n",
       " {'runways': [1], 'code': ['MLW']},\n",
       " {'runways': [1], 'code': ['RYK']},\n",
       " {'runways': [1], 'code': ['AOI']},\n",
       " {'runways': [1], 'code': ['IRC']},\n",
       " {'code': ['LY']},\n",
       " {'runways': [1], 'code': ['ARI']},\n",
       " {'runways': [1], 'code': ['BOO']},\n",
       " {'runways': [1], 'code': ['YNS']},\n",
       " {'runways': [1], 'code': ['ARC']},\n",
       " {'code': ['TR']},\n",
       " {'runways': [2], 'code': ['CCL']},\n",
       " {'runways': [2], 'code': ['KDU']},\n",
       " {'runways': [1], 'code': ['LXG']},\n",
       " {'runways': [2], 'code': ['MRS']},\n",
       " {'runways': [1], 'code': ['SZX']},\n",
       " {'runways': [1], 'code': ['KPN']},\n",
       " {'runways': [2], 'code': ['DDC']},\n",
       " {'runways': [1], 'code': ['PEE']},\n",
       " {'runways': [2], 'code': ['ILM']},\n",
       " {'runways': [2], 'code': ['AMA']},\n",
       " {'runways': [1], 'code': ['HZG']},\n",
       " {'runways': [1], 'code': ['HDG']},\n",
       " {'runways': [1], 'code': ['WUX']},\n",
       " {'runways': [2], 'code': ['IXM']},\n",
       " {'runways': [1], 'code': ['VNS']},\n",
       " {'runways': [1], 'code': ['VHM']},\n",
       " {'runways': [1], 'code': ['ABM']},\n",
       " {'runways': [1], 'code': ['YXN']},\n",
       " {'runways': [1], 'code': ['ASJ']},\n",
       " {'runways': [2], 'code': ['YQF']},\n",
       " {'runways': [1], 'code': ['JNZ']},\n",
       " {'runways': [1], 'code': ['PRN']},\n",
       " {'runways': [1], 'code': ['MGQ']},\n",
       " {'runways': [2], 'code': ['PIH']},\n",
       " {'runways': [1], 'code': ['VDE']},\n",
       " {'runways': [2], 'code': ['CIU']},\n",
       " {'code': ['PN']},\n",
       " {'runways': [1], 'code': ['SKO']},\n",
       " {'runways': [1], 'code': ['JOL']},\n",
       " {'code': ['FI']},\n",
       " {'runways': [1], 'code': ['TCT']},\n",
       " {'runways': [1], 'code': ['BQN']},\n",
       " {'runways': [2], 'code': ['MEX']},\n",
       " {'runways': [2], 'code': ['XBJ']},\n",
       " {'runways': [1], 'code': ['YNZ']},\n",
       " {'runways': [1], 'code': ['KSJ']},\n",
       " {'runways': [1], 'code': ['RBA']},\n",
       " {'code': ['KM']},\n",
       " {'runways': [1], 'code': ['PBM']},\n",
       " {'runways': [2], 'code': ['YHY']},\n",
       " {'runways': [2], 'code': ['YAG']},\n",
       " {'runways': [1], 'code': ['NNY']},\n",
       " {'runways': [2], 'code': ['BBI']},\n",
       " {'runways': [2], 'code': ['LIN']},\n",
       " {'runways': [1], 'code': ['GRU']},\n",
       " {'runways': [2], 'code': ['MAR']},\n",
       " {'runways': [1], 'code': ['NDJ']},\n",
       " {'runways': [1], 'code': ['WNH']},\n",
       " {'runways': [1], 'code': ['EDR']},\n",
       " {'runways': [1], 'code': ['KYK']},\n",
       " {'runways': [1], 'code': ['OAX']},\n",
       " {'runways': [1], 'code': ['ZUH']},\n",
       " {'code': ['TL']},\n",
       " {'runways': [2], 'code': ['PKE']},\n",
       " {'runways': [1], 'code': ['GYS']},\n",
       " {'runways': [2], 'code': ['CFS']},\n",
       " {'runways': [1], 'code': ['STI']},\n",
       " {'runways': [2], 'code': ['HRM']},\n",
       " {'runways': [2], 'code': ['OTH']},\n",
       " {'runways': [2], 'code': ['NRT']},\n",
       " {'runways': [1], 'code': ['SDR']},\n",
       " {'runways': [1], 'code': ['DIB']},\n",
       " {'runways': [1], 'code': ['YFA']},\n",
       " {'runways': [2], 'code': ['AAR']},\n",
       " {'runways': [2], 'code': ['PIR']},\n",
       " {'runways': [2], 'code': ['WIN']},\n",
       " {'code': ['CW']},\n",
       " {'runways': [2], 'code': ['NRA']},\n",
       " {'runways': [1], 'code': ['HOV']},\n",
       " {'runways': [1], 'code': ['FAE']},\n",
       " {'runways': [1], 'code': ['JQA']},\n",
       " {'runways': [2], 'code': ['GUM']},\n",
       " {'runways': [1], 'code': ['RHD']},\n",
       " {'runways': [1], 'code': ['BGA']},\n",
       " {'runways': [2], 'code': ['AGR']},\n",
       " {'runways': [1], 'code': ['HNM']},\n",
       " {'runways': [1], 'code': ['HOI']},\n",
       " {'runways': [2], 'code': ['BES']},\n",
       " {'runways': [1], 'code': ['MKQ']},\n",
       " {'runways': [1], 'code': ['LPD']},\n",
       " {'runways': [2], 'code': ['PTU']},\n",
       " {'code': ['NC']},\n",
       " {'runways': [1], 'code': ['NLT']},\n",
       " {'runways': [1], 'code': ['HAD']},\n",
       " {'runways': [2], 'code': ['GYD']},\n",
       " {'runways': [1], 'code': ['KHS']},\n",
       " {'runways': [1], 'code': ['EOH']},\n",
       " {'runways': [1], 'code': ['ZIH']},\n",
       " {'runways': [1], 'code': ['ENY']},\n",
       " {'runways': [1], 'code': ['GDT']},\n",
       " {'runways': [2], 'code': ['ASF']},\n",
       " {'runways': [1], 'code': ['ATT']},\n",
       " {'runways': [2], 'code': ['GFF']},\n",
       " {'code': ['MM']},\n",
       " {'runways': [1], 'code': ['TNK']},\n",
       " {'runways': [1], 'code': ['RDZ']},\n",
       " {'runways': [1], 'code': ['GVR']},\n",
       " {'runways': [1], 'code': ['BSD']},\n",
       " {'runways': [2], 'code': ['TUN']},\n",
       " {'runways': [1], 'code': ['TGC']},\n",
       " {'runways': [1], 'code': ['SZI']},\n",
       " {'runways': [1], 'code': ['MWX']},\n",
       " {'runways': [1], 'code': ['CUQ']},\n",
       " {'runways': [1], 'code': ['KUN']},\n",
       " {'runways': [2], 'code': ['IWK']},\n",
       " {'runways': [2], 'code': ['JTR']},\n",
       " {'runways': [1], 'code': ['GRO']},\n",
       " {'runways': [1], 'code': ['YVO']},\n",
       " {'runways': [1], 'code': ['WBM']},\n",
       " {'runways': [1], 'code': ['VAW']},\n",
       " {'runways': [1], 'code': ['TFF']},\n",
       " {'runways': [2], 'code': ['YKF']},\n",
       " {'runways': [2], 'code': ['ALB']},\n",
       " {'runways': [1], 'code': ['WAT']},\n",
       " {'runways': [2], 'code': ['KIJ']},\n",
       " {'runways': [2], 'code': ['SDU']},\n",
       " {'runways': [1], 'code': ['BPE']},\n",
       " {'runways': [1], 'code': ['LCR']},\n",
       " {'runways': [2], 'code': ['MGM']},\n",
       " {'runways': [1], 'code': ['VXC']},\n",
       " {'runways': [2], 'code': ['TWF']},\n",
       " {'runways': [1], 'code': ['GNY']},\n",
       " {'runways': [1], 'code': ['SCW']},\n",
       " {'runways': [2], 'code': ['CHS']},\n",
       " {'runways': [1], 'code': ['PDV']},\n",
       " {'runways': [1], 'code': ['SCT']},\n",
       " {'runways': [1], 'code': ['FMM']},\n",
       " {'runways': [1], 'code': ['XCH']},\n",
       " {'runways': [2], 'code': ['MMX']},\n",
       " {'runways': [1], 'code': ['TST']},\n",
       " {'runways': [1], 'code': ['WNA']},\n",
       " {'runways': [1], 'code': ['RAE']},\n",
       " {'runways': [1], 'code': ['SNW']},\n",
       " {'runways': [2], 'code': ['KRR']},\n",
       " {'code': ['AT']},\n",
       " {'runways': [1], 'code': ['LOH']},\n",
       " {'runways': [1], 'code': ['GMO']},\n",
       " {'runways': [1], 'code': ['JDZ']},\n",
       " {'runways': [1], 'code': ['RCY']},\n",
       " {'runways': [1], 'code': ['PMY']},\n",
       " {'runways': [1], 'code': ['HRI']},\n",
       " {'runways': [1], 'code': ['RMQ']},\n",
       " {'runways': [2], 'code': ['YAA']},\n",
       " {'runways': [1], 'code': ['VRC']},\n",
       " {'runways': [1], 'code': ['LRR']},\n",
       " {'runways': [1], 'code': ['CBS']},\n",
       " {'runways': [2], 'code': ['ANX']},\n",
       " {'runways': [1], 'code': ['TBW']},\n",
       " {'runways': [1], 'code': ['ULZ']},\n",
       " ...]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().and_(__.has('runways', P.neq(4)), __.has('runways', P.neq(3))).valueMap('code', 'runways').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## gt()\n",
    "__Airports that have more than 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "6"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().has('runways', P.gt(5)).count().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## gte()\n",
    "__Airports that have 6 or more runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().has('runways', P.gte(6)).count().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## lt()\n",
    "__Airports that have less than 3 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3078"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().has('runways', P.lt(3)).count().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## lte()\n",
    "__Airports that have 2 or less runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V().has('runways', P.lte(2)).count().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## inside()\n",
    "__Airports that have more than 2 but less than 6 runways__\n",
    "\n",
    "_There is an issue with this Python implementation of inside, 2 should not be inclusive_"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'runways': [4], 'code': ['KKE']},\n",
       " {'runways': [2], 'code': ['GGG']},\n",
       " {'runways': [2], 'code': ['GSE']},\n",
       " {'runways': [3], 'code': ['RDU']},\n",
       " {'runways': [2], 'code': ['TBS']},\n",
       " {'runways': [2], 'code': ['VKO']},\n",
       " {'runways': [2], 'code': ['HMO']},\n",
       " {'runways': [2], 'code': ['OWB']},\n",
       " {'runways': [3], 'code': ['UUD']},\n",
       " {'runways': [3], 'code': ['SYR']},\n",
       " {'runways': [2], 'code': ['SOW']},\n",
       " {'runways': [3], 'code': ['YYE']},\n",
       " {'runways': [2], 'code': ['WAW']},\n",
       " {'runways': [2], 'code': ['SVO']},\n",
       " {'runways': [2], 'code': ['SBP']},\n",
       " {'runways': [3], 'code': ['DME']},\n",
       " {'runways': [2], 'code': ['CZM']},\n",
       " {'runways': [2], 'code': ['FMN']},\n",
       " {'runways': [2], 'code': ['KSD']},\n",
       " {'runways': [2], 'code': ['ABY']},\n",
       " {'runways': [2], 'code': ['MUC']},\n",
       " {'runways': [2], 'code': ['PMO']},\n",
       " {'runways': [4], 'code': ['FRA']},\n",
       " {'runways': [2], 'code': ['LIL']},\n",
       " {'runways': [4], 'code': ['TMW']},\n",
       " {'runways': [2], 'code': ['ERI']},\n",
       " {'runways': [2], 'code': ['HTA']},\n",
       " {'runways': [2], 'code': ['MSY']},\n",
       " {'runways': [4], 'code': ['PHL']},\n",
       " {'runways': [2], 'code': ['GCC']},\n",
       " {'runways': [2], 'code': ['SGF']},\n",
       " {'runways': [2], 'code': ['AER']},\n",
       " {'runways': [2], 'code': ['PAH']},\n",
       " {'runways': [3], 'code': ['BZN']},\n",
       " {'runways': [2], 'code': ['KAT']},\n",
       " {'runways': [2], 'code': ['GNV']},\n",
       " {'runways': [2], 'code': ['ADD']},\n",
       " {'runways': [2], 'code': ['MKY']},\n",
       " {'runways': [3], 'code': ['ABA']},\n",
       " {'runways': [2], 'code': ['TEE']},\n",
       " {'runways': [2], 'code': ['YSM']},\n",
       " {'runways': [3], 'code': ['NRL']},\n",
       " {'runways': [2], 'code': ['REG']},\n",
       " {'runways': [2], 'code': ['TLN']},\n",
       " {'runways': [2], 'code': ['RZE']},\n",
       " {'runways': [2], 'code': ['YSB']},\n",
       " {'runways': [3], 'code': ['RNO']},\n",
       " {'runways': [3], 'code': ['BWI']},\n",
       " {'runways': [2], 'code': ['ACA']},\n",
       " {'runways': [2], 'code': ['BLV']},\n",
       " {'runways': [3], 'code': ['MLB']},\n",
       " {'runways': [2], 'code': ['BGY']},\n",
       " {'runways': [2], 'code': ['MLG']},\n",
       " {'runways': [2], 'code': ['VPS']},\n",
       " {'runways': [2], 'code': ['UPG']},\n",
       " {'runways': [2], 'code': ['SDJ']},\n",
       " {'runways': [3], 'code': ['PMR']},\n",
       " {'runways': [3], 'code': ['APA']},\n",
       " {'runways': [2], 'code': ['TBU']},\n",
       " {'runways': [3], 'code': ['AZA']},\n",
       " {'runways': [2], 'code': ['EGN']},\n",
       " {'runways': [2], 'code': ['PQQ']},\n",
       " {'runways': [3], 'code': ['LNK']},\n",
       " {'runways': [2], 'code': ['LNS']},\n",
       " {'runways': [2], 'code': ['ITO']},\n",
       " {'runways': [2], 'code': ['CRW']},\n",
       " {'runways': [2], 'code': ['HAM']},\n",
       " {'runways': [2], 'code': ['HSV']},\n",
       " {'runways': [2], 'code': ['AGP']},\n",
       " {'runways': [2], 'code': ['GZT']},\n",
       " {'runways': [2], 'code': ['CGK']},\n",
       " {'runways': [3], 'code': ['IXL']},\n",
       " {'runways': [2], 'code': ['EGO']},\n",
       " {'runways': [3], 'code': ['AZO']},\n",
       " {'runways': [2], 'code': ['RVT']},\n",
       " {'runways': [2], 'code': ['YXU']},\n",
       " {'runways': [2], 'code': ['TOL']},\n",
       " {'runways': [2], 'code': ['POL']},\n",
       " {'runways': [2], 'code': ['LIH']},\n",
       " {'runways': [2], 'code': ['MXP']},\n",
       " {'runways': [4], 'code': ['SLC']},\n",
       " {'runways': [2], 'code': ['YZF']},\n",
       " {'runways': [2], 'code': ['BRL']},\n",
       " {'runways': [2], 'code': ['JOE']},\n",
       " {'runways': [2], 'code': ['RCH']},\n",
       " {'runways': [5], 'code': ['PPQ']},\n",
       " {'runways': [5], 'code': ['TRG']},\n",
       " {'runways': [2], 'code': ['BEL']},\n",
       " {'runways': [3], 'code': ['VRB']},\n",
       " {'runways': [2], 'code': ['UET']},\n",
       " {'runways': [2], 'code': ['PKB']},\n",
       " {'runways': [2], 'code': ['PPG']},\n",
       " {'runways': [5], 'code': ['YYZ']},\n",
       " {'runways': [2], 'code': ['LUD']},\n",
       " {'runways': [2], 'code': ['CLJ']},\n",
       " {'runways': [2], 'code': ['CGH']},\n",
       " {'runways': [2], 'code': ['PMV']},\n",
       " {'runways': [5], 'code': ['HLZ']},\n",
       " {'runways': [2], 'code': ['DHN']},\n",
       " {'runways': [2], 'code': ['GEO']},\n",
       " {'runways': [2], 'code': ['MID']},\n",
       " {'runways': [2], 'code': ['BRE']},\n",
       " {'runways': [2], 'code': ['EBB']},\n",
       " {'runways': [2], 'code': ['PRG']},\n",
       " {'runways': [3], 'code': ['SBN']},\n",
       " {'runways': [2], 'code': ['GMP']},\n",
       " {'runways': [2], 'code': ['BZO']},\n",
       " {'runways': [3], 'code': ['ABI']},\n",
       " {'runways': [2], 'code': ['PGA']},\n",
       " {'runways': [3], 'code': ['CAK']},\n",
       " {'runways': [2], 'code': ['LBE']},\n",
       " {'runways': [2], 'code': ['TXK']},\n",
       " {'runways': [2], 'code': ['BUC']},\n",
       " {'runways': [2], 'code': ['YQG']},\n",
       " {'runways': [3], 'code': ['UST']},\n",
       " {'runways': [3], 'code': ['EDI']},\n",
       " {'runways': [2], 'code': ['GCK']},\n",
       " {'runways': [4], 'code': ['GOJ']},\n",
       " {'runways': [2], 'code': ['YAK']},\n",
       " {'runways': [2], 'code': ['ESC']},\n",
       " {'runways': [5], 'code': ['SNN']},\n",
       " {'runways': [3], 'code': ['BEW']},\n",
       " {'runways': [2], 'code': ['OGG']},\n",
       " {'runways': [2], 'code': ['SYY']},\n",
       " {'runways': [2], 'code': ['MZL']},\n",
       " {'runways': [2], 'code': ['FLS']},\n",
       " {'runways': [3], 'code': ['CVN']},\n",
       " {'runways': [2], 'code': ['WGA']},\n",
       " {'runways': [2], 'code': ['YXT']},\n",
       " {'runways': [3], 'code': ['LAN']},\n",
       " {'runways': [2], 'code': ['TJM']},\n",
       " {'runways': [2], 'code': ['SHV']},\n",
       " {'runways': [3], 'code': ['MCI']},\n",
       " {'runways': [3], 'code': ['SEA']},\n",
       " {'runways': [2], 'code': ['KBP']},\n",
       " {'runways': [3], 'code': ['CUU']},\n",
       " {'runways': [2], 'code': ['ELS']},\n",
       " {'runways': [2], 'code': ['DRW']},\n",
       " {'runways': [3], 'code': ['GSO']},\n",
       " {'runways': [4], 'code': ['JFK']},\n",
       " {'runways': [2], 'code': ['APN']},\n",
       " {'runways': [2], 'code': ['EQS']},\n",
       " {'runways': [2], 'code': ['MYA']},\n",
       " {'runways': [2], 'code': ['SCN']},\n",
       " {'runways': [2], 'code': ['ZAD']},\n",
       " {'runways': [3], 'code': ['ELP']},\n",
       " {'runways': [2], 'code': ['YKS']},\n",
       " {'runways': [2], 'code': ['MHG']},\n",
       " {'runways': [2], 'code': ['MTJ']},\n",
       " {'runways': [2], 'code': ['MAH']},\n",
       " {'runways': [2], 'code': ['CMX']},\n",
       " {'runways': [2], 'code': ['SKG']},\n",
       " {'runways': [2], 'code': ['CTL']},\n",
       " {'runways': [2], 'code': ['PIK']},\n",
       " {'runways': [2], 'code': ['RKS']},\n",
       " {'runways': [3], 'code': ['LUK']},\n",
       " {'runways': [2], 'code': ['IXE']},\n",
       " {'runways': [2], 'code': ['HID']},\n",
       " {'runways': [2], 'code': ['PWM']},\n",
       " {'runways': [2], 'code': ['LRT']},\n",
       " {'runways': [2], 'code': ['TRO']},\n",
       " {'runways': [3], 'code': ['EVV']},\n",
       " {'runways': [2], 'code': ['CFE']},\n",
       " {'runways': [2], 'code': ['LYH']},\n",
       " {'runways': [2], 'code': ['JBR']},\n",
       " {'runways': [2], 'code': ['YFC']},\n",
       " {'runways': [2], 'code': ['YGK']},\n",
       " {'runways': [2], 'code': ['BWT']},\n",
       " {'runways': [4], 'code': ['BRD']},\n",
       " {'runways': [2], 'code': ['DPS']},\n",
       " {'runways': [2], 'code': ['BKK']},\n",
       " {'runways': [3], 'code': ['NPL']},\n",
       " {'runways': [2], 'code': ['TRI']},\n",
       " {'runways': [2], 'code': ['SGN']},\n",
       " {'runways': [2], 'code': ['JMS']},\n",
       " {'runways': [2], 'code': ['GLA']},\n",
       " {'runways': [2], 'code': ['SAL']},\n",
       " {'runways': [2], 'code': ['ACV']},\n",
       " {'runways': [3], 'code': ['YZT']},\n",
       " {'runways': [2], 'code': ['GLH']},\n",
       " {'runways': [3], 'code': ['SHR']},\n",
       " {'runways': [3], 'code': ['PGD']},\n",
       " {'runways': [3], 'code': ['ERZ']},\n",
       " {'runways': [3], 'code': ['ADQ']},\n",
       " {'runways': [4], 'code': ['MEM']},\n",
       " {'runways': [3], 'code': ['EWR']},\n",
       " {'runways': [3], 'code': ['TBB']},\n",
       " {'runways': [2], 'code': ['RAP']},\n",
       " {'runways': [3], 'code': ['OMS']},\n",
       " {'runways': [3], 'code': ['YHU']},\n",
       " {'runways': [4], 'code': ['ILI']},\n",
       " {'runways': [2], 'code': ['YKA']},\n",
       " {'runways': [2], 'code': ['MSS']},\n",
       " {'runways': [2], 'code': ['VEL']},\n",
       " {'runways': [2], 'code': ['NLK']},\n",
       " {'runways': [2], 'code': ['YHD']},\n",
       " {'runways': [2], 'code': ['MPL']},\n",
       " {'runways': [2], 'code': ['YYU']},\n",
       " {'runways': [2], 'code': ['EZE']},\n",
       " {'runways': [2], 'code': ['NWI']},\n",
       " {'runways': [2], 'code': ['CTS']},\n",
       " {'runways': [2], 'code': ['PVD']},\n",
       " {'runways': [2], 'code': ['ACY']},\n",
       " {'runways': [2], 'code': ['AAL']},\n",
       " {'runways': [3], 'code': ['LMT']},\n",
       " {'runways': [2], 'code': ['GRI']},\n",
       " {'runways': [2], 'code': ['MYW']},\n",
       " {'runways': [4], 'code': ['CNM']},\n",
       " {'runways': [2], 'code': ['GDL']},\n",
       " {'runways': [3], 'code': ['SJC']},\n",
       " {'runways': [2], 'code': ['JGA']},\n",
       " {'runways': [3], 'code': ['PUQ']},\n",
       " {'runways': [2], 'code': ['KAN']},\n",
       " {'runways': [3], 'code': ['HVD']},\n",
       " {'runways': [2], 'code': ['ATY']},\n",
       " {'runways': [2], 'code': ['MZW']},\n",
       " {'runways': [2], 'code': ['LDY']},\n",
       " {'runways': [2], 'code': ['VBY']},\n",
       " {'runways': [2], 'code': ['BDB']},\n",
       " {'runways': [2], 'code': ['HVR']},\n",
       " {'runways': [2], 'code': ['NBC']},\n",
       " {'runways': [2], 'code': ['MAN']},\n",
       " {'runways': [3], 'code': ['LFT']},\n",
       " {'runways': [2], 'code': ['VLI']},\n",
       " {'runways': [2], 'code': ['NLA']},\n",
       " {'runways': [3], 'code': ['OMD']},\n",
       " {'runways': [3], 'code': ['YXX']},\n",
       " {'runways': [3], 'code': ['BTM']},\n",
       " {'runways': [4], 'code': ['HND']},\n",
       " {'runways': [2], 'code': ['BFL']},\n",
       " {'runways': [2], 'code': ['AKF']},\n",
       " {'runways': [2], 'code': ['PVG']},\n",
       " {'runways': [2], 'code': ['URG']},\n",
       " {'runways': [2], 'code': ['ITH']},\n",
       " {'runways': [3], 'code': ['ROW']},\n",
       " {'runways': [2], 'code': ['AAE']},\n",
       " {'runways': [2], 'code': ['DOH']},\n",
       " {'runways': [4], 'code': ['BNA']},\n",
       " {'runways': [2], 'code': ['FSM']},\n",
       " {'runways': [3], 'code': ['YZV']},\n",
       " {'runways': [2], 'code': ['LVI']},\n",
       " {'runways': [2], 'code': ['YTH']},\n",
       " {'runways': [3], 'code': ['OGD']},\n",
       " {'runways': [2], 'code': ['MSO']},\n",
       " {'runways': [2], 'code': ['KEJ']},\n",
       " {'runways': [2], 'code': ['MCG']},\n",
       " {'runways': [2], 'code': ['RIW']},\n",
       " {'runways': [2], 'code': ['STS']},\n",
       " {'runways': [2], 'code': ['HDF']},\n",
       " {'runways': [2], 'code': ['IPL']},\n",
       " {'runways': [2], 'code': ['IKA']},\n",
       " {'runways': [3], 'code': ['RKV']},\n",
       " {'runways': [2], 'code': ['GWT']},\n",
       " {'runways': [2], 'code': ['LOV']},\n",
       " {'runways': [3], 'code': ['RIC']},\n",
       " {'runways': [2], 'code': ['ORU']},\n",
       " {'runways': [2], 'code': ['PSA']},\n",
       " {'runways': [2], 'code': ['UTT']},\n",
       " {'runways': [2], 'code': ['DAR']},\n",
       " {'runways': [2], 'code': ['NAG']},\n",
       " {'runways': [3], 'code': ['TOB']},\n",
       " {'runways': [2], 'code': ['OSD']},\n",
       " {'runways': [3], 'code': ['GRZ']},\n",
       " {'runways': [3], 'code': ['NIM']},\n",
       " {'runways': [3], 'code': ['MJV']},\n",
       " {'runways': [2], 'code': ['PMI']},\n",
       " {'runways': [2], 'code': ['VNX']},\n",
       " {'runways': [3], 'code': ['BRR']},\n",
       " {'runways': [3], 'code': ['BMI']},\n",
       " {'runways': [3], 'code': ['DEC']},\n",
       " {'runways': [2], 'code': ['CCL']},\n",
       " {'runways': [2], 'code': ['KDU']},\n",
       " {'runways': [3], 'code': ['CLE']},\n",
       " {'runways': [2], 'code': ['MRS']},\n",
       " {'runways': [2], 'code': ['DDC']},\n",
       " {'runways': [2], 'code': ['ILM']},\n",
       " {'runways': [2], 'code': ['AMA']},\n",
       " {'runways': [2], 'code': ['IXM']},\n",
       " {'runways': [3], 'code': ['CGN']},\n",
       " {'runways': [3], 'code': ['ODS']},\n",
       " {'runways': [2], 'code': ['YQF']},\n",
       " {'runways': [3], 'code': ['BCN']},\n",
       " {'runways': [2], 'code': ['PIH']},\n",
       " {'runways': [2], 'code': ['CIU']},\n",
       " {'runways': [3], 'code': ['JST']},\n",
       " {'runways': [2], 'code': ['MEX']},\n",
       " {'runways': [2], 'code': ['XBJ']},\n",
       " {'runways': [3], 'code': ['IND']},\n",
       " {'runways': [2], 'code': ['YHY']},\n",
       " {'runways': [2], 'code': ['YAG']},\n",
       " {'runways': [2], 'code': ['BBI']},\n",
       " {'runways': [2], 'code': ['LIN']},\n",
       " {'runways': [2], 'code': ['MAR']},\n",
       " {'runways': [2], 'code': ['PKE']},\n",
       " {'runways': [2], 'code': ['CFS']},\n",
       " {'runways': [2], 'code': ['HRM']},\n",
       " {'runways': [4], 'code': ['SFO']},\n",
       " {'runways': [2], 'code': ['OTH']},\n",
       " {'runways': [2], 'code': ['NRT']},\n",
       " {'runways': [2], 'code': ['AAR']},\n",
       " {'runways': [2], 'code': ['PIR']},\n",
       " {'runways': [2], 'code': ['WIN']},\n",
       " {'runways': [3], 'code': ['JLN']},\n",
       " {'runways': [3], 'code': ['BRU']},\n",
       " {'runways': [2], 'code': ['NRA']},\n",
       " {'runways': [2], 'code': ['GUM']},\n",
       " {'runways': [2], 'code': ['AGR']},\n",
       " {'runways': [3], 'code': ['VLY']},\n",
       " {'runways': [2], 'code': ['BES']},\n",
       " {'runways': [2], 'code': ['PTU']},\n",
       " {'runways': [2], 'code': ['GYD']},\n",
       " {'runways': [3], 'code': ['TUS']},\n",
       " {'runways': [3], 'code': ['APF']},\n",
       " {'runways': [4], 'code': ['OAK']},\n",
       " {'runways': [2], 'code': ['ASF']},\n",
       " {'runways': [2], 'code': ['GFF']},\n",
       " {'runways': [3], 'code': ['FAR']},\n",
       " {'runways': [3], 'code': ['MCK']},\n",
       " {'runways': [2], 'code': ['TUN']},\n",
       " {'runways': [2], 'code': ['IWK']},\n",
       " {'runways': [2], 'code': ['JTR']},\n",
       " {'runways': [2], 'code': ['YKF']},\n",
       " {'runways': [2], 'code': ['ALB']},\n",
       " {'runways': [2], 'code': ['KIJ']},\n",
       " {'runways': [2], 'code': ['SDU']},\n",
       " {'runways': [2], 'code': ['MGM']},\n",
       " {'runways': [2], 'code': ['TWF']},\n",
       " {'runways': [2], 'code': ['CHS']},\n",
       " {'runways': [2], 'code': ['MMX']},\n",
       " {'runways': [3], 'code': ['ELM']},\n",
       " {'runways': [2], 'code': ['KRR']},\n",
       " {'runways': [3], 'code': ['ARN']},\n",
       " {'runways': [2], 'code': ['YAA']},\n",
       " {'runways': [2], 'code': ['ANX']},\n",
       " {'runways': [2], 'code': ['KTS']},\n",
       " {'runways': [2], 'code': ['SMF']},\n",
       " {'runways': [2], 'code': ['BLZ']},\n",
       " {'runways': [2], 'code': ['NRK']},\n",
       " {'runways': [2], 'code': ['CFR']},\n",
       " {'runways': [2], 'code': ['TLH']},\n",
       " {'runways': [4], 'code': ['GFK']},\n",
       " {'runways': [3], 'code': ['PHX']},\n",
       " {'runways': [2], 'code': ['BIS']},\n",
       " {'runways': [3], 'code': ['PLO']},\n",
       " {'runways': [3], 'code': ['ACI']},\n",
       " {'runways': [2], 'code': ['SHM']},\n",
       " {'runways': [2], 'code': ['DEB']},\n",
       " {'runways': [2], 'code': ['LGG']},\n",
       " {'runways': [2], 'code': ['MEI']},\n",
       " {'runways': [3], 'code': ['AIA']},\n",
       " {'runways': [3], 'code': ['WRY']},\n",
       " {'runways': [3], 'code': ['SYD']},\n",
       " {'runways': [2], 'code': ['CIC']},\n",
       " {'runways': [2], 'code': ['PTJ']},\n",
       " {'runways': [2], 'code': ['TAE']},\n",
       " {'runways': [5], 'code': ['IAH']},\n",
       " {'runways': [2], 'code': ['ORF']},\n",
       " {'runways': [2], 'code': ['TOG']},\n",
       " {'runways': [2], 'code': ['MCX']},\n",
       " {'runways': [2], 'code': ['YQT']},\n",
       " {'runways': [5], 'code': ['ATL']},\n",
       " {'runways': [2], 'code': ['CMN']},\n",
       " {'runways': [2], 'code': ['AEX']},\n",
       " {'runways': [2], 'code': ['TLS']},\n",
       " {'runways': [2], 'code': ['TBZ']},\n",
       " {'runways': [2], 'code': ['AHN']},\n",
       " {'runways': [2], 'code': ['BHM']},\n",
       " {'runways': [3], 'code': ['BRO']},\n",
       " {'runways': [2], 'code': ['CJJ']},\n",
       " {'runways': [3], 'code': ['BHI']},\n",
       " {'runways': [2], 'code': ['ALG']},\n",
       " {'runways': [3], 'code': ['TLV']},\n",
       " {'runways': [3], 'code': ['SIN']},\n",
       " {'runways': [3], 'code': ['YXS']},\n",
       " {'runways': [2], 'code': ['NAA']},\n",
       " {'runways': [2], 'code': ['PKA']},\n",
       " {'runways': [2], 'code': ['MOB']},\n",
       " {'runways': [2], 'code': ['JAX']},\n",
       " {'runways': [2], 'code': ['PVU']},\n",
       " {'runways': [4], 'code': ['IVC']},\n",
       " {'runways': [2], 'code': ['FLL']},\n",
       " {'runways': [2], 'code': ['YZR']},\n",
       " {'runways': [2], 'code': ['YXJ']},\n",
       " {'runways': [3], 'code': ['TRD']},\n",
       " {'runways': [2], 'code': ['BUF']},\n",
       " {'runways': [2], 'code': ['SAV']},\n",
       " {'runways': [2], 'code': ['HLA']},\n",
       " {'runways': [3], 'code': ['HER']},\n",
       " {'runways': [2], 'code': ['INT']},\n",
       " {'runways': [2], 'code': ['BLA']},\n",
       " {'runways': [2], 'code': ['VCE']},\n",
       " {'runways': [5], 'code': ['UFA']},\n",
       " {'runways': [2], 'code': ['BDS']},\n",
       " {'runways': [2], 'code': ['GGW']},\n",
       " {'runways': [2], 'code': ['CWA']},\n",
       " {'runways': [2], 'code': ['YQU']},\n",
       " {'runways': [3], 'code': ['BIL']},\n",
       " {'runways': [2], 'code': ['CDB']},\n",
       " {'runways': [2], 'code': ['TYS']},\n",
       " {'runways': [2], 'code': ['ULK']},\n",
       " {'runways': [2], 'code': ['AKL']},\n",
       " {'runways': [2], 'code': ['LGW']},\n",
       " {'runways': [2], 'code': ['CID']},\n",
       " {'runways': [2], 'code': ['YXH']},\n",
       " {'runways': [3], 'code': ['IAG']},\n",
       " {'runways': [2], 'code': ['KIH']},\n",
       " {'runways': [2], 'code': ['YYY']},\n",
       " {'runways': [2], 'code': ['VIE']},\n",
       " {'runways': [3], 'code': ['MVD']},\n",
       " {'runways': [2], 'code': ['ELF']},\n",
       " {'runways': [2], 'code': ['ZCL']},\n",
       " {'runways': [3], 'code': ['PEK']},\n",
       " {'runways': [2], 'code': ['OST']},\n",
       " {'runways': [2], 'code': ['BTV']},\n",
       " {'runways': [3], 'code': ['COS']},\n",
       " {'runways': [2], 'code': ['KYA']},\n",
       " {'runways': [2], 'code': ['MWA']},\n",
       " {'runways': [3], 'code': ['SOY']},\n",
       " {'runways': [2], 'code': ['YHM']},\n",
       " {'runways': [2], 'code': ['RFD']},\n",
       " {'runways': [2], 'code': ['LEB']},\n",
       " {'runways': [2], 'code': ['POM']},\n",
       " {'runways': [2], 'code': ['DMM']},\n",
       " {'runways': [2], 'code': ['RST']},\n",
       " {'runways': [2], 'code': ['BFS']},\n",
       " {'runways': [2], 'code': ['YYG']},\n",
       " {'runways': [2], 'code': ['BCI']},\n",
       " {'runways': [2], 'code': ['CBR']},\n",
       " {'runways': [2], 'code': ['RSH']},\n",
       " {'runways': [3], 'code': ['GLO']},\n",
       " {'runways': [3], 'code': ['PDT']},\n",
       " {'runways': [2], 'code': ['EAU']},\n",
       " {'runways': [2], 'code': ['IPT']},\n",
       " {'runways': [2], 'code': ['SMX']},\n",
       " {'runways': [2], 'code': ['CWB']},\n",
       " {'runways': [3], 'code': ['BHE']},\n",
       " {'runways': [2], 'code': ['MAA']},\n",
       " {'runways': [2], 'code': ['STC']},\n",
       " {'runways': [2], 'code': ['GPA']},\n",
       " {'runways': [2], 'code': ['VER']},\n",
       " {'runways': [2], 'code': ['PHE']},\n",
       " {'runways': [2], 'code': ['ONG']},\n",
       " {'runways': [2], 'code': ['MBS']},\n",
       " {'runways': [2], 'code': ['ISA']},\n",
       " {'runways': [2], 'code': ['LEJ']},\n",
       " {'runways': [2], 'code': ['BSL']},\n",
       " {'runways': [2], 'code': ['RNS']},\n",
       " {'runways': [2], 'code': ['CPD']},\n",
       " {'runways': [2], 'code': ['BAH']},\n",
       " {'runways': [2], 'code': ['BND']},\n",
       " {'runways': [2], 'code': ['HKK']},\n",
       " {'runways': [2], 'code': ['KOE']},\n",
       " {'runways': [2], 'code': ['BPT']},\n",
       " {'runways': [2], 'code': ['MLA']},\n",
       " {'runways': [2], 'code': ['SOM']},\n",
       " {'runways': [2], 'code': ['JAI']},\n",
       " {'runways': [2], 'code': ['PSP']},\n",
       " {'runways': [2], 'code': ['ATW']},\n",
       " {'runways': [2], 'code': ['ABE']},\n",
       " {'runways': [3], 'code': ['YYJ']},\n",
       " {'runways': [2], 'code': ['MCW']},\n",
       " {'runways': [2], 'code': ['CNS']},\n",
       " {'runways': [2], 'code': ['SCL']},\n",
       " {'runways': [4], 'code': ['CLT']},\n",
       " {'runways': [4], 'code': ['OSW']},\n",
       " {'runways': [2], 'code': ['MKK']},\n",
       " {'runways': [2], 'code': ['IAM']},\n",
       " {'runways': [3], 'code': ['YOW']},\n",
       " {'runways': [2], 'code': ['XTO']},\n",
       " {'runways': [2], 'code': ['HAN']},\n",
       " {'runways': [2], 'code': ['SRQ']},\n",
       " {'runways': [2], 'code': ['LPB']},\n",
       " {'runways': [3], 'code': ['TIU']},\n",
       " {'runways': [3], 'code': ['ILG']},\n",
       " {'runways': [2], 'code': ['YQB']},\n",
       " {'runways': [2], 'code': ['BGW']},\n",
       " {'runways': [2], 'code': ['BUR']},\n",
       " {'runways': [2], 'code': ['WDH']},\n",
       " {'runways': [2], 'code': ['DRG']},\n",
       " {'runways': [2], 'code': ['CJU']},\n",
       " {'runways': [2], 'code': ['AGS']},\n",
       " {'runways': [2], 'code': ['AGH']},\n",
       " {'runways': [3], 'code': ['LST']},\n",
       " {'runways': [2], 'code': ['IDA']},\n",
       " {'runways': [3], 'code': ['YXY']},\n",
       " {'runways': [2], 'code': ['LCH']},\n",
       " {'runways': [3], 'code': ['MSN']},\n",
       " {'runways': [2], 'code': ['MEL']},\n",
       " {'runways': [2], 'code': ['CBH']},\n",
       " {'runways': [4], 'code': ['OKC']},\n",
       " {'runways': [2], 'code': ['ALH']},\n",
       " {'runways': [2], 'code': ['CPT']},\n",
       " {'runways': [2], 'code': ['KSF']},\n",
       " {'runways': [2], 'code': ['JOG']},\n",
       " {'runways': [2], 'code': ['YLL']},\n",
       " {'runways': [2], 'code': ['YAM']},\n",
       " {'runways': [2], 'code': ['MCT']},\n",
       " {'runways': [3], 'code': ['BVA']},\n",
       " {'runways': [2], 'code': ['LYS']},\n",
       " {'runways': [3], 'code': ['VOG']},\n",
       " {'runways': [3], 'code': ['LCK']},\n",
       " {'runways': [2], 'code': ['TMR']},\n",
       " {'runways': [2], 'code': ['TSV']},\n",
       " {'runways': [3], 'code': ['SDF']},\n",
       " {'runways': [3], 'code': ['HUN']},\n",
       " {'runways': [2], 'code': ['IFN']},\n",
       " {'runways': [2], 'code': ['ELU']},\n",
       " {'runways': [2], 'code': ['JHW']},\n",
       " {'runways': [3], 'code': ['LBB']},\n",
       " {'runways': [2], 'code': ['AOO']},\n",
       " {'runways': [3], 'code': ['ISC']},\n",
       " {'runways': [2], 'code': ['KLU']},\n",
       " {'runways': [2], 'code': ['IVL']},\n",
       " {'runways': [2], 'code': ['BSB']},\n",
       " {'runways': [3], 'code': ['TPA']},\n",
       " {'runways': [2], 'code': ['TLE']},\n",
       " {'runways': [2], 'code': ['YKM']},\n",
       " {'runways': [2], 'code': ['BNE']},\n",
       " {'runways': [2], 'code': ['MPN']},\n",
       " {'runways': [4], 'code': ['VCT']},\n",
       " {'runways': [3], 'code': ['ANC']},\n",
       " {'runways': [2], 'code': ['MRY']},\n",
       " {'runways': [2], 'code': ['PDP']},\n",
       " {'runways': [2], 'code': ['TUU']},\n",
       " {'runways': [2], 'code': ['MKL']},\n",
       " {'runways': [2], 'code': ['MHT']},\n",
       " {'runways': [3], 'code': ['BRN']},\n",
       " {'runways': [2], 'code': ['HDS']},\n",
       " {'runways': [2], 'code': ['ROK']},\n",
       " {'runways': [2], 'code': ['EGX']},\n",
       " {'runways': [2], 'code': ['OME']},\n",
       " {'runways': [5], 'code': ['NPE']},\n",
       " {'runways': [3], 'code': ['YBR']},\n",
       " {'runways': [2], 'code': ['AUG']},\n",
       " {'runways': [2], 'code': ['PNL']},\n",
       " {'runways': [2], 'code': ['MCY']},\n",
       " {'runways': [4], 'code': ['CVG']},\n",
       " {'runways': [2], 'code': ['DLH']},\n",
       " {'runways': [2], 'code': ['YYQ']},\n",
       " {'runways': [3], 'code': ['YVR']},\n",
       " {'runways': [3], 'code': ['HLN']},\n",
       " {'runways': [4], 'code': ['HNL']},\n",
       " {'runways': [3], 'code': ['LIT']},\n",
       " {'runways': [2], 'code': ['PUS']},\n",
       " {'runways': [2], 'code': ['INL']},\n",
       " {'runways': [4], 'code': ['CDG']},\n",
       " {'runways': [2], 'code': ['ABR']},\n",
       " {'runways': [2], 'code': ['RUN']},\n",
       " {'runways': [2], 'code': ['RUH']},\n",
       " {'runways': [2], 'code': ['MBL']},\n",
       " {'runways': [3], 'code': ['PLZ']},\n",
       " {'runways': [2], 'code': ['EPR']},\n",
       " {'runways': [2], 'code': ['DSM']},\n",
       " {'runways': [3], 'code': ['AKN']},\n",
       " {'runways': [2], 'code': ['TVF']},\n",
       " {'runways': [2], 'code': ['ERC']},\n",
       " {'runways': [2], 'code': ['EKO']},\n",
       " {'runways': [2], 'code': ['DKR']},\n",
       " {'runways': [4], 'code': ['SVC']},\n",
       " {'runways': [3], 'code': ['TUL']},\n",
       " {'runways': [2], 'code': ['INV']},\n",
       " {'runways': [3], 'code': ['DEL']},\n",
       " {'runways': [3], 'code': ['HOB']},\n",
       " {'runways': [2], 'code': ['COR']},\n",
       " {'runways': [2], 'code': ['ASP']},\n",
       " {'runways': [2], 'code': ['GVA']},\n",
       " {'runways': [3], 'code': ['GRB']},\n",
       " {'runways': [4], 'code': ['IAD']},\n",
       " {'runways': [2], 'code': ['BIO']},\n",
       " {'runways': [2], 'code': ['OLL']},\n",
       " {'runways': [2], 'code': ['FKL']},\n",
       " {'runways': [3], 'code': ['VLD']},\n",
       " {'runways': [2], 'code': ['ABD']},\n",
       " {'runways': [2], 'code': ['TPE']},\n",
       " {'runways': [2], 'code': ['CJS']},\n",
       " {'runways': [2], 'code': ['MPM']},\n",
       " {'runways': [2], 'code': ['HKG']},\n",
       " {'runways': [2], 'code': ['BEB']},\n",
       " {'runways': [2], 'code': ['CYS']},\n",
       " {'runways': [2], 'code': ['GEG']},\n",
       " {'runways': [3], 'code': ['LSE']},\n",
       " {'runways': [3], 'code': ['HBE']},\n",
       " {'runways': [2], 'code': ['GJT']},\n",
       " {'runways': [2], 'code': ['PXO']},\n",
       " {'runways': [2], 'code': ['LFR']},\n",
       " {'runways': [2], 'code': ['CAE']},\n",
       " {'runways': [2], 'code': ['PSY']},\n",
       " {'runways': [2], 'code': ['HYS']},\n",
       " {'runways': [2], 'code': ['HIN']},\n",
       " {'runways': [2], 'code': ['TIF']},\n",
       " {'runways': [3], 'code': ['TGZ']},\n",
       " {'runways': [2], 'code': ['IGA']},\n",
       " {'runways': [2], 'code': ['FNJ']},\n",
       " {'runways': [2], 'code': ['YEG']},\n",
       " {'runways': [4], 'code': ['ABZ']},\n",
       " {'runways': [2], 'code': ['PET']},\n",
       " {'runways': [2], 'code': ['MFE']},\n",
       " {'runways': [2], 'code': ['SYZ']},\n",
       " {'runways': [3], 'code': ['ROT']},\n",
       " {'runways': [4], 'code': ['ISP']},\n",
       " {'runways': [2], 'code': ['JNB']},\n",
       " {'runways': [2], 'code': ['ART']},\n",
       " {'runways': [2], 'code': ['SXF']},\n",
       " {'runways': [2], 'code': ['HGU']},\n",
       " {'runways': [2], 'code': ['SVI']},\n",
       " {'runways': [2], 'code': ['LAQ']},\n",
       " {'runways': [2], 'code': ['URE']},\n",
       " {'runways': [2], 'code': ['EWN']},\n",
       " {'runways': [2], 'code': ['HME']},\n",
       " {'runways': [3], 'code': ['SPI']},\n",
       " {'runways': [2], 'code': ['NYO']},\n",
       " {'runways': [3], 'code': ['TAM']},\n",
       " {'runways': [2], 'code': ['OVB']},\n",
       " {'runways': [2], 'code': ['VDM']},\n",
       " {'runways': [2], 'code': ['BRI']},\n",
       " {'runways': [2], 'code': ['DJG']},\n",
       " {'runways': [2], 'code': ['CCU']},\n",
       " {'runways': [3], 'code': ['MVY']},\n",
       " {'runways': [3], 'code': ['MAD']},\n",
       " {'runways': [2], 'code': ['BJM']},\n",
       " {'runways': [2], 'code': ['HET']},\n",
       " {'runways': [2], 'code': ['FOE']},\n",
       " {'runways': [2], 'code': ['LGA']},\n",
       " {'runways': [2], 'code': ['HVN']},\n",
       " {'runways': [2], 'code': ['ELG']},\n",
       " {'runways': [2], 'code': ['HUY']},\n",
       " {'runways': [2], 'code': ['FOD']},\n",
       " {'runways': [2], 'code': ['YHZ']},\n",
       " {'runways': [2], 'code': ['MED']},\n",
       " {'runways': [2], 'code': ['BYN']},\n",
       " {'runways': [2], 'code': ['LEN']},\n",
       " {'runways': [3], 'code': ['YNG']},\n",
       " {'runways': [2], 'code': ['ESL']},\n",
       " {'runways': [2], 'code': ['WSN']},\n",
       " {'runways': [2], 'code': ['WMB']},\n",
       " {'runways': [2], 'code': ['KIX']},\n",
       " {'runways': [3], 'code': ['PSC']},\n",
       " {'runways': [2], 'code': ['SSA']},\n",
       " {'runways': [2], 'code': ['EAR']},\n",
       " {'runways': [2], 'code': ['ULP']},\n",
       " {'runways': [2], 'code': ['KER']},\n",
       " {'runways': [3], 'code': ['ROV']},\n",
       " {'runways': [3], 'code': ['MLI']},\n",
       " {'runways': [2], 'code': ['CRP']},\n",
       " {'runways': [3], 'code': ['ELD']},\n",
       " {'runways': [2], 'code': ['LED']},\n",
       " {'runways': [2], 'code': ['MKG']},\n",
       " {'runways': [2], 'code': ['GDV']},\n",
       " {'runways': [2], 'code': ['SCU']},\n",
       " {'runways': [2], 'code': ['HIB']},\n",
       " {'runways': [2], 'code': ['SVX']},\n",
       " {'runways': [2], 'code': ['MOT']},\n",
       " {'runways': [2], 'code': ['RIA']},\n",
       " {'runways': [2], 'code': ['LAR']},\n",
       " {'runways': [3], 'code': ['SAT']},\n",
       " {'runways': [3], 'code': ['SBA']},\n",
       " {'runways': [3], 'code': ['HRL']},\n",
       " {'runways': [2], 'code': ['MOQ']},\n",
       " {'runways': [2], 'code': ['ANE']},\n",
       " {'runways': [2], 'code': ['OSL']},\n",
       " {'runways': [2], 'code': ['SLZ']},\n",
       " {'runways': [2], 'code': ['CEC']},\n",
       " {'runways': [2], 'code': ['ADK']},\n",
       " {'runways': [2], 'code': ['MHD']},\n",
       " {'runways': [2], 'code': ['DAD']},\n",
       " {'runways': [3], 'code': ['UIN']},\n",
       " {'runways': [3], 'code': ['YYC']},\n",
       " {'runways': [2], 'code': ['SUX']},\n",
       " {'runways': [3], 'code': ['ORY']},\n",
       " {'runways': [5], 'code': ['MKE']},\n",
       " {'runways': [2], 'code': ['CDR']},\n",
       " {'runways': [2], 'code': ['XTG']},\n",
       " {'runways': [2], 'code': ['TEB']},\n",
       " {'runways': [3], 'code': ['MLU']},\n",
       " {'runways': [4], 'code': ['LAS']},\n",
       " {'runways': [2], 'code': ['AIT']},\n",
       " {'runways': [2], 'code': ['VDA']},\n",
       " {'runways': [4], 'code': ['LEQ']},\n",
       " {'runways': [2], 'code': ['THG']},\n",
       " {'runways': [4], 'code': ['YUM']},\n",
       " {'runways': [3], 'code': ['LAU']},\n",
       " {'runways': [2], 'code': ['ORH']},\n",
       " {'runways': [3], 'code': ['IST']},\n",
       " {'runways': [2], 'code': ['LPY']},\n",
       " {'runways': [4], 'code': ['CPR']},\n",
       " {'runways': [3], 'code': ['ACH']},\n",
       " {'runways': [4], 'code': ['HOU']},\n",
       " {'runways': [2], 'code': ['POZ']},\n",
       " {'runways': [2], 'code': ['PUU']},\n",
       " {'runways': [2], 'code': ['LRE']},\n",
       " {'runways': [2], 'code': ['CDV']},\n",
       " {'runways': [3], 'code': ['OMA']},\n",
       " {'runways': [2], 'code': ['HOT']},\n",
       " {'runways': [2], 'code': ['SCO']},\n",
       " {'runways': [2], 'code': ['YPJ']},\n",
       " {'runways': [3], 'code': ['WRL']},\n",
       " {'runways': [2], 'code': ['MSL']},\n",
       " {'runways': [2], 'code': ['LUN']},\n",
       " {'runways': [3], 'code': ['BWU']},\n",
       " {'runways': [2], 'code': ['SIP']},\n",
       " {'runways': [2], 'code': ['ITM']},\n",
       " {'runways': [4], 'code': ['STL']},\n",
       " {'runways': [2], 'code': ['DIJ']},\n",
       " {'runways': [3], 'code': ['ALO']},\n",
       " {'runways': [2], 'code': ['ESB']},\n",
       " {'runways': [2], 'code': ['MHK']},\n",
       " {'runways': [3], 'code': ['KGC']},\n",
       " {'runways': [3], 'code': ['CPH']},\n",
       " {'runways': [3], 'code': ['BDL']},\n",
       " {'runways': [3], 'code': ['SJT']},\n",
       " {'runways': [2], 'code': ['NAS']},\n",
       " {'runways': [2], 'code': ['NGS']},\n",
       " {'runways': [2], 'code': ['AFW']},\n",
       " {'runways': [2], 'code': ['DAM']},\n",
       " {'runways': [3], 'code': ['BOI']},\n",
       " {'runways': [2], 'code': ['EMD']},\n",
       " {'runways': [2], 'code': ['PPP']},\n",
       " {'runways': [3], 'code': ['ENA']},\n",
       " {'runways': [4], 'code': ['PIE']},\n",
       " {'runways': [2], 'code': ['PLN']},\n",
       " {'runways': [2], 'code': ['CRK']},\n",
       " {'runways': [3], 'code': ['BLK']},\n",
       " {'runways': [2], 'code': ['TUO']},\n",
       " {'runways': [2], 'code': ['RJK']},\n",
       " {'runways': [2], 'code': ['BUD']},\n",
       " {'runways': [3], 'code': ['NDY']},\n",
       " {'runways': [3], 'code': ['BET']},\n",
       " {'runways': [2], 'code': ['GPT']},\n",
       " {'runways': [2], 'code': ['YQY']},\n",
       " {'runways': [2], 'code': ['SVG']},\n",
       " {'runways': [2], 'code': ['BFN']},\n",
       " {'runways': [4], 'code': ['SFB']},\n",
       " {'runways': [2], 'code': ['LHE']},\n",
       " {'runways': [2], 'code': ['CMH']},\n",
       " {'runways': [2], 'code': ['SHX']},\n",
       " {'runways': [2], 'code': ['KTN']},\n",
       " {'runways': [3], 'code': ['GET']},\n",
       " {'runways': [2], 'code': ['LPA']},\n",
       " {'runways': [3], 'code': ['GRR']},\n",
       " {'runways': [2], 'code': ['GKA']},\n",
       " {'runways': [3], 'code': ['WHK']},\n",
       " {'runways': [2], 'code': ['BOM']},\n",
       " {'runways': [2], 'code': ['TNN']},\n",
       " {'runways': [2], 'code': ['ALS']},\n",
       " {'runways': [3], 'code': ['SMA']},\n",
       " {'runways': [3], 'code': ['JED']},\n",
       " {'runways': [2], 'code': ['TNG']},\n",
       " {'runways': [2], 'code': ['CSG']},\n",
       " {'runways': [3], 'code': ['FWA']},\n",
       " {'runways': [2], 'code': ['MNL']},\n",
       " {'runways': [2], 'code': ['DPO']},\n",
       " {'runways': [2], 'code': ['KGI']},\n",
       " {'runways': [2], 'code': ['BHS']},\n",
       " {'runways': [2], 'code': ['GHT']},\n",
       " {'runways': [2], 'code': ['LNZ']},\n",
       " {'runways': [2], 'code': ['WIL']},\n",
       " {'runways': [2], 'code': ['TTN']},\n",
       " {'runways': [2], 'code': ['MDT']},\n",
       " {'runways': [3], 'code': ['PGV']},\n",
       " {'runways': [2], 'code': ['KSM']},\n",
       " {'runways': [2], 'code': ['RDM']},\n",
       " {'runways': [3], 'code': ['BEY']},\n",
       " {'runways': [2], 'code': ['IXD']},\n",
       " {'runways': [2], 'code': ['KMQ']},\n",
       " {'runways': [2], 'code': ['OGX']},\n",
       " {'runways': [3], 'code': ['ASB']},\n",
       " {'runways': [3], 'code': ['LGB']},\n",
       " {'runways': [2], 'code': ['ABL']},\n",
       " {'runways': [2], 'code': ['CSY']},\n",
       " {'runways': [2], 'code': ['ATC']},\n",
       " {'runways': [2], 'code': ['COU']},\n",
       " {'runways': [2], 'code': ['YYR']},\n",
       " {'runways': [3], 'code': ['EUG']},\n",
       " {'runways': [2], 'code': ['PNQ']},\n",
       " {'runways': [3], 'code': ['RHI']},\n",
       " {'runways': [2], 'code': ['PER']},\n",
       " {'runways': [2], 'code': ['NAN']},\n",
       " {'runways': [2], 'code': ['FRW']},\n",
       " {'runways': [2], 'code': ['LWS']},\n",
       " {'runways': [2], 'code': ['IMT']},\n",
       " {'runways': [2], 'code': ['FAT']},\n",
       " {'runways': [2], 'code': ['YOL']},\n",
       " {'runways': [3], 'code': ['AYT']},\n",
       " {'runways': [2], 'code': ['UIP']},\n",
       " {'runways': [2], 'code': ['DNR']},\n",
       " {'runways': [2], 'code': ['TAS']},\n",
       " {'runways': [3], 'code': ['YYT']},\n",
       " {'runways': [2], 'code': ['AVP']},\n",
       " {'runways': [3], 'code': ['KUL']},\n",
       " {'runways': [2], 'code': ['AMM']},\n",
       " {'runways': [2], 'code': ['GUC']},\n",
       " {'runways': [2], 'code': ['SLW']},\n",
       " {'runways': [3], 'code': ['BHB']},\n",
       " {'runways': [2], 'code': ['TRZ']},\n",
       " {'runways': [3], 'code': ['YYB']},\n",
       " {'runways': [2], 'code': ['GST']},\n",
       " {'runways': [2], 'code': ['AUS']},\n",
       " {'runways': [5], 'code': ['GIS']},\n",
       " {'runways': [2], 'code': ['ZAZ']},\n",
       " {'runways': [2], 'code': ['REU']},\n",
       " {'runways': [2], 'code': ['TXL']},\n",
       " {'runways': [4], 'code': ['SLN']},\n",
       " {'runways': [3], 'code': ['KOI']},\n",
       " {'runways': [2], 'code': ['PQI']},\n",
       " {'runways': [2], 'code': ['CGI']},\n",
       " {'runways': [2], 'code': ['OAG']},\n",
       " {'runways': [2], 'code': ['ANI']},\n",
       " {'runways': [2], 'code': ['BKQ']},\n",
       " {'runways': [4], 'code': ['MSP']},\n",
       " {'runways': [5], 'code': ['KRP']},\n",
       " {'runways': [3], 'code': ['ZRH']},\n",
       " {'runways': [3], 'code': ['ALW']},\n",
       " {'runways': [2], 'code': ['ZBR']},\n",
       " {'runways': [2], 'code': ['PNA']},\n",
       " {'runways': [4], 'code': ['ZQN']},\n",
       " {'runways': [3], 'code': ['GTF']},\n",
       " {'runways': [3], 'code': ['FCA']},\n",
       " {'runways': [3], 'code': ['HAJ']},\n",
       " {'runways': [2], 'code': ['DIK']},\n",
       " {'runways': [3], 'code': ['YQX']},\n",
       " {'runways': [2], 'code': ['BHO']},\n",
       " {'runways': [2], 'code': ['IRK']},\n",
       " {'runways': [2], 'code': ['ADL']},\n",
       " {'runways': [3], 'code': ['ACK']},\n",
       " {'runways': [2], 'code': ['YBG']},\n",
       " {'runways': [2], 'code': ['LCJ']},\n",
       " {'runways': [2], 'code': ['OOL']},\n",
       " {'runways': [2], 'code': ['THU']},\n",
       " {'runways': [2], 'code': ['JNU']},\n",
       " {'runways': [2], 'code': ['CAN']},\n",
       " {'runways': [3], 'code': ['DAY']},\n",
       " {'runways': [2], 'code': ['UTN']},\n",
       " {'runways': [2], 'code': ['KUO']},\n",
       " {'runways': [2], 'code': ['NOV']},\n",
       " {'runways': [2], 'code': ['SBY']},\n",
       " {'runways': [2], 'code': ['KZN']},\n",
       " {'runways': [2], 'code': ['SLK']},\n",
       " {'runways': [2], 'code': ['VTZ']},\n",
       " {'runways': [2], 'code': ['CCS']},\n",
       " {'runways': [2], 'code': ['KUF']},\n",
       " {'runways': [2], 'code': ['MQL']},\n",
       " {'runways': [2], 'code': ['NCU']},\n",
       " {'runways': [2], 'code': ['MMU']},\n",
       " {'runways': [2], 'code': ['MMO']},\n",
       " {'runways': [2], 'code': ['CUN']},\n",
       " {'runways': [2], 'code': ['EUN']},\n",
       " {'runways': [2], 'code': ['VAK']},\n",
       " {'runways': [2], 'code': ['JKG']},\n",
       " {'runways': [2], 'code': ['MEB']},\n",
       " {'runways': [2], 'code': ['CNJ']},\n",
       " {'runways': [4], 'code': ['MCO']},\n",
       " {'runways': [2], 'code': ['BOD']},\n",
       " {'runways': [2], 'code': ['CVM']},\n",
       " {'runways': [3], 'code': ['CLL']},\n",
       " {'runways': [2], 'code': ['YZY']},\n",
       " {'runways': [3], 'code': ['YUL']},\n",
       " {'runways': [2], 'code': ['RUT']},\n",
       " {'runways': [3], 'code': ['LSI']},\n",
       " {'runways': [3], 'code': ['FSD']},\n",
       " {'runways': [2], 'code': ['YQL']},\n",
       " {'runways': [2], 'code': ['TIP']},\n",
       " {'runways': [2], 'code': ['UEL']},\n",
       " {'runways': [2], 'code': ['BNS']},\n",
       " {'runways': [2], 'code': ['DEF']},\n",
       " {'runways': [2], 'code': ['WIC']},\n",
       " {'runways': [2], 'code': ['FNT']},\n",
       " {'runways': [2], 'code': ['GHA']},\n",
       " {'runways': [2], 'code': ['MSU']},\n",
       " {'runways': [3], 'code': ['TRE']},\n",
       " {'runways': [4], 'code': ['MIA']},\n",
       " {'runways': [2], 'code': ['OUA']},\n",
       " {'runways': [3], 'code': ['YWG']},\n",
       " {'runways': [3], 'code': ['IOM']},\n",
       " {'runways': [2], 'code': ['HON']},\n",
       " {'runways': [2], 'code': ['ONT']},\n",
       " {'runways': [3], 'code': ['PPW']},\n",
       " {'runways': [3], 'code': ['MGB']},\n",
       " {'runways': [2], 'code': ['KOK']},\n",
       " {'runways': [2], 'code': ['BFD']},\n",
       " {'runways': [2], 'code': ['BTS']},\n",
       " {'runways': [3], 'code': ['SWO']},\n",
       " {'runways': [2], 'code': ['BVI']},\n",
       " {'runways': [2], 'code': ['PGF']},\n",
       " {'runways': [2], 'code': ['KEF']},\n",
       " {'runways': [2], 'code': ['YQM']},\n",
       " {'runways': [2], 'code': ['MRZ']},\n",
       " {'runways': [3], 'code': ['PBI']},\n",
       " {'runways': [2], 'code': ['BVE']},\n",
       " {'runways': [2], 'code': ['WYA']},\n",
       " {'runways': [3], 'code': ['THR']},\n",
       " {'runways': [2], 'code': ['GRQ']},\n",
       " {'runways': [2], 'code': ['TWB']},\n",
       " {'runways': [2], 'code': ['SRX']},\n",
       " {'runways': [3], 'code': ['DAB']},\n",
       " {'runways': [2], 'code': ['LHR']},\n",
       " {'runways': [2], 'code': ['CMA']},\n",
       " {'runways': [2], 'code': ['WRE']},\n",
       " {'runways': [2], 'code': ['LXA']},\n",
       " {'runways': [4], 'code': ['VVO']},\n",
       " {'runways': [2], 'code': ['ACT']},\n",
       " {'runways': [2], 'code': ['UNK']},\n",
       " {'runways': [3], 'code': ['FCO']},\n",
       " {'runways': [2], 'code': ['BFF']},\n",
       " {'runways': [2], 'code': ['HYA']},\n",
       " {'runways': [2], 'code': ['IXA']},\n",
       " {'runways': [2], 'code': ['PIA']},\n",
       " {'runways': [2], 'code': ['CHA']},\n",
       " {'runways': [2], 'code': ['FLO']},\n",
       " {'runways': [4], 'code': ['PUB']},\n",
       " {'runways': [2], 'code': ['ISN']},\n",
       " {'runways': [2], 'code': ['RKD']},\n",
       " {'runways': [2], 'code': ['KWJ']},\n",
       " {'runways': [2], 'code': ['ORK']},\n",
       " {'runways': [3], 'code': ['TVC']},\n",
       " {'runways': [3], 'code': ['DCA']},\n",
       " {'runways': [2], 'code': ['KLR']},\n",
       " {'runways': [4], 'code': ['ABQ']},\n",
       " {'runways': [3], 'code': ['PKC']},\n",
       " {'runways': [2], 'code': ['YQQ']},\n",
       " {'runways': [3], 'code': ['RAI']},\n",
       " {'runways': [2], 'code': ['BHQ']},\n",
       " {'runways': [2], 'code': ['FLN']},\n",
       " {'runways': [2], 'code': ['ULN']},\n",
       " {'runways': [2], 'code': ['UKK']},\n",
       " {'runways': [2], 'code': ['DMK']},\n",
       " {'runways': [3], 'code': ['CAI']},\n",
       " {'runways': [3], 'code': ['DAL']},\n",
       " {'runways': [2], 'code': ['YQR']},\n",
       " {'runways': [3], 'code': ['YTZ']},\n",
       " {'runways': [2], 'code': ['KIR']},\n",
       " {'runways': [2], 'code': ['BSC']},\n",
       " {'runways': [2], 'code': ['RDD']},\n",
       " {'runways': [4], 'code': ['FAI']},\n",
       " {'runways': [2], 'code': ['BOB']},\n",
       " {'runways': [2], 'code': ['ZAH']},\n",
       " {'runways': [2], 'code': ['AUH']},\n",
       " {'runways': [2], 'code': ['PTH']},\n",
       " {'runways': [2], 'code': ['KIM']},\n",
       " {'runways': [2], 'code': ['SDY']},\n",
       " {'runways': [5], 'code': ['MDW']},\n",
       " {'runways': [2], 'code': ['SCK']},\n",
       " {'runways': [2], 'code': ['YVP']},\n",
       " {'runways': [2], 'code': ['FAY']},\n",
       " {'runways': [2], 'code': ['RMA']},\n",
       " {'runways': [2], 'code': ['ILY']},\n",
       " {'runways': [2], 'code': ['SNA']},\n",
       " {'runways': [2], 'code': ['YJT']},\n",
       " {'runways': [2], 'code': ['ADB']},\n",
       " {'runways': [2], 'code': ['BUQ']},\n",
       " {'runways': [2], 'code': ['DIU']},\n",
       " {'runways': [2], 'code': ['VLC']},\n",
       " {'runways': [2], 'code': ['SLA']},\n",
       " {'runways': [4], 'code': ['PIT']},\n",
       " {'runways': [2], 'code': ['MOD']},\n",
       " {'runways': [2], 'code': ['AGB']},\n",
       " {'runways': [3], 'code': ['PRC']},\n",
       " {'runways': [2], 'code': ['LAD']},\n",
       " {'runways': [2], 'code': ['ROA']},\n",
       " {'runways': [2], 'code': ['SLP']},\n",
       " {'runways': [4], 'code': ['EBL']},\n",
       " {'runways': [2], 'code': ['PTY']},\n",
       " {'runways': [2], 'code': ['VLL']},\n",
       " {'runways': [2], 'code': ['MFR']},\n",
       " {'runways': [2], 'code': ['DBO']},\n",
       " {'runways': [2], 'code': ['YGR']},\n",
       " {'runways': [3], 'code': ['ICT']},\n",
       " {'runways': [2], 'code': ['SWF']},\n",
       " {'runways': [4], 'code': ['LAX']},\n",
       " {'runways': [2], 'code': ['NCE']},\n",
       " {'runways': [3], 'code': ['LRD']},\n",
       " {'runways': [2], 'code': ['EOI']},\n",
       " {'runways': [2], 'code': ['MZR']},\n",
       " {'runways': [2], 'code': ['HTS']},\n",
       " {'runways': [2], 'code': ['GIG']},\n",
       " {'runways': [2], 'code': ['ASM']},\n",
       " {'runways': [3], 'code': ['HEL']},\n",
       " {'runways': [2], 'code': ['KHV']},\n",
       " {'runways': [2], 'code': ['BSG']},\n",
       " {'runways': [4], 'code': ['CMI']},\n",
       " {'runways': [2], 'code': ['SLL']},\n",
       " {'runways': [2], 'code': ['GIL']},\n",
       " {'runways': [2], 'code': ['BKW']},\n",
       " {'runways': [2], 'code': ['CUC']},\n",
       " {'runways': [2], 'code': ['CDC']},\n",
       " {'runways': [2], 'code': ['SLM']},\n",
       " {'runways': [3], 'code': ['IGM']},\n",
       " {'runways': [2], 'code': ['TGD']},\n",
       " {'runways': [2], 'code': ['SID']},\n",
       " {'runways': [2], 'code': ['POR']},\n",
       " {'runways': [2], 'code': ['LBL']},\n",
       " {'runways': [2], 'code': ['TRC']},\n",
       " {'runways': [3], 'code': ['SAF']},\n",
       " {'runways': [2], 'code': ['LBF']},\n",
       " {'runways': [3], 'code': ['ICN']},\n",
       " {'runways': [2], 'code': ['SJU']},\n",
       " {'runways': [2], 'code': ['EGE']},\n",
       " {'runways': [2], 'code': ['JAN']},\n",
       " {'runways': [2], 'code': ['GAL']},\n",
       " {'runways': [2], 'code': ['INH']},\n",
       " {'runways': [2], 'code': ['YMO']},\n",
       " ...]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    " g.V().has('runways', P.inside(2, 6)).valueMap('code', 'runways').fold().next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1052"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V().has('runways', P.inside(2, 6)).count().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## outside()\n",
    "__Airports that have less than 3 or more than 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3084"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "y1 = g.V().has('airport', 'runways', P.outside(3, 5)).count().next()\n",
    "y1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## within()\n",
    "__Airports that have 3 or more but 5 or less runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "# x3 = g.V().has('runways', P.within(3..5)).count().next()\n",
    "# assert x1 == x3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Airports with 3, 4 or 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "290"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x4 = g.V().has('runways', P.within([3,4,5])).count().next()\n",
    "# assert x3 == x4\n",
    "x4"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## without()\n",
    "__Airports that have less than 3 or more than 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# x5 = g.V().has('runways', P.without(3..5)).count().next()\n",
    "# assert x2 == x5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Airports that do not have 3, 4 or 5 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "y2 = g.V().has('airport', 'runways', P.without([3,4,5])).count().next()\n",
    "assert y1 == y2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## between()\n",
    "__Airports that have 3 or more but less than 6 runways__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "x6 = g.V().has('runways', P.between(3, 6)).count().next()\n",
    "assert x4 == x6"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Has vertex ID within Sydney's and Hong Kong's__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['HKG', 'SYD']"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().hasId(P.within([sydneyVertexId, hkVertexId])).values('code').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Airports in NSW that do not have the city \"Sydney\"__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Tamworth',\n",
       " 'Port Macquarie',\n",
       " 'Lismore',\n",
       " 'Wagga Wagga',\n",
       " 'Moruya',\n",
       " 'Albury',\n",
       " 'Taree',\n",
       " 'Merimbula',\n",
       " 'Parkes',\n",
       " 'Coffs Harbour',\n",
       " 'Narrandera',\n",
       " 'Griffith',\n",
       " 'Narrabri',\n",
       " 'Lord Howe Island',\n",
       " 'Bathurst',\n",
       " 'Orange',\n",
       " 'Gold Coast',\n",
       " 'Grafton',\n",
       " 'Ballina',\n",
       " 'Williamtown',\n",
       " 'Moree',\n",
       " 'Broken Hill',\n",
       " 'Dubbo',\n",
       " 'Armidale']"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('airport','region','AU-NSW').has('city', P.neq('Sydney')).values('city').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Path of flights from Hong Kong to Sydney which have 1 stop in Australia__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['HKG', 'BNE', 'SYD'],\n",
       " ['HKG', 'MEL', 'SYD'],\n",
       " ['HKG', 'CNS', 'SYD'],\n",
       " ['HKG', 'PER', 'SYD'],\n",
       " ['HKG', 'ADL', 'SYD']]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('airport','code','HKG').out().has('country', P.within('AU')).out().has('code','SYD').path().by('code').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Path of flights from Hong Kong to Sydney which do not have 1 stop in Australia, Japan or China__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['HK', 'US', 'AU'],\n",
       " ['HK', 'US', 'AU'],\n",
       " ['HK', 'US', 'AU'],\n",
       " ['HK', 'QA', 'AU'],\n",
       " ['HK', 'NZ', 'AU'],\n",
       " ['HK', 'TH', 'AU'],\n",
       " ['HK', 'MY', 'AU'],\n",
       " ['HK', 'VN', 'AU'],\n",
       " ['HK', 'ID', 'AU'],\n",
       " ['HK', 'KR', 'AU'],\n",
       " ['HK', 'ZA', 'AU'],\n",
       " ['HK', 'ID', 'AU'],\n",
       " ['HK', 'CA', 'AU'],\n",
       " ['HK', 'AE', 'AU'],\n",
       " ['HK', 'SG', 'AU'],\n",
       " ['HK', 'AE', 'AU'],\n",
       " ['HK', 'IN', 'AU'],\n",
       " ['HK', 'PH', 'AU'],\n",
       " ['HK', 'PG', 'AU'],\n",
       " ['HK', 'TH', 'AU'],\n",
       " ['HK', 'VN', 'AU'],\n",
       " ['HK', 'FJ', 'AU'],\n",
       " ['HK', 'TW', 'AU']]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('airport','code','HKG').out().has('country', P.without(['AU', 'JP', 'CN'])).out().has('code','SYD').path().by('country').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Between can also be used to simulate \"starts with\"__\n",
    "\n",
    "All airports that have a city name starting with \"Dal\" or \"Dam\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Dalcahue', 'Dalat', 'Dalanzadgad', 'Dalaman', 'Dalian', 'Dallas']"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('city', P.between('Dal', 'Dam')).values('city').dedup().fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Trick to find strings that begin with a single character (S)__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['SYR',\n",
       " 'SOW',\n",
       " 'SVO',\n",
       " 'SBP',\n",
       " 'SGF',\n",
       " 'SVJ',\n",
       " 'SJL',\n",
       " 'SDJ',\n",
       " 'SSR',\n",
       " 'SPN',\n",
       " 'SIT',\n",
       " 'SJP',\n",
       " 'SJZ',\n",
       " 'SDL',\n",
       " 'SRP',\n",
       " 'SLC',\n",
       " 'SLY',\n",
       " 'SOG',\n",
       " 'SFG',\n",
       " 'SJE',\n",
       " 'SBN',\n",
       " 'SRG',\n",
       " 'SNN',\n",
       " 'SYY',\n",
       " 'SHV',\n",
       " 'SEA',\n",
       " 'SCN',\n",
       " 'SCC',\n",
       " 'SGC',\n",
       " 'SKG',\n",
       " 'SDQ',\n",
       " 'SGN',\n",
       " 'SHW',\n",
       " 'SAL',\n",
       " 'SVP',\n",
       " 'SVK',\n",
       " 'SHR',\n",
       " 'SCV',\n",
       " 'SGO',\n",
       " 'SYX',\n",
       " 'SJC',\n",
       " 'SGU',\n",
       " 'SNE',\n",
       " 'SOU',\n",
       " 'SYM',\n",
       " 'STS',\n",
       " 'SVA',\n",
       " 'SYO',\n",
       " 'SUF',\n",
       " 'SFJ',\n",
       " 'SZX',\n",
       " 'SKO',\n",
       " 'STI',\n",
       " 'SFO',\n",
       " 'SDR',\n",
       " 'SZI',\n",
       " 'SDU',\n",
       " 'SCW',\n",
       " 'SCT',\n",
       " 'SNW',\n",
       " 'SMF',\n",
       " 'SHM',\n",
       " 'SPD',\n",
       " 'SYD',\n",
       " 'SFL',\n",
       " 'SAW',\n",
       " 'SIN',\n",
       " 'SOQ',\n",
       " 'SVD',\n",
       " 'SHD',\n",
       " 'SXP',\n",
       " 'SAV',\n",
       " 'SZF',\n",
       " 'SZB',\n",
       " 'SKZ',\n",
       " 'SHC',\n",
       " 'SOY',\n",
       " 'SUV',\n",
       " 'SHF',\n",
       " 'SVL',\n",
       " 'SMX',\n",
       " 'SZA',\n",
       " 'STC',\n",
       " 'SUB',\n",
       " 'SVU',\n",
       " 'SZG',\n",
       " 'SHA',\n",
       " 'SOM',\n",
       " 'SCL',\n",
       " 'SRQ',\n",
       " 'SFN',\n",
       " 'SLQ',\n",
       " 'SON',\n",
       " 'SMK',\n",
       " 'SSY',\n",
       " 'SWA',\n",
       " 'SMS',\n",
       " 'SDF',\n",
       " 'SAN',\n",
       " 'SNO',\n",
       " 'SPR',\n",
       " 'SNP',\n",
       " 'SBH',\n",
       " 'SGD',\n",
       " 'SPC',\n",
       " 'SXB',\n",
       " 'SVC',\n",
       " 'SRE',\n",
       " 'SKT',\n",
       " 'SKN',\n",
       " 'SJO',\n",
       " 'SBZ',\n",
       " 'SYZ',\n",
       " 'SVZ',\n",
       " 'SOF',\n",
       " 'SXF',\n",
       " 'SVI',\n",
       " 'SFT',\n",
       " 'SPI',\n",
       " 'SAB',\n",
       " 'SNV',\n",
       " 'SKK',\n",
       " 'SUN',\n",
       " 'STV',\n",
       " 'SHH',\n",
       " 'SAH',\n",
       " 'SLH',\n",
       " 'SYQ',\n",
       " 'SUK',\n",
       " 'STN',\n",
       " 'STM',\n",
       " 'SXK',\n",
       " 'SNU',\n",
       " 'SSA',\n",
       " 'SDE',\n",
       " 'SML',\n",
       " 'SCU',\n",
       " 'SVX',\n",
       " 'SAT',\n",
       " 'SBA',\n",
       " 'SXI',\n",
       " 'STR',\n",
       " 'SLZ',\n",
       " 'SUG',\n",
       " 'SDN',\n",
       " 'SDG',\n",
       " 'SUX',\n",
       " 'SQS',\n",
       " 'SEN',\n",
       " 'STT',\n",
       " 'SPP',\n",
       " 'SCO',\n",
       " 'SJD',\n",
       " 'SVB',\n",
       " 'SIP',\n",
       " 'STL',\n",
       " 'SJT',\n",
       " 'SCZ',\n",
       " 'SMR',\n",
       " 'SRY',\n",
       " 'SVG',\n",
       " 'SFB',\n",
       " 'SFA',\n",
       " 'SHX',\n",
       " 'SEZ',\n",
       " 'SKP',\n",
       " 'SMA',\n",
       " 'SLW',\n",
       " 'SLX',\n",
       " 'SKB',\n",
       " 'SLN',\n",
       " 'SKU',\n",
       " 'SJW',\n",
       " 'SBY',\n",
       " 'SPU',\n",
       " 'SLK',\n",
       " 'SHG',\n",
       " 'SGY',\n",
       " 'SDD',\n",
       " 'SXR',\n",
       " 'SUJ',\n",
       " 'SZZ',\n",
       " 'SAP',\n",
       " 'SCM',\n",
       " 'SVS',\n",
       " 'SWO',\n",
       " 'SDK',\n",
       " 'SRZ',\n",
       " 'SKX',\n",
       " 'SZE',\n",
       " 'SRX',\n",
       " 'SCY',\n",
       " 'SMI',\n",
       " 'SHL',\n",
       " 'SBW',\n",
       " 'SHP',\n",
       " 'SKE',\n",
       " 'SOC',\n",
       " 'SCQ',\n",
       " 'SSJ',\n",
       " 'SHE',\n",
       " 'SDV',\n",
       " 'SDY',\n",
       " 'SDP',\n",
       " 'SCK',\n",
       " 'SZY',\n",
       " 'SNA',\n",
       " 'SCE',\n",
       " 'SWJ',\n",
       " 'SLA',\n",
       " 'SLP',\n",
       " 'STG',\n",
       " 'SWF',\n",
       " 'SQJ',\n",
       " 'SRA',\n",
       " 'SKD',\n",
       " 'SLL',\n",
       " 'SLM',\n",
       " 'SID',\n",
       " 'SHJ',\n",
       " 'SAF',\n",
       " 'SJU',\n",
       " 'STX',\n",
       " 'SPS',\n",
       " 'SHB',\n",
       " 'SJJ',\n",
       " 'SFH',\n",
       " 'SSG',\n",
       " 'SLI',\n",
       " 'SXM',\n",
       " 'STD',\n",
       " 'SSH',\n",
       " 'SVQ',\n",
       " 'STW',\n",
       " 'SJI',\n",
       " 'SLU',\n",
       " 'SJK',\n",
       " 'SOJ']"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has('airport','code',P.between('S','Sa')).values('code').fold().next()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
