{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 17. Both, BothE, BothV, OtherV\n",
    "#### By Kwan Yin Andrew Chau"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nbfinder\n",
    "from loader import g\n",
    "from loader import __\n",
    "from loader import Barrier\n",
    "from loader import Column\n",
    "from loader import P\n",
    "from loader import Pick\n",
    "from loader import Pop\n",
    "from loader import T\n",
    "from loader import sydneyVertexId\n",
    "from loader import hkVertexId"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## sideEffect()\n",
    "\n",
    "__Store destinations directly out of HK and destinations 2 stops away__\n",
    "\n",
    "Side effects do not change what gets passed on to the next stage of the query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'direct': [151], 'twoStopsAway': 11716}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).sideEffect(\n",
    "    __.out().count().store('direct')\n",
    ").out().out().count().as_('twoStopsAway').select('direct','twoStopsAway').next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__This can also be done by grouping into a map__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "runningSe = lambda: print(\"running...\")\n",
    "# TODO\n",
    "#g.V().has('code','SFO').sideEffect(runningSe).next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Count how many places we can go to from HK within one stop"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1883"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V(hkVertexId).out().out().dedup().count().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## aggregate()\n",
    "\n",
    "__Aggregate allows us to create a temporary collection__\n",
    "\n",
    "Count how many places we can go to from HK that is only possible when stopping once"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1732"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x2 = g.V(hkVertexId).out().aggregate('direct').out().where(P.without('direct')).dedup().count().next()\n",
    "x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This is equal to the non-aggregate count minus the direct count"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "directCount = g.V(hkVertexId).out().count().next()\n",
    "assert x1 - directCount == x2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## inject()\n",
    "\n",
    "__Inject the rating into the values of the HK vertex__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Rating',\n",
       " 8,\n",
       " 'HKG',\n",
       " 'airport',\n",
       " 'Hong Kong - Chek Lap Kok International Airport',\n",
       " 'HK',\n",
       " 12467,\n",
       " 'Hong Kong',\n",
       " 28,\n",
       " 'VHHH',\n",
       " 113.915000916,\n",
       " 'HK',\n",
       " 2,\n",
       " 22.3089008331]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).values().inject(8).inject('Rating').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "__Look for whether there is the ABC vertex__\n",
    "\n",
    "This however returns a result for every vertex traversed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " 'None found',\n",
       " ...]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().choose(__.V(\"ABC\").count().is_(0), __.constant(\"None found\")).fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can limit this down to how ever many by injecting things after the source (g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['None found', 'None found']"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.inject(\"a\", \"b\").choose(__.V(\"ABC\").count().is_(0), __.constant(\"None found\")).fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## coalesce()\n",
    "__Use the first step inside coalesce that returns at least once vertex__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Hong Kong', 'Asia']"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).coalesce(__.out('fake'), __.in_('contains')).values('desc').fold().next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "constant() can be used as a fallback to coalesce()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'No Match'"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V(hkVertexId).coalesce(__.out('fake'), __.out('fake2'), __.constant('No Match')).next()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## optional()\n",
    "__Return the prior step (HK) if there is no route to a certain code__"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Hong Kong']"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x1 = g.V(hkVertexId).optional(__.out().has('code','FAKE')).values('city').fold().next()\n",
    "x1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Sydney']"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "y1 = g.V(hkVertexId).optional(__.out().hasId(sydneyVertexId)).values('city').fold().next()\n",
    "y1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can do the same thing by using identity() with coalesce()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "x2 = g.V(hkVertexId).coalesce(__.out().has('code','FAKE'), __.identity()).values('city').fold().next()\n",
    "assert x1 == x2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "y2 = g.V(hkVertexId).coalesce(__.out().hasId(sydneyVertexId), __.identity()).values('city').fold().next()\n",
    "assert y1 == y2"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
